hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/**
 * @file     tm4c123gh6pm-fields.h
 * @brief    Contains bit and bit fields definition for tm4c123gh6pm
 *
 * @version  V1.00
 * @date     25/3/2016
 *
 * @note     Symbols ended in _B are bits
 * @note     Symbols ended in _M are bit masks
 * @note     Symbols ended in _V are values, e.g., for bit fields
 *
 **/
#ifndef TM4C123_FIELDS_H
#define TM4C123_FIELDS_H

/******************************************************************************/
/*                                                                            */
/*                      INT                                                   */
/*                                                                            */
/******************************************************************************/

#define INT_GPIOA_V                 16 // GPIO Port A
#define INT_GPIOB_V                 17 // GPIO Port B
#define INT_GPIOC_V                 18 // GPIO Port C
#define INT_GPIOD_V                 19 // GPIO Port D
#define INT_GPIOE_V                 20 // GPIO Port E
#define INT_UART0_V                 21 // UART0
#define INT_UART1_V                 22 // UART1
#define INT_SSI0_V                  23 // SSI0
#define INT_I2C0_V                  24 // I2C0
#define INT_PWM0_FAULT_V            25 // PWM0 Fault
#define INT_PWM0_0_V                26 // PWM0 Generator 0
#define INT_PWM0_1_V                27 // PWM0 Generator 1
#define INT_PWM0_2_V                28 // PWM0 Generator 2
#define INT_QEI0_V                  29 // QEI0
#define INT_ADC0SS0_V               30 // ADC0 Sequence 0
#define INT_ADC0SS1_V               31 // ADC0 Sequence 1
#define INT_ADC0SS2_V               32 // ADC0 Sequence 2
#define INT_ADC0SS3_V               33 // ADC0 Sequence 3
#define INT_WATCHDOG_V              34 // Watchdog Timers 0 and 1
#define INT_TIMER0A_V               35 // 16/32-Bit Timer 0A
#define INT_TIMER0B_V               36 // 16/32-Bit Timer 0B
#define INT_TIMER1A_V               37 // 16/32-Bit Timer 1A
#define INT_TIMER1B_V               38 // 16/32-Bit Timer 1B
#define INT_TIMER2A_V               39 // 16/32-Bit Timer 2A
#define INT_TIMER2B_V               40 // 16/32-Bit Timer 2B
#define INT_COMP0_V                 41 // Analog Comparator 0
#define INT_COMP1_V                 42 // Analog Comparator 1
#define INT_SYSCTL_V                44 // System Control
#define INT_FLASH_V                 45 // Flash Memory Control and EEPROM
#define INT_GPIOF_V                 46 // GPIO Port F
#define INT_UART2_V                 49 // UART2
#define INT_SSI1_V                  50 // SSI1
#define INT_TIMER3A_V               51 // 16/32-Bit Timer 3A
#define INT_TIMER3B_V               52 // Timer 3B
#define INT_I2C1_V                  53 // I2C1
#define INT_QEI1_V                  54 // QEI1
#define INT_CAN0_V                  55 // CAN0
#define INT_CAN1_V                  56 // CAN1
#define INT_HIBERNATE_V             59 // Hibernation Module
#define INT_USB0_V                  60 // USB
#define INT_PWM0_3_V                61 // PWM Generator 3
#define INT_UDMA_V                  62 // uDMA Software
#define INT_UDMAERR_V               63 // uDMA Error
#define INT_ADC1SS0_V               64 // ADC1 Sequence 0
#define INT_ADC1SS1_V               65 // ADC1 Sequence 1
#define INT_ADC1SS2_V               66 // ADC1 Sequence 2
#define INT_ADC1SS3_V               67 // ADC1 Sequence 3
#define INT_SSI2_V                  73 // SSI2
#define INT_SSI3_V                  74 // SSI3
#define INT_UART3_V                 75 // UART3
#define INT_UART4_V                 76 // UART4
#define INT_UART5_V                 77 // UART5
#define INT_UART6_V                 78 // UART6
#define INT_UART7_V                 79 // UART7
#define INT_I2C2_V                  84 // I2C2
#define INT_I2C3_V                  85 // I2C3
#define INT_TIMER4A_V               86 // 16/32-Bit Timer 4A
#define INT_TIMER4B_V               87 // 16/32-Bit Timer 4B
#define INT_TIMER5A_V               108 // 16/32-Bit Timer 5A
#define INT_TIMER5B_V               109 // 16/32-Bit Timer 5B
#define INT_WTIMER0A_V              110 // 32/64-Bit Timer 0A
#define INT_WTIMER0B_V              111 // 32/64-Bit Timer 0B
#define INT_WTIMER1A_V              112 // 32/64-Bit Timer 1A
#define INT_WTIMER1B_V              113 // 32/64-Bit Timer 1B
#define INT_WTIMER2A_V              114 // 32/64-Bit Timer 2A
#define INT_WTIMER2B_V              115 // 32/64-Bit Timer 2B
#define INT_WTIMER3A_V              116 // 32/64-Bit Timer 3A
#define INT_WTIMER3B_V              117 // 32/64-Bit Timer 3B
#define INT_WTIMER4A_V              118 // 32/64-Bit Timer 4A
#define INT_WTIMER4B_V              119 // 32/64-Bit Timer 4B
#define INT_WTIMER5A_V              120 // 32/64-Bit Timer 5A
#define INT_WTIMER5B_V              121 // 32/64-Bit Timer 5B
#define INT_SYSEXC_V                122 // System Exception (imprecise)
#define INT_PWM1_0_V                150 // PWM1 Generator 0
#define INT_PWM1_1_V                151 // PWM1 Generator 1
#define INT_PWM1_2_V                152 // PWM1 Generator 2
#define INT_PWM1_3_V                153 // PWM1 Generator 3
#define INT_PWM1_FAULT_V            154 // PWM1 Fault


/******************************************************************************/
/*                                                                            */
/*                      UDMA                                                  */
/*                                                                            */
/******************************************************************************/


/* Bit/Fields in Register SRCENDP of Module UDMA                              */
#define UDMA_SRCENDP_V              0x00000000 // DMA Channel Source Address End

/* Bit/Fields in Register DSTENDP of Module UDMA                              */
#define UDMA_DSTENDP_B              0x00000004 // DMA Channel Destination Address

/* Bit/Fields in Register CHCTL of Module UDMA                                */
#define UDMA_CHCTL_B                0x00000008 // DMA Channel Control Word


/******************************************************************************/
/*                                                                            */
/*                      WDT                                                   */
/*                                                                            */
/******************************************************************************/


/* Bit/Fields in Register LOAD of Module WDT                                  */
#define WDT_LOAD_M                  0xFFFFFFFF // Watchdog Load Value
#define WDT_LOAD_S                  0          // Watchdog Load Value

/* Bit/Fields in Register VALUE of Module WDT                                 */
#define WDT_VALUE_M                 0xFFFFFFFF // Watchdog Value
#define WDT_VALUE_S                 0          // Watchdog Value

/* Bit/Fields in Register CTL of Module WDT                                   */
#define WDT_CTL_WRC_B               0x80000000 // Write Complete
#define WDT_CTL_INTTYPE_B           0x00000004 // Watchdog Interrupt Type
#define WDT_CTL_RESEN_B             0x00000002 // Watchdog Reset Enable
#define WDT_CTL_INTEN_B             0x00000001 // Watchdog Interrupt Enable

