hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register ICR of Module WDT                                   */
#define WDT_ICR_M                   0xFFFFFFFF // Watchdog Interrupt Clear
#define WDT_ICR_S                   0          // Watchdog Interrupt Clear

/* Bit/Fields in Register RIS of Module WDT                                   */
#define WDT_RIS_WDTRIS_B            0x00000001 // Watchdog Raw Interrupt Status

/* Bit/Fields in Register MIS of Module WDT                                   */
#define WDT_MIS_WDTMIS_B            0x00000001 // Watchdog Masked Interrupt Status

/* Bit/Fields in Register TEST of Module WDT                                  */
#define WDT_TEST_STALL_B            0x00000100 // Watchdog Stall Enable

/* Bit/Fields in Register LOCK of Module WDT                                  */
#define WDT_LOCK_M                  0xFFFFFFFF // Watchdog Lock
#define WDT_LOCK_S                  0          // Watchdog Lock
#define WDT_LOCK_UNLOCKED_V         0x00000000 // Unlocked
#define WDT_LOCK_LOCKED_V           0x00000001 // Locked
#define WDT_LOCK_UNLOCK_V           0x1ACCE551 // Unlocks the watchdog timer


/******************************************************************************/
/*                                                                            */
/*                      GPIO                                                  */
/*                                                                            */
/******************************************************************************/


/* Bit/Fields in Register IM of Module GPIO                                   */
#define GPIO_IM_GPIO_M              0x000000FF // GPIO Interrupt Mask Enable
#define GPIO_IM_GPIO_S              0          // GPIO Interrupt Mask Enable

/* Bit/Fields in Register RIS of Module GPIO                                  */
#define GPIO_RIS_GPIO_M             0x000000FF // GPIO Interrupt Raw Status
#define GPIO_RIS_GPIO_S             0          // GPIO Interrupt Raw Status

/* Bit/Fields in Register MIS of Module GPIO                                  */
#define GPIO_MIS_GPIO_M             0x000000FF // GPIO Masked Interrupt Status
#define GPIO_MIS_GPIO_S             0          // GPIO Masked Interrupt Status

/* Bit/Fields in Register ICR of Module GPIO                                  */
#define GPIO_ICR_GPIO_M             0x000000FF // GPIO Interrupt Clear
#define GPIO_ICR_GPIO_S             0          // GPIO Interrupt Clear

/* Bit/Fields in Register LOCK of Module GPIO                                 */
#define GPIO_LOCK_M                 0xFFFFFFFF // GPIO Lock
#define GPIO_LOCK_S                 0          // GPIO Lock
#define GPIO_LOCK_UNLOCKED_V        0x00000000 // The GPIOCR register is unlocked
#define GPIO_LOCK_LOCKED_V          0x00000001 // The GPIOCR register is locked
#define GPIO_LOCK_KEY_V             0x4C4F434B // Unlocks the GPIO_CR register

/* Bit/Fields in Register PCTL of Module GPIO                                 */
#define GPIO_PCTL_PA7_M             0xF0000000 // PA7 Mask
#define GPIO_PCTL_PA7_S             28         // PA7 Mask
#define GPIO_PCTL_PA7_I2C1SDA_V     0x30000000 // I2C1SDA on PA7
#define GPIO_PCTL_PA7_M1PWM3_V      0x50000000 // M1PWM3 on PA7
#define GPIO_PCTL_PA6_M             0x0F000000 // PA6 Mask
#define GPIO_PCTL_PA6_S             24         // PA6 Mask
#define GPIO_PCTL_PA6_I2C1SCL_V     0x03000000 // I2C1SCL on PA6
#define GPIO_PCTL_PA6_M1PWM2_V      0x05000000 // M1PWM2 on PA6
#define GPIO_PCTL_PA5_M             0x00F00000 // PA5 Mask
#define GPIO_PCTL_PA5_S             20         // PA5 Mask
#define GPIO_PCTL_PA5_SSI0TX_V      0x00200000 // SSI0TX on PA5
#define GPIO_PCTL_PA4_M             0x000F0000 // PA4 Mask
#define GPIO_PCTL_PA4_S             16         // PA4 Mask
#define GPIO_PCTL_PA4_SSI0RX_V      0x00020000 // SSI0RX on PA4
#define GPIO_PCTL_PA3_M             0x0000F000 // PA3 Mask
#define GPIO_PCTL_PA3_S             12         // PA3 Mask
#define GPIO_PCTL_PA3_SSI0FSS_V     0x00002000 // SSI0FSS on PA3
#define GPIO_PCTL_PA2_M             0x00000F00 // PA2 Mask
#define GPIO_PCTL_PA2_S             8          // PA2 Mask
#define GPIO_PCTL_PA2_SSI0CLK_V     0x00000200 // SSI0CLK on PA2
#define GPIO_PCTL_PA1_M             0x000000F0 // PA1 Mask
#define GPIO_PCTL_PA1_S             4          // PA1 Mask
#define GPIO_PCTL_PA1_U0TX_V        0x00000010 // U0TX on PA1
#define GPIO_PCTL_PA1_CAN1TX_V      0x00000080 // CAN1TX on PA1
#define GPIO_PCTL_PA0_M             0x0000000F // PA0 Mask
#define GPIO_PCTL_PA0_S             0          // PA0 Mask
#define GPIO_PCTL_PA0_U0RX_V        0x00000001 // U0RX on PA0
#define GPIO_PCTL_PA0_CAN1RX_V      0x00000008 // CAN1RX on PA0
#define GPIO_PCTL_PB7_M             0xF0000000 // PB7 Mask
#define GPIO_PCTL_PB7_S             28         // PB7 Mask
#define GPIO_PCTL_PB7_SSI2TX_V      0x20000000 // SSI2TX on PB7
#define GPIO_PCTL_PB7_M0PWM1_V      0x40000000 // M0PWM1 on PB7
#define GPIO_PCTL_PB7_T0CCP1_V      0x70000000 // T0CCP1 on PB7
#define GPIO_PCTL_PB6_M             0x0F000000 // PB6 Mask
#define GPIO_PCTL_PB6_S             24         // PB6 Mask
#define GPIO_PCTL_PB6_SSI2RX_V      0x02000000 // SSI2RX on PB6
#define GPIO_PCTL_PB6_M0PWM0_V      0x04000000 // M0PWM0 on PB6
#define GPIO_PCTL_PB6_T0CCP0_V      0x07000000 // T0CCP0 on PB6
#define GPIO_PCTL_PB5_M             0x00F00000 // PB5 Mask
#define GPIO_PCTL_PB5_S             20         // PB5 Mask
#define GPIO_PCTL_PB5_SSI2FSS_V     0x00200000 // SSI2FSS on PB5
#define GPIO_PCTL_PB5_M0PWM3_V      0x00400000 // M0PWM3 on PB5
#define GPIO_PCTL_PB5_T1CCP1_V      0x00700000 // T1CCP1 on PB5
#define GPIO_PCTL_PB5_CAN0TX_V      0x00800000 // CAN0TX on PB5
#define GPIO_PCTL_PB4_M             0x000F0000 // PB4 Mask
#define GPIO_PCTL_PB4_S             16         // PB4 Mask
#define GPIO_PCTL_PB4_SSI2CLK_V     0x00020000 // SSI2CLK on PB4
#define GPIO_PCTL_PB4_M0PWM2_V      0x00040000 // M0PWM2 on PB4
#define GPIO_PCTL_PB4_T1CCP0_V      0x00070000 // T1CCP0 on PB4
#define GPIO_PCTL_PB4_CAN0RX_V      0x00080000 // CAN0RX on PB4
#define GPIO_PCTL_PB3_M             0x0000F000 // PB3 Mask
#define GPIO_PCTL_PB3_S             12         // PB3 Mask
#define GPIO_PCTL_PB3_I2C0SDA_V     0x00003000 // I2C0SDA on PB3
#define GPIO_PCTL_PB3_T3CCP1_V      0x00007000 // T3CCP1 on PB3
#define GPIO_PCTL_PB2_M             0x00000F00 // PB2 Mask
#define GPIO_PCTL_PB2_S             8          // PB2 Mask
#define GPIO_PCTL_PB2_I2C0SCL_V     0x00000300 // I2C0SCL on PB2
#define GPIO_PCTL_PB2_T3CCP0_V      0x00000700 // T3CCP0 on PB2
#define GPIO_PCTL_PB1_M             0x000000F0 // PB1 Mask
#define GPIO_PCTL_PB1_S             4          // PB1 Mask
#define GPIO_PCTL_PB1_USB0VBUS_V    0x00000000 // USB0VBUS on PB1
#define GPIO_PCTL_PB1_U1TX_V        0x00000010 // U1TX on PB1
#define GPIO_PCTL_PB1_T2CCP1_V      0x00000070 // T2CCP1 on PB1
#define GPIO_PCTL_PB0_M             0x0000000F // PB0 Mask
#define GPIO_PCTL_PB0_S             0          // PB0 Mask
#define GPIO_PCTL_PB0_USB0ID_V      0x00000000 // USB0ID on PB0
#define GPIO_PCTL_PB0_U1RX_V        0x00000001 // U1RX on PB0
#define GPIO_PCTL_PB0_T2CCP0_V      0x00000007 // T2CCP0 on PB0
#define GPIO_PCTL_PC7_M             0xF0000000 // PC7 Mask
#define GPIO_PCTL_PC7_S             28         // PC7 Mask
#define GPIO_PCTL_PC7_U3TX_V        0x10000000 // U3TX on PC7
#define GPIO_PCTL_PC7_WT1CCP1_V     0x70000000 // WT1CCP1 on PC7
#define GPIO_PCTL_PC7_USB0PFLT_V    0x80000000 // USB0PFLT on PC7
#define GPIO_PCTL_PC6_M             0x0F000000 // PC6 Mask
#define GPIO_PCTL_PC6_S             24         // PC6 Mask
#define GPIO_PCTL_PC6_U3RX_V        0x01000000 // U3RX on PC6
#define GPIO_PCTL_PC6_PHB1_V        0x06000000 // PHB1 on PC6
#define GPIO_PCTL_PC6_WT1CCP0_V     0x07000000 // WT1CCP0 on PC6
#define GPIO_PCTL_PC6_USB0EPEN_V    0x08000000 // USB0EPEN on PC6
#define GPIO_PCTL_PC5_M             0x00F00000 // PC5 Mask
#define GPIO_PCTL_PC5_S             20         // PC5 Mask
#define GPIO_PCTL_PC5_U4TX_V        0x00100000 // U4TX on PC5
#define GPIO_PCTL_PC5_U1TX_V        0x00200000 // U1TX on PC5
#define GPIO_PCTL_PC5_M0PWM7_V      0x00400000 // M0PWM7 on PC5
#define GPIO_PCTL_PC5_PHA1_V        0x00600000 // PHA1 on PC5
#define GPIO_PCTL_PC5_WT0CCP1_V     0x00700000 // WT0CCP1 on PC5
#define GPIO_PCTL_PC5_U1CTS_V       0x00800000 // U1CTS on PC5
#define GPIO_PCTL_PC4_M             0x000F0000 // PC4 Mask
#define GPIO_PCTL_PC4_S             16         // PC4 Mask
#define GPIO_PCTL_PC4_U4RX_V        0x00010000 // U4RX on PC4
#define GPIO_PCTL_PC4_U1RX_V        0x00020000 // U1RX on PC4
#define GPIO_PCTL_PC4_M0PWM6_V      0x00040000 // M0PWM6 on PC4
#define GPIO_PCTL_PC4_IDX1_V        0x00060000 // IDX1 on PC4
#define GPIO_PCTL_PC4_WT0CCP0_V     0x00070000 // WT0CCP0 on PC4
#define GPIO_PCTL_PC4_U1RTS_V       0x00080000 // U1RTS on PC4
#define GPIO_PCTL_PC3_M             0x0000F000 // PC3 Mask
#define GPIO_PCTL_PC3_S             12         // PC3 Mask
#define GPIO_PCTL_PC3_TDO_V         0x00001000 // TDO on PC3
#define GPIO_PCTL_PC3_T5CCP1_V      0x00007000 // T5CCP1 on PC3
#define GPIO_PCTL_PC2_M             0x00000F00 // PC2 Mask
#define GPIO_PCTL_PC2_S             8          // PC2 Mask
#define GPIO_PCTL_PC2_TDI_V         0x00000100 // TDI on PC2
#define GPIO_PCTL_PC2_T5CCP0_V      0x00000700 // T5CCP0 on PC2
#define GPIO_PCTL_PC1_M             0x000000F0 // PC1 Mask
#define GPIO_PCTL_PC1_S             4          // PC1 Mask
#define GPIO_PCTL_PC1_TMS_V         0x00000010 // TMS on PC1
#define GPIO_PCTL_PC1_T4CCP1_V      0x00000070 // T4CCP1 on PC1
#define GPIO_PCTL_PC0_M             0x0000000F // PC0 Mask
#define GPIO_PCTL_PC0_S             0          // PC0 Mask
#define GPIO_PCTL_PC0_TCK_V         0x00000001 // TCK on PC0
#define GPIO_PCTL_PC0_T4CCP0_V      0x00000007 // T4CCP0 on PC0
#define GPIO_PCTL_PD7_M             0xF0000000 // PD7 Mask
#define GPIO_PCTL_PD7_S             28         // PD7 Mask
#define GPIO_PCTL_PD7_U2TX_V        0x10000000 // U2TX on PD7
#define GPIO_PCTL_PD7_PHB0_V        0x60000000 // PHB0 on PD7
#define GPIO_PCTL_PD7_WT5CCP1_V     0x70000000 // WT5CCP1 on PD7
#define GPIO_PCTL_PD7_NMI_V         0x80000000 // NMI on PD7
#define GPIO_PCTL_PD6_M             0x0F000000 // PD6 Mask
#define GPIO_PCTL_PD6_S             24         // PD6 Mask
#define GPIO_PCTL_PD6_U2RX_V        0x01000000 // U2RX on PD6
#define GPIO_PCTL_PD6_M0FAULT0_V    0x04000000 // M0FAULT0 on PD6
#define GPIO_PCTL_PD6_PHA0_V        0x06000000 // PHA0 on PD6
#define GPIO_PCTL_PD6_WT5CCP0_V     0x07000000 // WT5CCP0 on PD6
#define GPIO_PCTL_PD5_M             0x00F00000 // PD5 Mask
#define GPIO_PCTL_PD5_S             20         // PD5 Mask
#define GPIO_PCTL_PD5_USB0DP_V      0x00000000 // USB0DP on PD5
#define GPIO_PCTL_PD5_U6TX_V        0x00100000 // U6TX on PD5
#define GPIO_PCTL_PD5_WT4CCP1_V     0x00700000 // WT4CCP1 on PD5
#define GPIO_PCTL_PD4_M             0x000F0000 // PD4 Mask
#define GPIO_PCTL_PD4_S             16         // PD4 Mask
#define GPIO_PCTL_PD4_USB0DM_V      0x00000000 // USB0DM on PD4
#define GPIO_PCTL_PD4_U6RX_V        0x00010000 // U6RX on PD4
#define GPIO_PCTL_PD4_WT4CCP0_V     0x00070000 // WT4CCP0 on PD4
#define GPIO_PCTL_PD3_M             0x0000F000 // PD3 Mask
#define GPIO_PCTL_PD3_S             12         // PD3 Mask
#define GPIO_PCTL_PD3_AIN4_V        0x00000000 // AIN4 on PD3
#define GPIO_PCTL_PD3_SSI3TX_V      0x00001000 // SSI3TX on PD3
#define GPIO_PCTL_PD3_SSI1TX_V      0x00002000 // SSI1TX on PD3
#define GPIO_PCTL_PD3_IDX0_V        0x00006000 // IDX0 on PD3
#define GPIO_PCTL_PD3_WT3CCP1_V     0x00007000 // WT3CCP1 on PD3
#define GPIO_PCTL_PD3_USB0PFLT_V    0x00008000 // USB0PFLT on PD3
#define GPIO_PCTL_PD2_M             0x00000F00 // PD2 Mask
#define GPIO_PCTL_PD2_S             8          // PD2 Mask
#define GPIO_PCTL_PD2_AIN5_V        0x00000000 // AIN5 on PD2
#define GPIO_PCTL_PD2_SSI3RX_V      0x00000100 // SSI3RX on PD2
#define GPIO_PCTL_PD2_SSI1RX_V      0x00000200 // SSI1RX on PD2
#define GPIO_PCTL_PD2_M0FAULT0_V    0x00000400 // M0FAULT0 on PD2
#define GPIO_PCTL_PD2_WT3CCP0_V     0x00000700 // WT3CCP0 on PD2
#define GPIO_PCTL_PD2_USB0EPEN_V    0x00000800 // USB0EPEN on PD2
#define GPIO_PCTL_PD1_M             0x000000F0 // PD1 Mask
#define GPIO_PCTL_PD1_S             4          // PD1 Mask
#define GPIO_PCTL_PD1_AIN6_V        0x00000000 // AIN6 on PD1
#define GPIO_PCTL_PD1_SSI3FSS_V     0x00000010 // SSI3FSS on PD1
#define GPIO_PCTL_PD1_SSI1FSS_V     0x00000020 // SSI1FSS on PD1
#define GPIO_PCTL_PD1_I2C3SDA_V     0x00000030 // I2C3SDA on PD1
#define GPIO_PCTL_PD1_M0PWM7_V      0x00000040 // M0PWM7 on PD1
#define GPIO_PCTL_PD1_M1PWM1_V      0x00000050 // M1PWM1 on PD1
#define GPIO_PCTL_PD1_WT2CCP1_V     0x00000070 // WT2CCP1 on PD1
#define GPIO_PCTL_PD0_M             0x0000000F // PD0 Mask
#define GPIO_PCTL_PD0_S             0          // PD0 Mask
#define GPIO_PCTL_PD0_AIN7_V        0x00000000 // AIN7 on PD0
#define GPIO_PCTL_PD0_SSI3CLK_V     0x00000001 // SSI3CLK on PD0
#define GPIO_PCTL_PD0_SSI1CLK_V     0x00000002 // SSI1CLK on PD0
#define GPIO_PCTL_PD0_I2C3SCL_V     0x00000003 // I2C3SCL on PD0
#define GPIO_PCTL_PD0_M0PWM6_V      0x00000004 // M0PWM6 on PD0
#define GPIO_PCTL_PD0_M1PWM0_V      0x00000005 // M1PWM0 on PD0
#define GPIO_PCTL_PD0_WT2CCP0_V     0x00000007 // WT2CCP0 on PD0
#define GPIO_PCTL_PE5_M             0x00F00000 // PE5 Mask
#define GPIO_PCTL_PE5_S             20         // PE5 Mask
#define GPIO_PCTL_PE5_AIN8_V        0x00000000 // AIN8 on PE5
#define GPIO_PCTL_PE5_U5TX_V        0x00100000 // U5TX on PE5
#define GPIO_PCTL_PE5_I2C2SDA_V     0x00300000 // I2C2SDA on PE5
#define GPIO_PCTL_PE5_M0PWM5_V      0x00400000 // M0PWM5 on PE5
#define GPIO_PCTL_PE5_M1PWM3_V      0x00500000 // M1PWM3 on PE5
#define GPIO_PCTL_PE5_CAN0TX_V      0x00800000 // CAN0TX on PE5
#define GPIO_PCTL_PE4_M             0x000F0000 // PE4 Mask
#define GPIO_PCTL_PE4_S             16         // PE4 Mask
#define GPIO_PCTL_PE4_AIN9_V        0x00000000 // AIN9 on PE4
#define GPIO_PCTL_PE4_U5RX_V        0x00010000 // U5RX on PE4
#define GPIO_PCTL_PE4_I2C2SCL_V     0x00030000 // I2C2SCL on PE4
#define GPIO_PCTL_PE4_M0PWM4_V      0x00040000 // M0PWM4 on PE4
#define GPIO_PCTL_PE4_M1PWM2_V      0x00050000 // M1PWM2 on PE4
#define GPIO_PCTL_PE4_CAN0RX_V      0x00080000 // CAN0RX on PE4
#define GPIO_PCTL_PE3_M             0x0000F000 // PE3 Mask
#define GPIO_PCTL_PE3_S             12         // PE3 Mask
#define GPIO_PCTL_PE3_AIN0_V        0x00000000 // AIN0 on PE3
#define GPIO_PCTL_PE2_M             0x00000F00 // PE2 Mask
#define GPIO_PCTL_PE2_S             8          // PE2 Mask
#define GPIO_PCTL_PE2_AIN1_V        0x00000000 // AIN1 on PE2
#define GPIO_PCTL_PE1_M             0x000000F0 // PE1 Mask
#define GPIO_PCTL_PE1_S             4          // PE1 Mask
#define GPIO_PCTL_PE1_AIN2_V        0x00000000 // AIN2 on PE1
#define GPIO_PCTL_PE1_U7TX_V        0x00000010 // U7TX on PE1
#define GPIO_PCTL_PE0_M             0x0000000F // PE0 Mask
#define GPIO_PCTL_PE0_S             0          // PE0 Mask
#define GPIO_PCTL_PE0_AIN3_V        0x00000000 // AIN3 on PE0
#define GPIO_PCTL_PE0_U7RX_V        0x00000001 // U7RX on PE0
#define GPIO_PCTL_PF4_M             0x000F0000 // PF4 Mask
#define GPIO_PCTL_PF4_S             16         // PF4 Mask
#define GPIO_PCTL_PF4_M1FAULT0_V    0x00050000 // M1FAULT0 on PF4
#define GPIO_PCTL_PF4_IDX0_V        0x00060000 // IDX0 on PF4
#define GPIO_PCTL_PF4_T2CCP0_V      0x00070000 // T2CCP0 on PF4
#define GPIO_PCTL_PF4_USB0EPEN_V    0x00080000 // USB0EPEN on PF4
#define GPIO_PCTL_PF3_M             0x0000F000 // PF3 Mask
#define GPIO_PCTL_PF3_S             12         // PF3 Mask
#define GPIO_PCTL_PF3_SSI1FSS_V     0x00002000 // SSI1FSS on PF3
#define GPIO_PCTL_PF3_CAN0TX_V      0x00003000 // CAN0TX on PF3
#define GPIO_PCTL_PF3_M1PWM7_V      0x00005000 // M1PWM7 on PF3
#define GPIO_PCTL_PF3_T1CCP1_V      0x00007000 // T1CCP1 on PF3
#define GPIO_PCTL_PF3_TRCLK_V       0x0000E000 // TRCLK on PF3
#define GPIO_PCTL_PF2_M             0x00000F00 // PF2 Mask
#define GPIO_PCTL_PF2_S             8          // PF2 Mask
#define GPIO_PCTL_PF2_SSI1CLK_V     0x00000200 // SSI1CLK on PF2
#define GPIO_PCTL_PF2_M0FAULT0_V    0x00000400 // M0FAULT0 on PF2
#define GPIO_PCTL_PF2_M1PWM6_V      0x00000500 // M1PWM6 on PF2
#define GPIO_PCTL_PF2_T1CCP0_V      0x00000700 // T1CCP0 on PF2
#define GPIO_PCTL_PF2_TRD0_V        0x00000E00 // TRD0 on PF2
#define GPIO_PCTL_PF1_M             0x000000F0 // PF1 Mask
#define GPIO_PCTL_PF1_S             4          // PF1 Mask
#define GPIO_PCTL_PF1_U1CTS_V       0x00000010 // U1CTS on PF1
#define GPIO_PCTL_PF1_SSI1TX_V      0x00000020 // SSI1TX on PF1
#define GPIO_PCTL_PF1_M1PWM5_V      0x00000050 // M1PWM5 on PF1
#define GPIO_PCTL_PF1_PHB0_V        0x00000060 // PHB0 on PF1
#define GPIO_PCTL_PF1_T0CCP1_V      0x00000070 // T0CCP1 on PF1
#define GPIO_PCTL_PF1_C1O_V         0x00000090 // C1O on PF1
#define GPIO_PCTL_PF1_TRD1_V        0x000000E0 // TRD1 on PF1
#define GPIO_PCTL_PF0_M             0x0000000F // PF0 Mask
#define GPIO_PCTL_PF0_S             0          // PF0 Mask
#define GPIO_PCTL_PF0_U1RTS_V       0x00000001 // U1RTS on PF0
#define GPIO_PCTL_PF0_SSI1RX_V      0x00000002 // SSI1RX on PF0
#define GPIO_PCTL_PF0_CAN0RX_V      0x00000003 // CAN0RX on PF0
#define GPIO_PCTL_PF0_M1PWM4_V      0x00000005 // M1PWM4 on PF0
#define GPIO_PCTL_PF0_PHA0_V        0x00000006 // PHA0 on PF0
#define GPIO_PCTL_PF0_T0CCP0_V      0x00000007 // T0CCP0 on PF0
#define GPIO_PCTL_PF0_NMI_V         0x00000008 // NMI on PF0
#define GPIO_PCTL_PF0_C0O_V         0x00000009 // C0O on PF0


/******************************************************************************/
/*                                                                            */
/*                      SSI                                                   */
/*                                                                            */
/******************************************************************************/


