hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register CR0 of Module SSI                                   */
#define SSI_CR0_SCR_M               0x0000FF00 // SSI Serial Clock Rate
#define SSI_CR0_SCR_S               8          // SSI Serial Clock Rate
#define SSI_CR0_SPH_B               0x00000080 // SSI Serial Clock Phase
#define SSI_CR0_SPO_B               0x00000040 // SSI Serial Clock Polarity
#define SSI_CR0_FRF_M               0x00000030 // SSI Frame Format Select
#define SSI_CR0_FRF_S               4          // SSI Frame Format Select
#define SSI_CR0_FRF_MOTO_V          0x00000000 // Freescale SPI Frame Format
#define SSI_CR0_FRF_TI_V            0x00000010 // Synchronous Serial Frame Format
#define SSI_CR0_FRF_NMW_V           0x00000020 // MICROWIRE Frame Format
#define SSI_CR0_DSS_M               0x0000000F // SSI Data Size Select
#define SSI_CR0_DSS_S               0          // SSI Data Size Select
#define SSI_CR0_DSS_4_V             0x00000003 // 4-bit data
#define SSI_CR0_DSS_5_V             0x00000004 // 5-bit data
#define SSI_CR0_DSS_6_V             0x00000005 // 6-bit data
#define SSI_CR0_DSS_7_V             0x00000006 // 7-bit data
#define SSI_CR0_DSS_8_V             0x00000007 // 8-bit data
#define SSI_CR0_DSS_9_V             0x00000008 // 9-bit data
#define SSI_CR0_DSS_10_V            0x00000009 // 10-bit data
#define SSI_CR0_DSS_11_V            0x0000000A // 11-bit data
#define SSI_CR0_DSS_12_V            0x0000000B // 12-bit data
#define SSI_CR0_DSS_13_V            0x0000000C // 13-bit data
#define SSI_CR0_DSS_14_V            0x0000000D // 14-bit data
#define SSI_CR0_DSS_15_V            0x0000000E // 15-bit data
#define SSI_CR0_DSS_16_V            0x0000000F // 16-bit data

/* Bit/Fields in Register CR1 of Module SSI                                   */
#define SSI_CR1_EOT_B               0x00000010 // End of Transmission
#define SSI_CR1_MS_B                0x00000004 // SSI Master/Slave Select
#define SSI_CR1_SSE_B               0x00000002 // SSI Synchronous Serial Port
#define SSI_CR1_LBM_B               0x00000001 // SSI Loopback Mode

/* Bit/Fields in Register DR of Module SSI                                    */
#define SSI_DR_DATA_M               0x0000FFFF // SSI Receive/Transmit Data
#define SSI_DR_DATA_S               0          // SSI Receive/Transmit Data

/* Bit/Fields in Register SR of Module SSI                                    */
#define SSI_SR_BSY_B                0x00000010 // SSI Busy Bit
#define SSI_SR_RFF_B                0x00000008 // SSI Receive FIFO Full
#define SSI_SR_RNE_B                0x00000004 // SSI Receive FIFO Not Empty
#define SSI_SR_TNF_B                0x00000002 // SSI Transmit FIFO Not Full
#define SSI_SR_TFE_B                0x00000001 // SSI Transmit FIFO Empty

/* Bit/Fields in Register CPSR of Module SSI                                  */
#define SSI_CPSR_CPSDVSR_M          0x000000FF // SSI Clock Prescale Divisor
#define SSI_CPSR_CPSDVSR_S          0          // SSI Clock Prescale Divisor

/* Bit/Fields in Register IM of Module SSI                                    */
#define SSI_IM_TXIM_B               0x00000008 // SSI Transmit FIFO Interrupt Mask
#define SSI_IM_RXIM_B               0x00000004 // SSI Receive FIFO Interrupt Mask
#define SSI_IM_RTIM_B               0x00000002 // SSI Receive Time-Out Interrupt
#define SSI_IM_RORIM_B              0x00000001 // SSI Receive Overrun Interrupt

/* Bit/Fields in Register RIS of Module SSI                                   */
#define SSI_RIS_TXRIS_B             0x00000008 // SSI Transmit FIFO Raw Interrupt
#define SSI_RIS_RXRIS_B             0x00000004 // SSI Receive FIFO Raw Interrupt
#define SSI_RIS_RTRIS_B             0x00000002 // SSI Receive Time-Out Raw
#define SSI_RIS_RORRIS_B            0x00000001 // SSI Receive Overrun Raw

/* Bit/Fields in Register MIS of Module SSI                                   */
#define SSI_MIS_TXMIS_B             0x00000008 // SSI Transmit FIFO Masked
#define SSI_MIS_RXMIS_B             0x00000004 // SSI Receive FIFO Masked
#define SSI_MIS_RTMIS_B             0x00000002 // SSI Receive Time-Out Masked
#define SSI_MIS_RORMIS_B            0x00000001 // SSI Receive Overrun Masked

/* Bit/Fields in Register ICR of Module SSI                                   */
#define SSI_ICR_RTIC_B              0x00000002 // SSI Receive Time-Out Interrupt
#define SSI_ICR_RORIC_B             0x00000001 // SSI Receive Overrun Interrupt

/* Bit/Fields in Register DMACTL of Module SSI                                */
#define SSI_DMACTL_TXDMAE_B         0x00000002 // Transmit DMA Enable
#define SSI_DMACTL_RXDMAE_B         0x00000001 // Receive DMA Enable

/* Bit/Fields in Register CC of Module SSI                                    */
#define SSI_CC_CS_M                 0x0000000F // SSI Baud Clock Source
#define SSI_CC_CS_S                 0          // SSI Baud Clock Source
#define SSI_CC_CS_SYSPLL_V          0x00000000 // System clock (based on clock
#define SSI_CC_CS_PIOSC_V           0x00000005 // PIOSC


/******************************************************************************/
/*                                                                            */
/*                      UART                                                  */
/*                                                                            */
/******************************************************************************/


/* Bit/Fields in Register DR of Module UART                                   */
#define UART_DR_OE_B                0x00000800 // UART Overrun Error
#define UART_DR_BE_B                0x00000400 // UART Break Error
#define UART_DR_PE_B                0x00000200 // UART Parity Error
#define UART_DR_FE_B                0x00000100 // UART Framing Error
#define UART_DR_DATA_M              0x000000FF // Data Transmitted or Received
#define UART_DR_DATA_S              0          // Data Transmitted or Received

/* Bit/Fields in Register RSR of Module UART                                  */
#define UART_RSR_OE_B               0x00000008 // UART Overrun Error
#define UART_RSR_BE_B               0x00000004 // UART Break Error
#define UART_RSR_PE_B               0x00000002 // UART Parity Error
#define UART_RSR_FE_B               0x00000001 // UART Framing Error

