hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register ECR of Module UART                                  */
#define UART_ECR_DATA_M             0x000000FF // Error Clear
#define UART_ECR_DATA_S             0          // Error Clear

/* Bit/Fields in Register FR of Module UART                                   */
#define UART_FR_TXFE_B              0x00000080 // UART Transmit FIFO Empty
#define UART_FR_RXFF_B              0x00000040 // UART Receive FIFO Full
#define UART_FR_TXFF_B              0x00000020 // UART Transmit FIFO Full
#define UART_FR_RXFE_B              0x00000010 // UART Receive FIFO Empty
#define UART_FR_BUSY_B              0x00000008 // UART Busy
#define UART_FR_CTS_B               0x00000001 // Clear To Send

/* Bit/Fields in Register ILPR of Module UART                                 */
#define UART_ILPR_ILPDVSR_M         0x000000FF // IrDA Low-Power Divisor
#define UART_ILPR_ILPDVSR_S         0          // IrDA Low-Power Divisor

/* Bit/Fields in Register IBRD of Module UART                                 */
#define UART_IBRD_DIVINT_M          0x0000FFFF // Integer Baud-Rate Divisor
#define UART_IBRD_DIVINT_S          0          // Integer Baud-Rate Divisor

/* Bit/Fields in Register FBRD of Module UART                                 */
#define UART_FBRD_DIVFRAC_M         0x0000003F // Fractional Baud-Rate Divisor
#define UART_FBRD_DIVFRAC_S         0          // Fractional Baud-Rate Divisor

/* Bit/Fields in Register LCRH of Module UART                                 */
#define UART_LCRH_SPS_B             0x00000080 // UART Stick Parity Select
#define UART_LCRH_WLEN_M            0x00000060 // UART Word Length
#define UART_LCRH_WLEN_S            5          // UART Word Length
#define UART_LCRH_WLEN_5_V          0x00000000 // 5 bits (default)
#define UART_LCRH_WLEN_6_V          0x00000020 // 6 bits
#define UART_LCRH_WLEN_7_V          0x00000040 // 7 bits
#define UART_LCRH_WLEN_8_V          0x00000060 // 8 bits
#define UART_LCRH_FEN_B             0x00000010 // UART Enable FIFOs
#define UART_LCRH_STP2_B            0x00000008 // UART Two Stop Bits Select
#define UART_LCRH_EPS_B             0x00000004 // UART Even Parity Select
#define UART_LCRH_PEN_B             0x00000002 // UART Parity Enable
#define UART_LCRH_BRK_B             0x00000001 // UART Send Break

/* Bit/Fields in Register CTL of Module UART                                  */
#define UART_CTL_CTSEN_B            0x00008000 // Enable Clear To Send
#define UART_CTL_RTSEN_B            0x00004000 // Enable Request to Send
#define UART_CTL_RTS_B              0x00000800 // Request to Send
#define UART_CTL_RXE_B              0x00000200 // UART Receive Enable
#define UART_CTL_TXE_B              0x00000100 // UART Transmit Enable
#define UART_CTL_LBE_B              0x00000080 // UART Loop Back Enable
#define UART_CTL_HSE_B              0x00000020 // High-Speed Enable
#define UART_CTL_EOT_B              0x00000010 // End of Transmission
#define UART_CTL_SMART_B            0x00000008 // ISO 7816 Smart Card Support
#define UART_CTL_SIRLP_B            0x00000004 // UART SIR Low-Power Mode
#define UART_CTL_SIREN_B            0x00000002 // UART SIR Enable
#define UART_CTL_UARTEN_B           0x00000001 // UART Enable

/* Bit/Fields in Register IFLS of Module UART                                 */
#define UART_IFLS_RX_M              0x00000038 // UART Receive Interrupt FIFO
#define UART_IFLS_RX_S              3          // UART Receive Interrupt FIFO
#define UART_IFLS_RX1_8_V           0x00000000 // RX FIFO >= 1/8 full
#define UART_IFLS_RX2_8_V           0x00000008 // RX FIFO >= 1/4 full
#define UART_IFLS_RX4_8_V           0x00000010 // RX FIFO >= 1/2 full (default)
#define UART_IFLS_RX6_8_V           0x00000018 // RX FIFO >= 3/4 full
#define UART_IFLS_RX7_8_V           0x00000020 // RX FIFO >= 7/8 full
#define UART_IFLS_TX_M              0x00000007 // UART Transmit Interrupt FIFO
#define UART_IFLS_TX_S              0          // UART Transmit Interrupt FIFO
#define UART_IFLS_TX1_8_V           0x00000000 // TX FIFO <= 1/8 full
#define UART_IFLS_TX2_8_V           0x00000001 // TX FIFO <= 1/4 full
#define UART_IFLS_TX4_8_V           0x00000002 // TX FIFO <= 1/2 full (default)
#define UART_IFLS_TX6_8_V           0x00000003 // TX FIFO <= 3/4 full
#define UART_IFLS_TX7_8_V           0x00000004 // TX FIFO <= 7/8 full

/* Bit/Fields in Register IM of Module UART                                   */
#define UART_IM_9BITIM_B            0x00001000 // 9-Bit Mode Interrupt Mask
#define UART_IM_OEIM_B              0x00000400 // UART Overrun Error Interrupt
#define UART_IM_BEIM_B              0x00000200 // UART Break Error Interrupt Mask
#define UART_IM_PEIM_B              0x00000100 // UART Parity Error Interrupt Mask
#define UART_IM_FEIM_B              0x00000080 // UART Framing Error Interrupt
#define UART_IM_RTIM_B              0x00000040 // UART Receive Time-Out Interrupt
#define UART_IM_TXIM_B              0x00000020 // UART Transmit Interrupt Mask
#define UART_IM_RXIM_B              0x00000010 // UART Receive Interrupt Mask
#define UART_IM_CTSMIM_B            0x00000002 // UART Clear to Send Modem

/* Bit/Fields in Register RIS of Module UART                                  */
#define UART_RIS_9BITRIS_B          0x00001000 // 9-Bit Mode Raw Interrupt Status
#define UART_RIS_OERIS_B            0x00000400 // UART Overrun Error Raw Interrupt
#define UART_RIS_BERIS_B            0x00000200 // UART Break Error Raw Interrupt
#define UART_RIS_PERIS_B            0x00000100 // UART Parity Error Raw Interrupt
#define UART_RIS_FERIS_B            0x00000080 // UART Framing Error Raw Interrupt
#define UART_RIS_RTRIS_B            0x00000040 // UART Receive Time-Out Raw
#define UART_RIS_TXRIS_B            0x00000020 // UART Transmit Raw Interrupt
#define UART_RIS_RXRIS_B            0x00000010 // UART Receive Raw Interrupt
#define UART_RIS_CTSRIS_B           0x00000002 // UART Clear to Send Modem Raw

/* Bit/Fields in Register MIS of Module UART                                  */
#define UART_MIS_9BITMIS_B          0x00001000 // 9-Bit Mode Masked Interrupt
#define UART_MIS_OEMIS_B            0x00000400 // UART Overrun Error Masked
#define UART_MIS_BEMIS_B            0x00000200 // UART Break Error Masked
#define UART_MIS_PEMIS_B            0x00000100 // UART Parity Error Masked
#define UART_MIS_FEMIS_B            0x00000080 // UART Framing Error Masked
#define UART_MIS_RTMIS_B            0x00000040 // UART Receive Time-Out Masked
#define UART_MIS_TXMIS_B            0x00000020 // UART Transmit Masked Interrupt
#define UART_MIS_RXMIS_B            0x00000010 // UART Receive Masked Interrupt
#define UART_MIS_CTSMIS_B           0x00000002 // UART Clear to Send Modem Masked

