hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register ICR of Module UART                                  */
#define UART_ICR_9BITIC_B           0x00001000 // 9-Bit Mode Interrupt Clear
#define UART_ICR_OEIC_B             0x00000400 // Overrun Error Interrupt Clear
#define UART_ICR_BEIC_B             0x00000200 // Break Error Interrupt Clear
#define UART_ICR_PEIC_B             0x00000100 // Parity Error Interrupt Clear
#define UART_ICR_FEIC_B             0x00000080 // Framing Error Interrupt Clear
#define UART_ICR_RTIC_B             0x00000040 // Receive Time-Out Interrupt Clear
#define UART_ICR_TXIC_B             0x00000020 // Transmit Interrupt Clear
#define UART_ICR_RXIC_B             0x00000010 // Receive Interrupt Clear
#define UART_ICR_CTSMIC_B           0x00000002 // UART Clear to Send Modem

/* Bit/Fields in Register DMACTL of Module UART                               */
#define UART_DMACTL_DMAERR_B        0x00000004 // DMA on Error
#define UART_DMACTL_TXDMAE_B        0x00000002 // Transmit DMA Enable
#define UART_DMACTL_RXDMAE_B        0x00000001 // Receive DMA Enable

/* Bit/Fields in Register 9BITADDR of Module UART                             */
#define UART_9BITADDR_9BITEN_B      0x00008000 // Enable 9-Bit Mode
#define UART_9BITADDR_ADDR_M        0x000000FF // Self Address for 9-Bit Mode
#define UART_9BITADDR_ADDR_S        0          // Self Address for 9-Bit Mode

/* Bit/Fields in Register 9BITAMASK of Module UART                            */
#define UART_9BITAMASK_MASK_M       0x000000FF // Self Address Mask for 9-Bit Mode
#define UART_9BITAMASK_MASK_S       0          // Self Address Mask for 9-Bit Mode

/* Bit/Fields in Register PP of Module UART                                   */
#define UART_PP_NB_B                0x00000002 // 9-Bit Support
#define UART_PP_SC_B                0x00000001 // Smart Card Support

/* Bit/Fields in Register CC of Module UART                                   */
#define UART_CC_CS_M                0x0000000F // UART Baud Clock Source
#define UART_CC_CS_S                0          // UART Baud Clock Source
#define UART_CC_CS_SYSCLK_V         0x00000000 // System clock (based on clock
#define UART_CC_CS_PIOSC_V          0x00000005 // PIOSC


/******************************************************************************/
/*                                                                            */
/*                      I2C                                                   */
/*                                                                            */
/******************************************************************************/


/* Bit/Fields in Register MSA of Module I2C                                   */
#define I2C_MSA_SA_M                0x000000FE // I2C Slave Address
#define I2C_MSA_SA_S                1          // I2C Slave Address
#define I2C_MSA_RS_B                0x00000001 // Receive not send

/* Bit/Fields in Register MCS of Module I2C                                   */
#define I2C_MCS_CLKTO_B             0x00000080 // Clock Timeout Error
#define I2C_MCS_BUSBSY_B            0x00000040 // Bus Busy
#define I2C_MCS_IDLE_B              0x00000020 // I2C Idle
#define I2C_MCS_ARBLST_B            0x00000010 // Arbitration Lost
#define I2C_MCS_HS_B                0x00000010 // High-Speed Enable
#define I2C_MCS_ACK_B               0x00000008 // Data Acknowledge Enable
#define I2C_MCS_DATACK_B            0x00000008 // Acknowledge Data
#define I2C_MCS_ADRACK_B            0x00000004 // Acknowledge Address
#define I2C_MCS_STOP_B              0x00000004 // Generate STOP
#define I2C_MCS_ERROR_B             0x00000002 // Error
#define I2C_MCS_START_B             0x00000002 // Generate START
#define I2C_MCS_RUN_B               0x00000001 // I2C Master Enable
#define I2C_MCS_BUSY_B              0x00000001 // I2C Busy

/* Bit/Fields in Register MDR of Module I2C                                   */
#define I2C_MDR_DATA_M              0x000000FF // This byte contains the data
#define I2C_MDR_DATA_S              0          // This byte contains the data

/* Bit/Fields in Register MTPR of Module I2C                                  */
#define I2C_MTPR_HS_B               0x00000080 // High-Speed Enable
#define I2C_MTPR_TPR_M              0x0000007F // Timer Period
#define I2C_MTPR_TPR_S              0          // Timer Period

/* Bit/Fields in Register MIMR of Module I2C                                  */
#define I2C_MIMR_CLKIM_B            0x00000002 // Clock Timeout Interrupt Mask
#define I2C_MIMR_IM_B               0x00000001 // Master Interrupt Mask

/* Bit/Fields in Register MRIS of Module I2C                                  */
#define I2C_MRIS_CLKRIS_B           0x00000002 // Clock Timeout Raw Interrupt
#define I2C_MRIS_RIS_B              0x00000001 // Master Raw Interrupt Status

/* Bit/Fields in Register MMIS of Module I2C                                  */
#define I2C_MMIS_CLKMIS_B           0x00000002 // Clock Timeout Masked Interrupt
#define I2C_MMIS_MIS_B              0x00000001 // Masked Interrupt Status

/* Bit/Fields in Register MICR of Module I2C                                  */
#define I2C_MICR_CLKIC_B            0x00000002 // Clock Timeout Interrupt Clear
#define I2C_MICR_IC_B               0x00000001 // Master Interrupt Clear

/* Bit/Fields in Register MCR of Module I2C                                   */
#define I2C_MCR_GFE_B               0x00000040 // I2C Glitch Filter Enable
#define I2C_MCR_SFE_B               0x00000020 // I2C Slave Function Enable
#define I2C_MCR_MFE_B               0x00000010 // I2C Master Function Enable
#define I2C_MCR_LPBK_B              0x00000001 // I2C Loopback

/* Bit/Fields in Register MCLKOCNT of Module I2C                              */
#define I2C_MCLKOCNT_CNTL_M         0x000000FF // I2C Master Count
#define I2C_MCLKOCNT_CNTL_S         0          // I2C Master Count

/* Bit/Fields in Register MBMON of Module I2C                                 */
#define I2C_MBMON_SDA_B             0x00000002 // I2C SDA Status
#define I2C_MBMON_SCL_B             0x00000001 // I2C SCL Status

/* Bit/Fields in Register MCR2 of Module I2C                                  */
#define I2C_MCR2_GFPW_M             0x00000070 // I2C Glitch Filter Pulse Width
#define I2C_MCR2_GFPW_S             4          // I2C Glitch Filter Pulse Width
#define I2C_MCR2_GFPW_BYPASS_V      0x00000000 // Bypass
#define I2C_MCR2_GFPW_1_V           0x00000010 // 1 clock
#define I2C_MCR2_GFPW_2_V           0x00000020 // 2 clocks
#define I2C_MCR2_GFPW_3_V           0x00000030 // 3 clocks
#define I2C_MCR2_GFPW_4_V           0x00000040 // 4 clocks
#define I2C_MCR2_GFPW_8_V           0x00000050 // 8 clocks
#define I2C_MCR2_GFPW_16_V          0x00000060 // 16 clocks
#define I2C_MCR2_GFPW_31_V          0x00000070 // 31 clocks

/* Bit/Fields in Register SOAR of Module I2C                                  */
#define I2C_SOAR_OAR_M              0x0000007F // I2C Slave Own Address
#define I2C_SOAR_OAR_S              0          // I2C Slave Own Address

/* Bit/Fields in Register SCSR of Module I2C                                  */
#define I2C_SCSR_OAR2SEL_B          0x00000008 // OAR2 Address Matched
#define I2C_SCSR_FBR_B              0x00000004 // First Byte Received
#define I2C_SCSR_TREQ_B             0x00000002 // Transmit Request
#define I2C_SCSR_DA_B               0x00000001 // Device Active
#define I2C_SCSR_RREQ_B             0x00000001 // Receive Request

/* Bit/Fields in Register SDR of Module I2C                                   */
#define I2C_SDR_DATA_M              0x000000FF // Data for Transfer
#define I2C_SDR_DATA_S              0          // Data for Transfer

/* Bit/Fields in Register SIMR of Module I2C                                  */
#define I2C_SIMR_STOPIM_B           0x00000004 // Stop Condition Interrupt Mask
#define I2C_SIMR_STARTIM_B          0x00000002 // Start Condition Interrupt Mask
#define I2C_SIMR_DATAIM_B           0x00000001 // Data Interrupt Mask

/* Bit/Fields in Register SRIS of Module I2C                                  */
#define I2C_SRIS_STOPRIS_B          0x00000004 // Stop Condition Raw Interrupt
#define I2C_SRIS_STARTRIS_B         0x00000002 // Start Condition Raw Interrupt
#define I2C_SRIS_DATARIS_B          0x00000001 // Data Raw Interrupt Status

/* Bit/Fields in Register SMIS of Module I2C                                  */
#define I2C_SMIS_STOPMIS_B          0x00000004 // Stop Condition Masked Interrupt
#define I2C_SMIS_STARTMIS_B         0x00000002 // Start Condition Masked Interrupt
#define I2C_SMIS_DATAMIS_B          0x00000001 // Data Masked Interrupt Status

