hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register SICR of Module I2C                                  */
#define I2C_SICR_STOPIC_B           0x00000004 // Stop Condition Interrupt Clear
#define I2C_SICR_STARTIC_B          0x00000002 // Start Condition Interrupt Clear
#define I2C_SICR_DATAIC_B           0x00000001 // Data Interrupt Clear

/* Bit/Fields in Register SOAR2 of Module I2C                                 */
#define I2C_SOAR2_OAR2EN_B          0x00000080 // I2C Slave Own Address 2 Enable
#define I2C_SOAR2_OAR2_M            0x0000007F // I2C Slave Own Address 2
#define I2C_SOAR2_OAR2_S            0          // I2C Slave Own Address 2

/* Bit/Fields in Register SACKCTL of Module I2C                               */
#define I2C_SACKCTL_ACKOVAL_B       0x00000002 // I2C Slave ACK Override Value
#define I2C_SACKCTL_ACKOEN_B        0x00000001 // I2C Slave ACK Override Enable

/* Bit/Fields in Register PP of Module I2C                                    */
#define I2C_PP_HS_B                 0x00000001 // High-Speed Capable

/* Bit/Fields in Register PC of Module I2C                                    */
#define I2C_PC_HS_B                 0x00000001 // High-Speed Capable


/******************************************************************************/
/*                                                                            */
/*                      PWM                                                   */
/*                                                                            */
/******************************************************************************/


/* Bit/Fields in Register CTL of Module PWM                                   */
#define PWM_CTL_GLOBALSYNC3_B       0x00000008 // Update PWM Generator 3
#define PWM_CTL_GLOBALSYNC2_B       0x00000004 // Update PWM Generator 2
#define PWM_CTL_GLOBALSYNC1_B       0x00000002 // Update PWM Generator 1
#define PWM_CTL_GLOBALSYNC0_B       0x00000001 // Update PWM Generator 0

/* Bit/Fields in Register SYNC of Module PWM                                  */
#define PWM_SYNC_SYNC3_B            0x00000008 // Reset Generator 3 Counter
#define PWM_SYNC_SYNC2_B            0x00000004 // Reset Generator 2 Counter
#define PWM_SYNC_SYNC1_B            0x00000002 // Reset Generator 1 Counter
#define PWM_SYNC_SYNC0_B            0x00000001 // Reset Generator 0 Counter

/* Bit/Fields in Register ENABLE of Module PWM                                */
#define PWM_ENABLE_PWM7EN_B         0x00000080 // MnPWM7 Output Enable
#define PWM_ENABLE_PWM6EN_B         0x00000040 // MnPWM6 Output Enable
#define PWM_ENABLE_PWM5EN_B         0x00000020 // MnPWM5 Output Enable
#define PWM_ENABLE_PWM4EN_B         0x00000010 // MnPWM4 Output Enable
#define PWM_ENABLE_PWM3EN_B         0x00000008 // MnPWM3 Output Enable
#define PWM_ENABLE_PWM2EN_B         0x00000004 // MnPWM2 Output Enable
#define PWM_ENABLE_PWM1EN_B         0x00000002 // MnPWM1 Output Enable
#define PWM_ENABLE_PWM0EN_B         0x00000001 // MnPWM0 Output Enable

/* Bit/Fields in Register INVERT of Module PWM                                */
#define PWM_INVERT_PWM7INV_B        0x00000080 // Invert MnPWM7 Signal
#define PWM_INVERT_PWM6INV_B        0x00000040 // Invert MnPWM6 Signal
#define PWM_INVERT_PWM5INV_B        0x00000020 // Invert MnPWM5 Signal
#define PWM_INVERT_PWM4INV_B        0x00000010 // Invert MnPWM4 Signal
#define PWM_INVERT_PWM3INV_B        0x00000008 // Invert MnPWM3 Signal
#define PWM_INVERT_PWM2INV_B        0x00000004 // Invert MnPWM2 Signal
#define PWM_INVERT_PWM1INV_B        0x00000002 // Invert MnPWM1 Signal
#define PWM_INVERT_PWM0INV_B        0x00000001 // Invert MnPWM0 Signal

/* Bit/Fields in Register FAULT of Module PWM                                 */
#define PWM_FAULT_FAULT7_B          0x00000080 // MnPWM7 Fault
#define PWM_FAULT_FAULT6_B          0x00000040 // MnPWM6 Fault
#define PWM_FAULT_FAULT5_B          0x00000020 // MnPWM5 Fault
#define PWM_FAULT_FAULT4_B          0x00000010 // MnPWM4 Fault
#define PWM_FAULT_FAULT3_B          0x00000008 // MnPWM3 Fault
#define PWM_FAULT_FAULT2_B          0x00000004 // MnPWM2 Fault
#define PWM_FAULT_FAULT1_B          0x00000002 // MnPWM1 Fault
#define PWM_FAULT_FAULT0_B          0x00000001 // MnPWM0 Fault

/* Bit/Fields in Register INTEN of Module PWM                                 */
#define PWM_INTEN_INTFAULT1_B       0x00020000 // Interrupt Fault 1
#define PWM_INTEN_INTFAULT0_B       0x00010000 // Interrupt Fault 0
#define PWM_INTEN_INTPWM3_B         0x00000008 // PWM3 Interrupt Enable
#define PWM_INTEN_INTPWM2_B         0x00000004 // PWM2 Interrupt Enable
#define PWM_INTEN_INTPWM1_B         0x00000002 // PWM1 Interrupt Enable
#define PWM_INTEN_INTPWM0_B         0x00000001 // PWM0 Interrupt Enable

/* Bit/Fields in Register RIS of Module PWM                                   */
#define PWM_RIS_INTFAULT1_B         0x00020000 // Interrupt Fault PWM 1
#define PWM_RIS_INTFAULT0_B         0x00010000 // Interrupt Fault PWM 0
#define PWM_RIS_INTPWM3_B           0x00000008 // PWM3 Interrupt Asserted
#define PWM_RIS_INTPWM2_B           0x00000004 // PWM2 Interrupt Asserted
#define PWM_RIS_INTPWM1_B           0x00000002 // PWM1 Interrupt Asserted
#define PWM_RIS_INTPWM0_B           0x00000001 // PWM0 Interrupt Asserted

/* Bit/Fields in Register ISC of Module PWM                                   */
#define PWM_ISC_INTFAULT1_B         0x00020000 // FAULT1 Interrupt Asserted
#define PWM_ISC_INTFAULT0_B         0x00010000 // FAULT0 Interrupt Asserted
#define PWM_ISC_INTPWM3_B           0x00000008 // PWM3 Interrupt Status
#define PWM_ISC_INTPWM2_B           0x00000004 // PWM2 Interrupt Status
#define PWM_ISC_INTPWM1_B           0x00000002 // PWM1 Interrupt Status
#define PWM_ISC_INTPWM0_B           0x00000001 // PWM0 Interrupt Status

/* Bit/Fields in Register STATUS of Module PWM                                */
#define PWM_STATUS_FAULT1_B         0x00000002 // Generator 1 Fault Status
#define PWM_STATUS_FAULT0_B         0x00000001 // Generator 0 Fault Status

