hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register FAULTVAL of Module PWM                              */
#define PWM_FAULTVAL_PWM7_B         0x00000080 // MnPWM7 Fault Value
#define PWM_FAULTVAL_PWM6_B         0x00000040 // MnPWM6 Fault Value
#define PWM_FAULTVAL_PWM5_B         0x00000020 // MnPWM5 Fault Value
#define PWM_FAULTVAL_PWM4_B         0x00000010 // MnPWM4 Fault Value
#define PWM_FAULTVAL_PWM3_B         0x00000008 // MnPWM3 Fault Value
#define PWM_FAULTVAL_PWM2_B         0x00000004 // MnPWM2 Fault Value
#define PWM_FAULTVAL_PWM1_B         0x00000002 // MnPWM1 Fault Value
#define PWM_FAULTVAL_PWM0_B         0x00000001 // MnPWM0 Fault Value

/* Bit/Fields in Register ENUPD of Module PWM                                 */
#define PWM_ENUPD_ENUPD7_M          0x0000C000 // MnPWM7 Enable Update Mode
#define PWM_ENUPD_ENUPD7_S          14         // MnPWM7 Enable Update Mode
#define PWM_ENUPD_ENUPD7_IMM_V      0x00000000 // Immediate
#define PWM_ENUPD_ENUPD7_LSYNC_V    0x00008000 // Locally Synchronized
#define PWM_ENUPD_ENUPD7_GSYNC_V    0x0000C000 // Globally Synchronized
#define PWM_ENUPD_ENUPD6_M          0x00003000 // MnPWM6 Enable Update Mode
#define PWM_ENUPD_ENUPD6_S          12         // MnPWM6 Enable Update Mode
#define PWM_ENUPD_ENUPD6_IMM_V      0x00000000 // Immediate
#define PWM_ENUPD_ENUPD6_LSYNC_V    0x00002000 // Locally Synchronized
#define PWM_ENUPD_ENUPD6_GSYNC_V    0x00003000 // Globally Synchronized
#define PWM_ENUPD_ENUPD5_M          0x00000C00 // MnPWM5 Enable Update Mode
#define PWM_ENUPD_ENUPD5_S          10         // MnPWM5 Enable Update Mode
#define PWM_ENUPD_ENUPD5_IMM_V      0x00000000 // Immediate
#define PWM_ENUPD_ENUPD5_LSYNC_V    0x00000800 // Locally Synchronized
#define PWM_ENUPD_ENUPD5_GSYNC_V    0x00000C00 // Globally Synchronized
#define PWM_ENUPD_ENUPD4_M          0x00000300 // MnPWM4 Enable Update Mode
#define PWM_ENUPD_ENUPD4_S          8          // MnPWM4 Enable Update Mode
#define PWM_ENUPD_ENUPD4_IMM_V      0x00000000 // Immediate
#define PWM_ENUPD_ENUPD4_LSYNC_V    0x00000200 // Locally Synchronized
#define PWM_ENUPD_ENUPD4_GSYNC_V    0x00000300 // Globally Synchronized
#define PWM_ENUPD_ENUPD3_M          0x000000C0 // MnPWM3 Enable Update Mode
#define PWM_ENUPD_ENUPD3_S          6          // MnPWM3 Enable Update Mode
#define PWM_ENUPD_ENUPD3_IMM_V      0x00000000 // Immediate
#define PWM_ENUPD_ENUPD3_LSYNC_V    0x00000080 // Locally Synchronized
#define PWM_ENUPD_ENUPD3_GSYNC_V    0x000000C0 // Globally Synchronized
#define PWM_ENUPD_ENUPD2_M          0x00000030 // MnPWM2 Enable Update Mode
#define PWM_ENUPD_ENUPD2_S          4          // MnPWM2 Enable Update Mode
#define PWM_ENUPD_ENUPD2_IMM_V      0x00000000 // Immediate
#define PWM_ENUPD_ENUPD2_LSYNC_V    0x00000020 // Locally Synchronized
#define PWM_ENUPD_ENUPD2_GSYNC_V    0x00000030 // Globally Synchronized
#define PWM_ENUPD_ENUPD1_M          0x0000000C // MnPWM1 Enable Update Mode
#define PWM_ENUPD_ENUPD1_S          2          // MnPWM1 Enable Update Mode
#define PWM_ENUPD_ENUPD1_IMM_V      0x00000000 // Immediate
#define PWM_ENUPD_ENUPD1_LSYNC_V    0x00000008 // Locally Synchronized
#define PWM_ENUPD_ENUPD1_GSYNC_V    0x0000000C // Globally Synchronized
#define PWM_ENUPD_ENUPD0_M          0x00000003 // MnPWM0 Enable Update Mode
#define PWM_ENUPD_ENUPD0_S          0          // MnPWM0 Enable Update Mode
#define PWM_ENUPD_ENUPD0_IMM_V      0x00000000 // Immediate
#define PWM_ENUPD_ENUPD0_LSYNC_V    0x00000002 // Locally Synchronized
#define PWM_ENUPD_ENUPD0_GSYNC_V    0x00000003 // Globally Synchronized

/* Bit/Fields in Register 0 of Module PWM                                     */
#define PWM_0_CTL_LATCH_B           0x00040000 // Latch Fault Input
#define PWM_0_CTL_MINFLTPER_B       0x00020000 // Minimum Fault Period
#define PWM_0_CTL_FLTSRC_B          0x00010000 // Fault Condition Source
#define PWM_0_CTL_DBFALLUPD_M       0x0000C000 // PWMnDBFALL Update Mode
#define PWM_0_CTL_DBFALLUPD_S       14         // PWMnDBFALL Update Mode
#define PWM_0_CTL_DBFALLUPD_I_V     0x00000000 // Immediate
#define PWM_0_CTL_DBFALLUPD_LS_V    0x00008000 // Locally Synchronized
#define PWM_0_CTL_DBFALLUPD_GS_V    0x0000C000 // Globally Synchronized
#define PWM_0_CTL_DBRISEUPD_M       0x00003000 // PWMnDBRISE Update Mode
#define PWM_0_CTL_DBRISEUPD_S       12         // PWMnDBRISE Update Mode
#define PWM_0_CTL_DBRISEUPD_I_V     0x00000000 // Immediate
#define PWM_0_CTL_DBRISEUPD_LS_V    0x00002000 // Locally Synchronized
#define PWM_0_CTL_DBRISEUPD_GS_V    0x00003000 // Globally Synchronized
#define PWM_0_CTL_DBCTLUPD_M        0x00000C00 // PWMnDBCTL Update Mode
#define PWM_0_CTL_DBCTLUPD_S        10         // PWMnDBCTL Update Mode
#define PWM_0_CTL_DBCTLUPD_I_V      0x00000000 // Immediate
#define PWM_0_CTL_DBCTLUPD_LS_V     0x00000800 // Locally Synchronized
#define PWM_0_CTL_DBCTLUPD_GS_V     0x00000C00 // Globally Synchronized
#define PWM_0_CTL_GENBUPD_M         0x00000300 // PWMnGENB Update Mode
#define PWM_0_CTL_GENBUPD_S         8          // PWMnGENB Update Mode
#define PWM_0_CTL_GENBUPD_I_V       0x00000000 // Immediate
#define PWM_0_CTL_GENBUPD_LS_V      0x00000200 // Locally Synchronized
#define PWM_0_CTL_GENBUPD_GS_V      0x00000300 // Globally Synchronized
#define PWM_0_CTL_GENAUPD_M         0x000000C0 // PWMnGENA Update Mode
#define PWM_0_CTL_GENAUPD_S         6          // PWMnGENA Update Mode
#define PWM_0_CTL_GENAUPD_I_V       0x00000000 // Immediate
#define PWM_0_CTL_GENAUPD_LS_V      0x00000080 // Locally Synchronized
#define PWM_0_CTL_GENAUPD_GS_V      0x000000C0 // Globally Synchronized
#define PWM_0_CTL_CMPBUPD_B         0x00000020 // Comparator B Update Mode
#define PWM_0_CTL_CMPAUPD_B         0x00000010 // Comparator A Update Mode
#define PWM_0_CTL_LOADUPD_B         0x00000008 // Load Register Update Mode
#define PWM_0_CTL_DEBUG_B           0x00000004 // Debug Mode
#define PWM_0_CTL_MODE_B            0x00000002 // Counter Mode
#define PWM_0_CTL_ENABLE_B          0x00000001 // PWM Block Enable
#define PWM_0_INTEN_TRCMPBD_B       0x00002000 // Trigger for Counter=PWMnCMPB
#define PWM_0_INTEN_TRCMPBU_B       0x00001000 // Trigger for Counter=PWMnCMPB Up
#define PWM_0_INTEN_TRCMPAD_B       0x00000800 // Trigger for Counter=PWMnCMPA
#define PWM_0_INTEN_TRCMPAU_B       0x00000400 // Trigger for Counter=PWMnCMPA Up
#define PWM_0_INTEN_TRCNTLOAD_B     0x00000200 // Trigger for Counter=PWMnLOAD
#define PWM_0_INTEN_TRCNTZERO_B     0x00000100 // Trigger for Counter=0
#define PWM_0_INTEN_INTCMPBD_B      0x00000020 // Interrupt for Counter=PWMnCMPB
#define PWM_0_INTEN_INTCMPBU_B      0x00000010 // Interrupt for Counter=PWMnCMPB
#define PWM_0_INTEN_INTCMPAD_B      0x00000008 // Interrupt for Counter=PWMnCMPA
#define PWM_0_INTEN_INTCMPAU_B      0x00000004 // Interrupt for Counter=PWMnCMPA
#define PWM_0_INTEN_INTCNTLOAD_B    0x00000002 // Interrupt for Counter=PWMnLOAD
#define PWM_0_INTEN_INTCNTZERO_B    0x00000001 // Interrupt for Counter=0
#define PWM_0_RIS_INTCMPBD_B        0x00000020 // Comparator B Down Interrupt
#define PWM_0_RIS_INTCMPBU_B        0x00000010 // Comparator B Up Interrupt Status
#define PWM_0_RIS_INTCMPAD_B        0x00000008 // Comparator A Down Interrupt
#define PWM_0_RIS_INTCMPAU_B        0x00000004 // Comparator A Up Interrupt Status
#define PWM_0_RIS_INTCNTLOAD_B      0x00000002 // Counter=Load Interrupt Status
#define PWM_0_RIS_INTCNTZERO_B      0x00000001 // Counter=0 Interrupt Status
#define PWM_0_ISC_INTCMPBD_B        0x00000020 // Comparator B Down Interrupt
#define PWM_0_ISC_INTCMPBU_B        0x00000010 // Comparator B Up Interrupt
#define PWM_0_ISC_INTCMPAD_B        0x00000008 // Comparator A Down Interrupt
#define PWM_0_ISC_INTCMPAU_B        0x00000004 // Comparator A Up Interrupt
#define PWM_0_ISC_INTCNTLOAD_B      0x00000002 // Counter=Load Interrupt
#define PWM_0_ISC_INTCNTZERO_B      0x00000001 // Counter=0 Interrupt
#define PWM_0_LOAD_M                0x0000FFFF // Counter Load Value
#define PWM_0_LOAD_S                0          // Counter Load Value
#define PWM_0_COUNT_M               0x0000FFFF // Counter Value
#define PWM_0_COUNT_S               0          // Counter Value
#define PWM_0_CMPA_M                0x0000FFFF // Comparator A Value
#define PWM_0_CMPA_S                0          // Comparator A Value
#define PWM_0_CMPB_M                0x0000FFFF // Comparator B Value
#define PWM_0_CMPB_S                0          // Comparator B Value
#define PWM_0_GENA_ACTCMPBD_M       0x00000C00 // Action for Comparator B Down
#define PWM_0_GENA_ACTCMPBD_S       10         // Action for Comparator B Down
#define PWM_0_GENA_ACTCMPBD_INV_V   0x00000400 // Invert pwmA
#define PWM_0_GENA_ACTCMPBD_ONE_V   0x00000C00 // Drive pwmA High
#define PWM_0_GENA_ACTCMPBU_M       0x00000300 // Action for Comparator B Up
#define PWM_0_GENA_ACTCMPBU_S       8          // Action for Comparator B Up
#define PWM_0_GENA_ACTCMPBU_INV_V   0x00000100 // Invert pwmA
#define PWM_0_GENA_ACTCMPBU_ONE_V   0x00000300 // Drive pwmA High
#define PWM_0_GENA_ACTCMPAD_M       0x000000C0 // Action for Comparator A Down
#define PWM_0_GENA_ACTCMPAD_S       6          // Action for Comparator A Down
#define PWM_0_GENA_ACTCMPAD_INV_V   0x00000040 // Invert pwmA
#define PWM_0_GENA_ACTCMPAD_ONE_V   0x000000C0 // Drive pwmA High
#define PWM_0_GENA_ACTCMPAU_M       0x00000030 // Action for Comparator A Up
#define PWM_0_GENA_ACTCMPAU_S       4          // Action for Comparator A Up
#define PWM_0_GENA_ACTCMPAU_INV_V   0x00000010 // Invert pwmA
#define PWM_0_GENA_ACTCMPAU_ONE_V   0x00000030 // Drive pwmA High
#define PWM_0_GENA_ACTLOAD_M        0x0000000C // Action for Counter=LOAD
#define PWM_0_GENA_ACTLOAD_S        2          // Action for Counter=LOAD
#define PWM_0_GENA_ACTLOAD_NONE_V   0x00000000 // Do nothing
#define PWM_0_GENA_ACTLOAD_INV_V    0x00000004 // Invert pwmA
#define PWM_0_GENA_ACTLOAD_ZERO_V   0x00000008 // Drive pwmA Low
#define PWM_0_GENA_ACTLOAD_ONE_V    0x0000000C // Drive pwmA High
#define PWM_0_GENA_ACTZERO_M        0x00000003 // Action for Counter=0
#define PWM_0_GENA_ACTZERO_S        0          // Action for Counter=0
#define PWM_0_GENA_ACTZERO_NONE_V   0x00000000 // Do nothing
#define PWM_0_GENA_ACTZERO_INV_V    0x00000001 // Invert pwmA
#define PWM_0_GENA_ACTZERO_ZERO_V   0x00000002 // Drive pwmA Low
#define PWM_0_GENA_ACTZERO_ONE_V    0x00000003 // Drive pwmA High
#define PWM_0_GENB_ACTCMPBD_M       0x00000C00 // Action for Comparator B Down
#define PWM_0_GENB_ACTCMPBD_S       10         // Action for Comparator B Down
#define PWM_0_GENB_ACTCMPBD_INV_V   0x00000400 // Invert pwmB
#define PWM_0_GENB_ACTCMPBD_ONE_V   0x00000C00 // Drive pwmB High
#define PWM_0_GENB_ACTCMPBU_M       0x00000300 // Action for Comparator B Up
#define PWM_0_GENB_ACTCMPBU_S       8          // Action for Comparator B Up
#define PWM_0_GENB_ACTCMPBU_INV_V   0x00000100 // Invert pwmB
#define PWM_0_GENB_ACTCMPBU_ONE_V   0x00000300 // Drive pwmB High
#define PWM_0_GENB_ACTCMPAD_M       0x000000C0 // Action for Comparator A Down
#define PWM_0_GENB_ACTCMPAD_S       6          // Action for Comparator A Down
#define PWM_0_GENB_ACTCMPAD_INV_V   0x00000040 // Invert pwmB
#define PWM_0_GENB_ACTCMPAD_ONE_V   0x000000C0 // Drive pwmB High
#define PWM_0_GENB_ACTCMPAU_M       0x00000030 // Action for Comparator A Up
#define PWM_0_GENB_ACTCMPAU_S       4          // Action for Comparator A Up
#define PWM_0_GENB_ACTCMPAU_INV_V   0x00000010 // Invert pwmB
#define PWM_0_GENB_ACTCMPAU_ONE_V   0x00000030 // Drive pwmB High
#define PWM_0_GENB_ACTLOAD_M        0x0000000C // Action for Counter=LOAD
#define PWM_0_GENB_ACTLOAD_S        2          // Action for Counter=LOAD
#define PWM_0_GENB_ACTLOAD_NONE_V   0x00000000 // Do nothing
#define PWM_0_GENB_ACTLOAD_INV_V    0x00000004 // Invert pwmB
#define PWM_0_GENB_ACTLOAD_ZERO_V   0x00000008 // Drive pwmB Low
#define PWM_0_GENB_ACTLOAD_ONE_V    0x0000000C // Drive pwmB High
#define PWM_0_GENB_ACTZERO_M        0x00000003 // Action for Counter=0
#define PWM_0_GENB_ACTZERO_S        0          // Action for Counter=0
#define PWM_0_GENB_ACTZERO_NONE_V   0x00000000 // Do nothing
#define PWM_0_GENB_ACTZERO_INV_V    0x00000001 // Invert pwmB
#define PWM_0_GENB_ACTZERO_ZERO_V   0x00000002 // Drive pwmB Low
#define PWM_0_GENB_ACTZERO_ONE_V    0x00000003 // Drive pwmB High
#define PWM_0_DBCTL_ENABLE_V        0x00000001 // Dead-Band Generator Enable
#define PWM_0_DBRISE_DELAY_M        0x00000FFF // Dead-Band Rise Delay
#define PWM_0_DBRISE_DELAY_S        0          // Dead-Band Rise Delay
#define PWM_0_DBFALL_DELAY_M        0x00000FFF // Dead-Band Fall Delay
#define PWM_0_DBFALL_DELAY_S        0          // Dead-Band Fall Delay
#define PWM_0_FLTSRC0_FAULT1_V      0x00000002 // Fault1 Input
#define PWM_0_FLTSRC0_FAULT0_V      0x00000001 // Fault0 Input
#define PWM_0_FLTSRC1_DCMP7_V       0x00000080 // Digital Comparator 7
#define PWM_0_FLTSRC1_DCMP6_V       0x00000040 // Digital Comparator 6
#define PWM_0_FLTSRC1_DCMP5_V       0x00000020 // Digital Comparator 5
#define PWM_0_FLTSRC1_DCMP4_V       0x00000010 // Digital Comparator 4
#define PWM_0_FLTSRC1_DCMP3_V       0x00000008 // Digital Comparator 3
#define PWM_0_FLTSRC1_DCMP2_V       0x00000004 // Digital Comparator 2
#define PWM_0_FLTSRC1_DCMP1_V       0x00000002 // Digital Comparator 1
#define PWM_0_FLTSRC1_DCMP0_V       0x00000001 // Digital Comparator 0
#define PWM_0_MINFLTPER_M           0x0000FFFF // Minimum Fault Period
#define PWM_0_MINFLTPER_S           0          // Minimum Fault Period

