hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register 3 of Module PWM                                     */
#define PWM_3_CTL_LATCH_B           0x00040000 // Latch Fault Input
#define PWM_3_CTL_MINFLTPER_B       0x00020000 // Minimum Fault Period
#define PWM_3_CTL_FLTSRC_B          0x00010000 // Fault Condition Source
#define PWM_3_CTL_DBFALLUPD_M       0x0000C000 // PWMnDBFALL Update Mode
#define PWM_3_CTL_DBFALLUPD_S       14         // PWMnDBFALL Update Mode
#define PWM_3_CTL_DBFALLUPD_I_V     0x00000000 // Immediate
#define PWM_3_CTL_DBFALLUPD_LS_V    0x00008000 // Locally Synchronized
#define PWM_3_CTL_DBFALLUPD_GS_V    0x0000C000 // Globally Synchronized
#define PWM_3_CTL_DBRISEUPD_M       0x00003000 // PWMnDBRISE Update Mode
#define PWM_3_CTL_DBRISEUPD_S       12         // PWMnDBRISE Update Mode
#define PWM_3_CTL_DBRISEUPD_I_V     0x00000000 // Immediate
#define PWM_3_CTL_DBRISEUPD_LS_V    0x00002000 // Locally Synchronized
#define PWM_3_CTL_DBRISEUPD_GS_V    0x00003000 // Globally Synchronized
#define PWM_3_CTL_DBCTLUPD_M        0x00000C00 // PWMnDBCTL Update Mode
#define PWM_3_CTL_DBCTLUPD_S        10         // PWMnDBCTL Update Mode
#define PWM_3_CTL_DBCTLUPD_I_V      0x00000000 // Immediate
#define PWM_3_CTL_DBCTLUPD_LS_V     0x00000800 // Locally Synchronized
#define PWM_3_CTL_DBCTLUPD_GS_V     0x00000C00 // Globally Synchronized
#define PWM_3_CTL_GENBUPD_M         0x00000300 // PWMnGENB Update Mode
#define PWM_3_CTL_GENBUPD_S         8          // PWMnGENB Update Mode
#define PWM_3_CTL_GENBUPD_I_V       0x00000000 // Immediate
#define PWM_3_CTL_GENBUPD_LS_V      0x00000200 // Locally Synchronized
#define PWM_3_CTL_GENBUPD_GS_V      0x00000300 // Globally Synchronized
#define PWM_3_CTL_GENAUPD_M         0x000000C0 // PWMnGENA Update Mode
#define PWM_3_CTL_GENAUPD_S         6          // PWMnGENA Update Mode
#define PWM_3_CTL_GENAUPD_I_V       0x00000000 // Immediate
#define PWM_3_CTL_GENAUPD_LS_V      0x00000080 // Locally Synchronized
#define PWM_3_CTL_GENAUPD_GS_V      0x000000C0 // Globally Synchronized
#define PWM_3_CTL_CMPBUPD_B         0x00000020 // Comparator B Update Mode
#define PWM_3_CTL_CMPAUPD_B         0x00000010 // Comparator A Update Mode
#define PWM_3_CTL_LOADUPD_B         0x00000008 // Load Register Update Mode
#define PWM_3_CTL_DEBUG_B           0x00000004 // Debug Mode
#define PWM_3_CTL_MODE_B            0x00000002 // Counter Mode
#define PWM_3_CTL_ENABLE_B          0x00000001 // PWM Block Enable
#define PWM_3_INTEN_TRCMPBD_B       0x00002000 // Trigger for Counter=PWMnCMPB
#define PWM_3_INTEN_TRCMPBU_B       0x00001000 // Trigger for Counter=PWMnCMPB Up
#define PWM_3_INTEN_TRCMPAD_B       0x00000800 // Trigger for Counter=PWMnCMPA
#define PWM_3_INTEN_TRCMPAU_B       0x00000400 // Trigger for Counter=PWMnCMPA Up
#define PWM_3_INTEN_TRCNTLOAD_B     0x00000200 // Trigger for Counter=PWMnLOAD
#define PWM_3_INTEN_TRCNTZERO_B     0x00000100 // Trigger for Counter=0
#define PWM_3_INTEN_INTCMPBD_B      0x00000020 // Interrupt for Counter=PWMnCMPB
#define PWM_3_INTEN_INTCMPBU_B      0x00000010 // Interrupt for Counter=PWMnCMPB
#define PWM_3_INTEN_INTCMPAD_B      0x00000008 // Interrupt for Counter=PWMnCMPA
#define PWM_3_INTEN_INTCMPAU_B      0x00000004 // Interrupt for Counter=PWMnCMPA
#define PWM_3_INTEN_INTCNTLOAD_B    0x00000002 // Interrupt for Counter=PWMnLOAD
#define PWM_3_INTEN_INTCNTZERO_B    0x00000001 // Interrupt for Counter=0
#define PWM_3_RIS_INTCMPBD_B        0x00000020 // Comparator B Down Interrupt
#define PWM_3_RIS_INTCMPBU_B        0x00000010 // Comparator B Up Interrupt Status
#define PWM_3_RIS_INTCMPAD_B        0x00000008 // Comparator A Down Interrupt
#define PWM_3_RIS_INTCMPAU_B        0x00000004 // Comparator A Up Interrupt Status
#define PWM_3_RIS_INTCNTLOAD_B      0x00000002 // Counter=Load Interrupt Status
#define PWM_3_RIS_INTCNTZERO_B      0x00000001 // Counter=0 Interrupt Status
#define PWM_3_ISC_INTCMPBD_B        0x00000020 // Comparator B Down Interrupt
#define PWM_3_ISC_INTCMPBU_B        0x00000010 // Comparator B Up Interrupt
#define PWM_3_ISC_INTCMPAD_B        0x00000008 // Comparator A Down Interrupt
#define PWM_3_ISC_INTCMPAU_B        0x00000004 // Comparator A Up Interrupt
#define PWM_3_ISC_INTCNTLOAD_B      0x00000002 // Counter=Load Interrupt
#define PWM_3_ISC_INTCNTZERO_B      0x00000001 // Counter=0 Interrupt
#define PWM_3_LOAD_LOAD_M           0x0000FFFF // Counter Load Value
#define PWM_3_LOAD_LOAD_S           0          // Counter Load Value
#define PWM_3_COUNT_COUNT_M         0x0000FFFF // Counter Value
#define PWM_3_COUNT_COUNT_S         0          // Counter Value
#define PWM_3_CMPA_COMPA_M          0x0000FFFF // Comparator A Value
#define PWM_3_CMPA_COMPA_S          0          // Comparator A Value
#define PWM_3_CMPB_COMPB_M          0x0000FFFF // Comparator B Value
#define PWM_3_CMPB_COMPB_S          0          // Comparator B Value
#define PWM_3_GENA_ACTCMPBD_M       0x00000C00 // Action for Comparator B Down
#define PWM_3_GENA_ACTCMPBD_S       10         // Action for Comparator B Down
#define PWM_3_GENA_ACTCMPBD_INV_V   0x00000400 // Invert pwmA
#define PWM_3_GENA_ACTCMPBD_ONE_V   0x00000C00 // Drive pwmA High
#define PWM_3_GENA_ACTCMPBU_M       0x00000300 // Action for Comparator B Up
#define PWM_3_GENA_ACTCMPBU_S       8          // Action for Comparator B Up
#define PWM_3_GENA_ACTCMPBU_INV_V   0x00000100 // Invert pwmA
#define PWM_3_GENA_ACTCMPBU_ONE_V   0x00000300 // Drive pwmA High
#define PWM_3_GENA_ACTCMPAD_M       0x000000C0 // Action for Comparator A Down
#define PWM_3_GENA_ACTCMPAD_S       6          // Action for Comparator A Down
#define PWM_3_GENA_ACTCMPAD_INV_V   0x00000040 // Invert pwmA
#define PWM_3_GENA_ACTCMPAD_ONE_V   0x000000C0 // Drive pwmA High
#define PWM_3_GENA_ACTCMPAU_M       0x00000030 // Action for Comparator A Up
#define PWM_3_GENA_ACTCMPAU_S       4          // Action for Comparator A Up
#define PWM_3_GENA_ACTCMPAU_INV_V   0x00000010 // Invert pwmA
#define PWM_3_GENA_ACTCMPAU_ONE_V   0x00000030 // Drive pwmA High
#define PWM_3_GENA_ACTLOAD_M        0x0000000C // Action for Counter=LOAD
#define PWM_3_GENA_ACTLOAD_S        2          // Action for Counter=LOAD
#define PWM_3_GENA_ACTLOAD_NONE_V   0x00000000 // Do nothing
#define PWM_3_GENA_ACTLOAD_INV_V    0x00000004 // Invert pwmA
#define PWM_3_GENA_ACTLOAD_ZERO_V   0x00000008 // Drive pwmA Low
#define PWM_3_GENA_ACTLOAD_ONE_V    0x0000000C // Drive pwmA High
#define PWM_3_GENA_ACTZERO_M        0x00000003 // Action for Counter=0
#define PWM_3_GENA_ACTZERO_S        0          // Action for Counter=0
#define PWM_3_GENA_ACTZERO_NONE_V   0x00000000 // Do nothing
#define PWM_3_GENA_ACTZERO_INV_V    0x00000001 // Invert pwmA
#define PWM_3_GENA_ACTZERO_ZERO_V   0x00000002 // Drive pwmA Low
#define PWM_3_GENA_ACTZERO_ONE_V    0x00000003 // Drive pwmA High
#define PWM_3_GENB_ACTCMPBD_M       0x00000C00 // Action for Comparator B Down
#define PWM_3_GENB_ACTCMPBD_S       10         // Action for Comparator B Down
#define PWM_3_GENB_ACTCMPBD_INV_V   0x00000400 // Invert pwmB
#define PWM_3_GENB_ACTCMPBD_ONE_V   0x00000C00 // Drive pwmB High
#define PWM_3_GENB_ACTCMPBU_M       0x00000300 // Action for Comparator B Up
#define PWM_3_GENB_ACTCMPBU_S       8          // Action for Comparator B Up
#define PWM_3_GENB_ACTCMPBU_INV_V   0x00000100 // Invert pwmB
#define PWM_3_GENB_ACTCMPBU_ONE_V   0x00000300 // Drive pwmB High
#define PWM_3_GENB_ACTCMPAD_M       0x000000C0 // Action for Comparator A Down
#define PWM_3_GENB_ACTCMPAD_S       6          // Action for Comparator A Down
#define PWM_3_GENB_ACTCMPAD_INV_V   0x00000040 // Invert pwmB
#define PWM_3_GENB_ACTCMPAD_ONE_V   0x000000C0 // Drive pwmB High
#define PWM_3_GENB_ACTCMPAU_M       0x00000030 // Action for Comparator A Up
#define PWM_3_GENB_ACTCMPAU_S       4          // Action for Comparator A Up
#define PWM_3_GENB_ACTCMPAU_INV_V   0x00000010 // Invert pwmB
#define PWM_3_GENB_ACTCMPAU_ONE_V   0x00000030 // Drive pwmB High
#define PWM_3_GENB_ACTLOAD_M        0x0000000C // Action for Counter=LOAD
#define PWM_3_GENB_ACTLOAD_S        2          // Action for Counter=LOAD
#define PWM_3_GENB_ACTLOAD_NONE_V   0x00000000 // Do nothing
#define PWM_3_GENB_ACTLOAD_INV_V    0x00000004 // Invert pwmB
#define PWM_3_GENB_ACTLOAD_ZERO_V   0x00000008 // Drive pwmB Low
#define PWM_3_GENB_ACTLOAD_ONE_V    0x0000000C // Drive pwmB High
#define PWM_3_GENB_ACTZERO_M        0x00000003 // Action for Counter=0
#define PWM_3_GENB_ACTZERO_S        0          // Action for Counter=0
#define PWM_3_GENB_ACTZERO_NONE_V   0x00000000 // Do nothing
#define PWM_3_GENB_ACTZERO_INV_V    0x00000001 // Invert pwmB
#define PWM_3_GENB_ACTZERO_ZERO_V   0x00000002 // Drive pwmB Low
#define PWM_3_GENB_ACTZERO_ONE_V    0x00000003 // Drive pwmB High
#define PWM_3_DBCTL_ENABLE_V        0x00000001 // Dead-Band Generator Enable
#define PWM_3_FLTSRC0_FAULT1_V      0x00000002 // Fault1 Input
#define PWM_3_FLTSRC0_FAULT0_V      0x00000001 // Fault0 Input
#define PWM_3_FLTSRC1_DCMP7_B       0x00000080 // Digital Comparator 7
#define PWM_3_FLTSRC1_DCMP6_B       0x00000040 // Digital Comparator 6
#define PWM_3_FLTSRC1_DCMP5_B       0x00000020 // Digital Comparator 5
#define PWM_3_FLTSRC1_DCMP4_B       0x00000010 // Digital Comparator 4
#define PWM_3_FLTSRC1_DCMP3_B       0x00000008 // Digital Comparator 3
#define PWM_3_FLTSRC1_DCMP2_B       0x00000004 // Digital Comparator 2
#define PWM_3_FLTSRC1_DCMP1_B       0x00000002 // Digital Comparator 1
#define PWM_3_FLTSRC1_DCMP0_B       0x00000001 // Digital Comparator 0
#define PWM_3_MINFLTPER_MFP_M       0x0000FFFF // Minimum Fault Period
#define PWM_3_MINFLTPER_MFP_S       0          // Minimum Fault Period

/* Bit/Fields in Register 0 of Module PWM                                     */
#define PWM_0_FLTSEN_FAULT1_B       0x00000002 // Fault1 Sense
#define PWM_0_FLTSEN_FAULT0_B       0x00000001 // Fault0 Sense
#define PWM_0_FLTSTAT0_FAULT1_B     0x00000002 // Fault Input 1
#define PWM_0_FLTSTAT0_FAULT0_B     0x00000001 // Fault Input 0
#define PWM_0_FLTSTAT1_DCMP7_B      0x00000080 // Digital Comparator 7 Trigger
#define PWM_0_FLTSTAT1_DCMP6_B      0x00000040 // Digital Comparator 6 Trigger
#define PWM_0_FLTSTAT1_DCMP5_B      0x00000020 // Digital Comparator 5 Trigger
#define PWM_0_FLTSTAT1_DCMP4_B      0x00000010 // Digital Comparator 4 Trigger
#define PWM_0_FLTSTAT1_DCMP3_B      0x00000008 // Digital Comparator 3 Trigger
#define PWM_0_FLTSTAT1_DCMP2_B      0x00000004 // Digital Comparator 2 Trigger
#define PWM_0_FLTSTAT1_DCMP1_B      0x00000002 // Digital Comparator 1 Trigger
#define PWM_0_FLTSTAT1_DCMP0_B      0x00000001 // Digital Comparator 0 Trigger

