hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register 1 of Module PWM                                     */
#define PWM_1_FLTSEN_FAULT1_B       0x00000002 // Fault1 Sense
#define PWM_1_FLTSEN_FAULT0_B       0x00000001 // Fault0 Sense
#define PWM_1_FLTSTAT0_FAULT1_B     0x00000002 // Fault Input 1
#define PWM_1_FLTSTAT0_FAULT0_B     0x00000001 // Fault Input 0
#define PWM_1_FLTSTAT1_DCMP7_B      0x00000080 // Digital Comparator 7 Trigger
#define PWM_1_FLTSTAT1_DCMP6_B      0x00000040 // Digital Comparator 6 Trigger
#define PWM_1_FLTSTAT1_DCMP5_B      0x00000020 // Digital Comparator 5 Trigger
#define PWM_1_FLTSTAT1_DCMP4_B      0x00000010 // Digital Comparator 4 Trigger
#define PWM_1_FLTSTAT1_DCMP3_B      0x00000008 // Digital Comparator 3 Trigger
#define PWM_1_FLTSTAT1_DCMP2_B      0x00000004 // Digital Comparator 2 Trigger
#define PWM_1_FLTSTAT1_DCMP1_B      0x00000002 // Digital Comparator 1 Trigger
#define PWM_1_FLTSTAT1_DCMP0_B      0x00000001 // Digital Comparator 0 Trigger

/* Bit/Fields in Register 2 of Module PWM                                     */
#define PWM_2_FLTSTAT0_FAULT1_B     0x00000002 // Fault Input 1
#define PWM_2_FLTSTAT0_FAULT0_B     0x00000001 // Fault Input 0
#define PWM_2_FLTSTAT1_DCMP7_B      0x00000080 // Digital Comparator 7 Trigger
#define PWM_2_FLTSTAT1_DCMP6_B      0x00000040 // Digital Comparator 6 Trigger
#define PWM_2_FLTSTAT1_DCMP5_B      0x00000020 // Digital Comparator 5 Trigger
#define PWM_2_FLTSTAT1_DCMP4_B      0x00000010 // Digital Comparator 4 Trigger
#define PWM_2_FLTSTAT1_DCMP3_B      0x00000008 // Digital Comparator 3 Trigger
#define PWM_2_FLTSTAT1_DCMP2_B      0x00000004 // Digital Comparator 2 Trigger
#define PWM_2_FLTSTAT1_DCMP1_B      0x00000002 // Digital Comparator 1 Trigger
#define PWM_2_FLTSTAT1_DCMP0_B      0x00000001 // Digital Comparator 0 Trigger

/* Bit/Fields in Register 3 of Module PWM                                     */
#define PWM_3_FLTSTAT0_FAULT1_B     0x00000002 // Fault Input 1
#define PWM_3_FLTSTAT0_FAULT0_B     0x00000001 // Fault Input 0
#define PWM_3_FLTSTAT1_DCMP7_B      0x00000080 // Digital Comparator 7 Trigger
#define PWM_3_FLTSTAT1_DCMP6_B      0x00000040 // Digital Comparator 6 Trigger
#define PWM_3_FLTSTAT1_DCMP5_B      0x00000020 // Digital Comparator 5 Trigger
#define PWM_3_FLTSTAT1_DCMP4_B      0x00000010 // Digital Comparator 4 Trigger
#define PWM_3_FLTSTAT1_DCMP3_B      0x00000008 // Digital Comparator 3 Trigger
#define PWM_3_FLTSTAT1_DCMP2_B      0x00000004 // Digital Comparator 2 Trigger
#define PWM_3_FLTSTAT1_DCMP1_B      0x00000002 // Digital Comparator 1 Trigger
#define PWM_3_FLTSTAT1_DCMP0_B      0x00000001 // Digital Comparator 0 Trigger

/* Bit/Fields in Register PP of Module PWM                                    */
#define PWM_PP_ONE_B                0x00000400 // One-Shot Mode
#define PWM_PP_EFAULT_B             0x00000200 // Extended Fault
#define PWM_PP_ESYNC_B              0x00000100 // Extended Synchronization
#define PWM_PP_FCNT_M               0x000000F0 // Fault Inputs (per PWM unit)
#define PWM_PP_FCNT_S               4          // Fault Inputs (per PWM unit)
#define PWM_PP_GCNT_M               0x0000000F // Generators
#define PWM_PP_GCNT_S               0          // Generators


/******************************************************************************/
/*                                                                            */
/*                      QEI                                                   */
/*                                                                            */
/******************************************************************************/


/* Bit/Fields in Register CTL of Module QEI                                   */
#define QEI_CTL_FILTCNT_M           0x000F0000 // Input Filter Prescale Count
#define QEI_CTL_FILTCNT_S           16         // Input Filter Prescale Count
#define QEI_CTL_FILTEN_B            0x00002000 // Enable Input Filter
#define QEI_CTL_STALLEN_B           0x00001000 // Stall QEI
#define QEI_CTL_INVI_B              0x00000800 // Invert Index Pulse
#define QEI_CTL_INVB_B              0x00000400 // Invert PhB
#define QEI_CTL_INVA_B              0x00000200 // Invert PhA
#define QEI_CTL_VELDIV_M            0x000001C0 // Predivide Velocity
#define QEI_CTL_VELDIV_S            6          // Predivide Velocity
#define QEI_CTL_VELDIV_1_V          0x00000000 // QEI clock /1
#define QEI_CTL_VELDIV_2_V          0x00000040 // QEI clock /2
#define QEI_CTL_VELDIV_4_V          0x00000080 // QEI clock /4
#define QEI_CTL_VELDIV_8_V          0x000000C0 // QEI clock /8
#define QEI_CTL_VELDIV_16_V         0x00000100 // QEI clock /16
#define QEI_CTL_VELDIV_32_V         0x00000140 // QEI clock /32
#define QEI_CTL_VELDIV_64_V         0x00000180 // QEI clock /64
#define QEI_CTL_VELDIV_128_V        0x000001C0 // QEI clock /128
#define QEI_CTL_VELEN_B             0x00000020 // Capture Velocity
#define QEI_CTL_RESMODE_B           0x00000010 // Reset Mode
#define QEI_CTL_CAPMODE_B           0x00000008 // Capture Mode
#define QEI_CTL_SIGMODE_B           0x00000004 // Signal Mode
#define QEI_CTL_SWAP_B              0x00000002 // Swap Signals
#define QEI_CTL_ENABLE_B            0x00000001 // Enable QEI

/* Bit/Fields in Register STAT of Module QEI                                  */
#define QEI_STAT_DIRECTION_B        0x00000002 // Direction of Rotation
#define QEI_STAT_ERROR_B            0x00000001 // Error Detected

/* Bit/Fields in Register POS of Module QEI                                   */
#define QEI_POS_M                   0xFFFFFFFF // Current Position Integrator
#define QEI_POS_S                   0          // Current Position Integrator

/* Bit/Fields in Register MAXPOS of Module QEI                                */
#define QEI_MAXPOS_M                0xFFFFFFFF // Maximum Position Integrator
#define QEI_MAXPOS_S                0          // Maximum Position Integrator

/* Bit/Fields in Register LOAD of Module QEI                                  */
#define QEI_LOAD_M                  0xFFFFFFFF // Velocity Timer Load Value
#define QEI_LOAD_S                  0          // Velocity Timer Load Value

/* Bit/Fields in Register TIME of Module QEI                                  */
#define QEI_TIME_M                  0xFFFFFFFF // Velocity Timer Current Value
#define QEI_TIME_S                  0          // Velocity Timer Current Value

/* Bit/Fields in Register COUNT of Module QEI                                 */
#define QEI_COUNT_M                 0xFFFFFFFF // Velocity Pulse Count
#define QEI_COUNT_S                 0          // Velocity Pulse Count

