hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register SPEED of Module QEI                                 */
#define QEI_SPEED_M                 0xFFFFFFFF // Velocity
#define QEI_SPEED_S                 0          // Velocity

/* Bit/Fields in Register INTEN of Module QEI                                 */
#define QEI_INTEN_ERROR_B           0x00000008 // Phase Error Interrupt Enable
#define QEI_INTEN_DIR_B             0x00000004 // Direction Change Interrupt
#define QEI_INTEN_TIMER_B           0x00000002 // Timer Expires Interrupt Enable
#define QEI_INTEN_INDEX_B           0x00000001 // Index Pulse Detected Interrupt

/* Bit/Fields in Register RIS of Module QEI                                   */
#define QEI_RIS_ERROR_B             0x00000008 // Phase Error Detected
#define QEI_RIS_DIR_B               0x00000004 // Direction Change Detected
#define QEI_RIS_TIMER_B             0x00000002 // Velocity Timer Expired
#define QEI_RIS_INDEX_B             0x00000001 // Index Pulse Asserted

/* Bit/Fields in Register ISC of Module QEI                                   */
#define QEI_ISC_ERROR_B             0x00000008 // Phase Error Interrupt
#define QEI_ISC_DIR_B               0x00000004 // Direction Change Interrupt
#define QEI_ISC_TIMER_B             0x00000002 // Velocity Timer Expired Interrupt
#define QEI_ISC_INDEX_B             0x00000001 // Index Pulse Interrupt


/******************************************************************************/
/*                                                                            */
/*                      TIMER                                                 */
/*                                                                            */
/******************************************************************************/


/* Bit/Fields in Register CFG of Module TIMER                                 */
#define TIMER_CFG_M                 0x00000007 // GPTM Configuration
#define TIMER_CFG_S                 0          // GPTM Configuration
#define TIMER_CFG_32_BIT_TIMER_V    0x00000000 // For a 16/32-bit timer, this
#define TIMER_CFG_32_BIT_RTC_V      0x00000001 // For a 16/32-bit timer, this
#define TIMER_CFG_16_BIT_V          0x00000004 // For a 16/32-bit timer, this

/* Bit/Fields in Register TAMR of Module TIMER                                */
#define TIMER_TAMR_TAPLO_B          0x00000800 // GPTM Timer A PWM Legacy
#define TIMER_TAMR_TAMRSU_B         0x00000400 // GPTM Timer A Match Register
#define TIMER_TAMR_TAPWMIE_B        0x00000200 // GPTM Timer A PWM Interrupt
#define TIMER_TAMR_TAILD_B          0x00000100 // GPTM Timer A Interval Load Write
#define TIMER_TAMR_TASNAPS_B        0x00000080 // GPTM Timer A Snap-Shot Mode
#define TIMER_TAMR_TAWOT_B          0x00000040 // GPTM Timer A Wait-on-Trigger
#define TIMER_TAMR_TAMIE_B          0x00000020 // GPTM Timer A Match Interrupt
#define TIMER_TAMR_TACDIR_B         0x00000010 // GPTM Timer A Count Direction
#define TIMER_TAMR_TAAMS_B          0x00000008 // GPTM Timer A Alternate Mode
#define TIMER_TAMR_TACMR_B          0x00000004 // GPTM Timer A Capture Mode
#define TIMER_TAMR_TAMR_M           0x00000003 // GPTM Timer A Mode
#define TIMER_TAMR_TAMR_S           0          // GPTM Timer A Mode
#define TIMER_TAMR_TAMR_1_SHOT_V    0x00000001 // One-Shot Timer mode
#define TIMER_TAMR_TAMR_PERIOD_V    0x00000002 // Periodic Timer mode
#define TIMER_TAMR_TAMR_CAP_V       0x00000003 // Capture mode

/* Bit/Fields in Register TBMR of Module TIMER                                */
#define TIMER_TBMR_TBPLO_B          0x00000800 // GPTM Timer B PWM Legacy
#define TIMER_TBMR_TBMRSU_B         0x00000400 // GPTM Timer B Match Register
#define TIMER_TBMR_TBPWMIE_B        0x00000200 // GPTM Timer B PWM Interrupt
#define TIMER_TBMR_TBILD_B          0x00000100 // GPTM Timer B Interval Load Write
#define TIMER_TBMR_TBSNAPS_B        0x00000080 // GPTM Timer B Snap-Shot Mode
#define TIMER_TBMR_TBWOT_B          0x00000040 // GPTM Timer B Wait-on-Trigger
#define TIMER_TBMR_TBMIE_B          0x00000020 // GPTM Timer B Match Interrupt
#define TIMER_TBMR_TBCDIR_B         0x00000010 // GPTM Timer B Count Direction
#define TIMER_TBMR_TBAMS_B          0x00000008 // GPTM Timer B Alternate Mode
#define TIMER_TBMR_TBCMR_B          0x00000004 // GPTM Timer B Capture Mode
#define TIMER_TBMR_TBMR_M           0x00000003 // GPTM Timer B Mode
#define TIMER_TBMR_TBMR_S           0          // GPTM Timer B Mode
#define TIMER_TBMR_TBMR_1_SHOT_V    0x00000001 // One-Shot Timer mode
#define TIMER_TBMR_TBMR_PERIOD_V    0x00000002 // Periodic Timer mode
#define TIMER_TBMR_TBMR_CAP_V       0x00000003 // Capture mode

/* Bit/Fields in Register CTL of Module TIMER                                 */
#define TIMER_CTL_TBPWML_B          0x00004000 // GPTM Timer B PWM Output Level
#define TIMER_CTL_TBOTE_B           0x00002000 // GPTM Timer B Output Trigger
#define TIMER_CTL_TBEVENT_M         0x00000C00 // GPTM Timer B Event Mode
#define TIMER_CTL_TBEVENT_S         10         // GPTM Timer B Event Mode
#define TIMER_CTL_TBEVENT_POS_V     0x00000000 // Positive edge
#define TIMER_CTL_TBEVENT_NEG_V     0x00000400 // Negative edge
#define TIMER_CTL_TBEVENT_BOTH_V    0x00000C00 // Both edges
#define TIMER_CTL_TBSTALL_B         0x00000200 // GPTM Timer B Stall Enable
#define TIMER_CTL_TBEN_B            0x00000100 // GPTM Timer B Enable
#define TIMER_CTL_TAPWML_B          0x00000040 // GPTM Timer A PWM Output Level
#define TIMER_CTL_TAOTE_B           0x00000020 // GPTM Timer A Output Trigger
#define TIMER_CTL_RTCEN_B           0x00000010 // GPTM RTC Stall Enable
#define TIMER_CTL_TAEVENT_M         0x0000000C // GPTM Timer A Event Mode
#define TIMER_CTL_TAEVENT_S         2          // GPTM Timer A Event Mode
#define TIMER_CTL_TAEVENT_POS_V     0x00000000 // Positive edge
#define TIMER_CTL_TAEVENT_NEG_V     0x00000004 // Negative edge
#define TIMER_CTL_TAEVENT_BOTH_V    0x0000000C // Both edges
#define TIMER_CTL_TASTALL_B         0x00000002 // GPTM Timer A Stall Enable
#define TIMER_CTL_TAEN_B            0x00000001 // GPTM Timer A Enable

/* Bit/Fields in Register SYNC of Module TIMER                                */
#define TIMER_SYNC_SYNCWT5_M        0x00C00000 // Synchronize GPTM 32/64-Bit Timer
#define TIMER_SYNC_SYNCWT5_S        22         // Synchronize GPTM 32/64-Bit Timer
#define TIMER_SYNC_SYNCWT5_NONE_V   0x00000000 // GPTM 32/64-Bit Timer 5 is not
#define TIMER_SYNC_SYNCWT5_TA_V     0x00400000 // A timeout event for Timer A of
#define TIMER_SYNC_SYNCWT5_TB_V     0x00800000 // A timeout event for Timer B of
#define TIMER_SYNC_SYNCWT5_TATB_V   0x00C00000 // A timeout event for both Timer A
#define TIMER_SYNC_SYNCWT4_M        0x00300000 // Synchronize GPTM 32/64-Bit Timer
#define TIMER_SYNC_SYNCWT4_S        20         // Synchronize GPTM 32/64-Bit Timer
#define TIMER_SYNC_SYNCWT4_NONE_V   0x00000000 // GPTM 32/64-Bit Timer 4 is not
#define TIMER_SYNC_SYNCWT4_TA_V     0x00100000 // A timeout event for Timer A of
#define TIMER_SYNC_SYNCWT4_TB_V     0x00200000 // A timeout event for Timer B of
#define TIMER_SYNC_SYNCWT4_TATB_V   0x00300000 // A timeout event for both Timer A
#define TIMER_SYNC_SYNCWT3_M        0x000C0000 // Synchronize GPTM 32/64-Bit Timer
#define TIMER_SYNC_SYNCWT3_S        18         // Synchronize GPTM 32/64-Bit Timer
#define TIMER_SYNC_SYNCWT3_NONE_V   0x00000000 // GPTM 32/64-Bit Timer 3 is not
#define TIMER_SYNC_SYNCWT3_TA_V     0x00040000 // A timeout event for Timer A of
#define TIMER_SYNC_SYNCWT3_TB_V     0x00080000 // A timeout event for Timer B of
#define TIMER_SYNC_SYNCWT3_TATB_V   0x000C0000 // A timeout event for both Timer A
#define TIMER_SYNC_SYNCWT2_M        0x00030000 // Synchronize GPTM 32/64-Bit Timer
#define TIMER_SYNC_SYNCWT2_S        16         // Synchronize GPTM 32/64-Bit Timer
#define TIMER_SYNC_SYNCWT2_NONE_V   0x00000000 // GPTM 32/64-Bit Timer 2 is not
#define TIMER_SYNC_SYNCWT2_TA_V     0x00010000 // A timeout event for Timer A of
#define TIMER_SYNC_SYNCWT2_TB_V     0x00020000 // A timeout event for Timer B of
#define TIMER_SYNC_SYNCWT2_TATB_V   0x00030000 // A timeout event for both Timer A
#define TIMER_SYNC_SYNCWT1_M        0x0000C000 // Synchronize GPTM 32/64-Bit Timer
#define TIMER_SYNC_SYNCWT1_S        14         // Synchronize GPTM 32/64-Bit Timer
#define TIMER_SYNC_SYNCWT1_NONE_V   0x00000000 // GPTM 32/64-Bit Timer 1 is not
#define TIMER_SYNC_SYNCWT1_TA_V     0x00004000 // A timeout event for Timer A of
#define TIMER_SYNC_SYNCWT1_TB_V     0x00008000 // A timeout event for Timer B of
#define TIMER_SYNC_SYNCWT1_TATB_V   0x0000C000 // A timeout event for both Timer A
#define TIMER_SYNC_SYNCWT0_M        0x00003000 // Synchronize GPTM 32/64-Bit Timer
#define TIMER_SYNC_SYNCWT0_S        12         // Synchronize GPTM 32/64-Bit Timer
#define TIMER_SYNC_SYNCWT0_NONE_V   0x00000000 // GPTM 32/64-Bit Timer 0 is not
#define TIMER_SYNC_SYNCWT0_TA_V     0x00001000 // A timeout event for Timer A of
#define TIMER_SYNC_SYNCWT0_TB_V     0x00002000 // A timeout event for Timer B of
#define TIMER_SYNC_SYNCWT0_TATB_V   0x00003000 // A timeout event for both Timer A
#define TIMER_SYNC_SYNCT5_M         0x00000C00 // Synchronize GPTM Timer 5
#define TIMER_SYNC_SYNCT5_S         10         // Synchronize GPTM Timer 5
#define TIMER_SYNC_SYNCT5_NONE_V    0x00000000 // GPTM5 is not affected
#define TIMER_SYNC_SYNCT5_TA_V      0x00000400 // A timeout event for Timer A of
#define TIMER_SYNC_SYNCT5_TB_V      0x00000800 // A timeout event for Timer B of
#define TIMER_SYNC_SYNCT5_TATB_V    0x00000C00 // A timeout event for both Timer A
#define TIMER_SYNC_SYNCT4_M         0x00000300 // Synchronize GPTM Timer 4
#define TIMER_SYNC_SYNCT4_S         8          // Synchronize GPTM Timer 4
#define TIMER_SYNC_SYNCT4_NONE_V    0x00000000 // GPTM4 is not affected
#define TIMER_SYNC_SYNCT4_TA_V      0x00000100 // A timeout event for Timer A of
#define TIMER_SYNC_SYNCT4_TB_V      0x00000200 // A timeout event for Timer B of
#define TIMER_SYNC_SYNCT4_TATB_V    0x00000300 // A timeout event for both Timer A
#define TIMER_SYNC_SYNCT3_M         0x000000C0 // Synchronize GPTM Timer 3
#define TIMER_SYNC_SYNCT3_S         6          // Synchronize GPTM Timer 3
#define TIMER_SYNC_SYNCT3_NONE_V    0x00000000 // GPTM3 is not affected
#define TIMER_SYNC_SYNCT3_TA_V      0x00000040 // A timeout event for Timer A of
#define TIMER_SYNC_SYNCT3_TB_V      0x00000080 // A timeout event for Timer B of
#define TIMER_SYNC_SYNCT3_TATB_V    0x000000C0 // A timeout event for both Timer A
#define TIMER_SYNC_SYNCT2_M         0x00000030 // Synchronize GPTM Timer 2
#define TIMER_SYNC_SYNCT2_S         4          // Synchronize GPTM Timer 2
#define TIMER_SYNC_SYNCT2_NONE_V    0x00000000 // GPTM2 is not affected
#define TIMER_SYNC_SYNCT2_TA_V      0x00000010 // A timeout event for Timer A of
#define TIMER_SYNC_SYNCT2_TB_V      0x00000020 // A timeout event for Timer B of
#define TIMER_SYNC_SYNCT2_TATB_V    0x00000030 // A timeout event for both Timer A
#define TIMER_SYNC_SYNCT1_M         0x0000000C // Synchronize GPTM Timer 1
#define TIMER_SYNC_SYNCT1_S         2          // Synchronize GPTM Timer 1
#define TIMER_SYNC_SYNCT1_NONE_V    0x00000000 // GPTM1 is not affected
#define TIMER_SYNC_SYNCT1_TA_V      0x00000004 // A timeout event for Timer A of
#define TIMER_SYNC_SYNCT1_TB_V      0x00000008 // A timeout event for Timer B of
#define TIMER_SYNC_SYNCT1_TATB_V    0x0000000C // A timeout event for both Timer A
#define TIMER_SYNC_SYNCT0_M         0x00000003 // Synchronize GPTM Timer 0
#define TIMER_SYNC_SYNCT0_S         0          // Synchronize GPTM Timer 0
#define TIMER_SYNC_SYNCT0_NONE_V    0x00000000 // GPTM0 is not affected
#define TIMER_SYNC_SYNCT0_TA_V      0x00000001 // A timeout event for Timer A of
#define TIMER_SYNC_SYNCT0_TB_V      0x00000002 // A timeout event for Timer B of
#define TIMER_SYNC_SYNCT0_TATB_V    0x00000003 // A timeout event for both Timer A

