hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register IMR of Module TIMER                                 */
#define TIMER_IMR_WUEIM_B           0x00010000 // 32/64-Bit Wide GPTM Write Update
#define TIMER_IMR_TBMIM_B           0x00000800 // GPTM Timer B Match Interrupt
#define TIMER_IMR_CBEIM_B           0x00000400 // GPTM Timer B Capture Mode Event
#define TIMER_IMR_CBMIM_B           0x00000200 // GPTM Timer B Capture Mode Match
#define TIMER_IMR_TBTOIM_B          0x00000100 // GPTM Timer B Time-Out Interrupt
#define TIMER_IMR_TAMIM_B           0x00000010 // GPTM Timer A Match Interrupt
#define TIMER_IMR_RTCIM_B           0x00000008 // GPTM RTC Interrupt Mask
#define TIMER_IMR_CAEIM_B           0x00000004 // GPTM Timer A Capture Mode Event
#define TIMER_IMR_CAMIM_B           0x00000002 // GPTM Timer A Capture Mode Match
#define TIMER_IMR_TATOIM_B          0x00000001 // GPTM Timer A Time-Out Interrupt

/* Bit/Fields in Register RIS of Module TIMER                                 */
#define TIMER_RIS_WUERIS_B          0x00010000 // 32/64-Bit Wide GPTM Write Update
#define TIMER_RIS_TBMRIS_B          0x00000800 // GPTM Timer B Match Raw Interrupt
#define TIMER_RIS_CBERIS_B          0x00000400 // GPTM Timer B Capture Mode Event
#define TIMER_RIS_CBMRIS_B          0x00000200 // GPTM Timer B Capture Mode Match
#define TIMER_RIS_TBTORIS_B         0x00000100 // GPTM Timer B Time-Out Raw
#define TIMER_RIS_TAMRIS_B          0x00000010 // GPTM Timer A Match Raw Interrupt
#define TIMER_RIS_RTCRIS_B          0x00000008 // GPTM RTC Raw Interrupt
#define TIMER_RIS_CAERIS_B          0x00000004 // GPTM Timer A Capture Mode Event
#define TIMER_RIS_CAMRIS_B          0x00000002 // GPTM Timer A Capture Mode Match
#define TIMER_RIS_TATORIS_B         0x00000001 // GPTM Timer A Time-Out Raw

/* Bit/Fields in Register MIS of Module TIMER                                 */
#define TIMER_MIS_WUEMIS_B          0x00010000 // 32/64-Bit Wide GPTM Write Update
#define TIMER_MIS_TBMMIS_B          0x00000800 // GPTM Timer B Match Masked
#define TIMER_MIS_CBEMIS_B          0x00000400 // GPTM Timer B Capture Mode Event
#define TIMER_MIS_CBMMIS_B          0x00000200 // GPTM Timer B Capture Mode Match
#define TIMER_MIS_TBTOMIS_B         0x00000100 // GPTM Timer B Time-Out Masked
#define TIMER_MIS_TAMMIS_B          0x00000010 // GPTM Timer A Match Masked
#define TIMER_MIS_RTCMIS_B          0x00000008 // GPTM RTC Masked Interrupt
#define TIMER_MIS_CAEMIS_B          0x00000004 // GPTM Timer A Capture Mode Event
#define TIMER_MIS_CAMMIS_B          0x00000002 // GPTM Timer A Capture Mode Match
#define TIMER_MIS_TATOMIS_B         0x00000001 // GPTM Timer A Time-Out Masked

/* Bit/Fields in Register ICR of Module TIMER                                 */
#define TIMER_ICR_WUECINT_B         0x00010000 // 32/64-Bit Wide GPTM Write Update
#define TIMER_ICR_TBMCINT_B         0x00000800 // GPTM Timer B Match Interrupt
#define TIMER_ICR_CBECINT_B         0x00000400 // GPTM Timer B Capture Mode Event
#define TIMER_ICR_CBMCINT_B         0x00000200 // GPTM Timer B Capture Mode Match
#define TIMER_ICR_TBTOCINT_B        0x00000100 // GPTM Timer B Time-Out Interrupt
#define TIMER_ICR_TAMCINT_B         0x00000010 // GPTM Timer A Match Interrupt
#define TIMER_ICR_RTCCINT_B         0x00000008 // GPTM RTC Interrupt Clear
#define TIMER_ICR_CAECINT_B         0x00000004 // GPTM Timer A Capture Mode Event
#define TIMER_ICR_CAMCINT_B         0x00000002 // GPTM Timer A Capture Mode Match
#define TIMER_ICR_TATOCINT_B        0x00000001 // GPTM Timer A Time-Out Raw

/* Bit/Fields in Register TAILR of Module TIMER                               */
#define TIMER_TAILR_M               0xFFFFFFFF // GPTM Timer A Interval Load
#define TIMER_TAILR_S               0          // GPTM Timer A Interval Load

/* Bit/Fields in Register TBILR of Module TIMER                               */
#define TIMER_TBILR_M               0xFFFFFFFF // GPTM Timer B Interval Load
#define TIMER_TBILR_S               0          // GPTM Timer B Interval Load

/* Bit/Fields in Register TAMATCHR of Module TIMER                            */
#define TIMER_TAMATCHR_TAMR_M       0xFFFFFFFF // GPTM Timer A Match Register
#define TIMER_TAMATCHR_TAMR_S       0          // GPTM Timer A Match Register

/* Bit/Fields in Register TBMATCHR of Module TIMER                            */
#define TIMER_TBMATCHR_TBMR_M       0xFFFFFFFF // GPTM Timer B Match Register
#define TIMER_TBMATCHR_TBMR_S       0          // GPTM Timer B Match Register

/* Bit/Fields in Register TAPR of Module TIMER                                */
#define TIMER_TAPR_TAPSRH_M         0x0000FF00 // GPTM Timer A Prescale High Byte
#define TIMER_TAPR_TAPSRH_S         8          // GPTM Timer A Prescale High Byte
#define TIMER_TAPR_TAPSR_M          0x000000FF // GPTM Timer A Prescale
#define TIMER_TAPR_TAPSR_S          0          // GPTM Timer A Prescale

/* Bit/Fields in Register TBPR of Module TIMER                                */
#define TIMER_TBPR_TBPSRH_M         0x0000FF00 // GPTM Timer B Prescale High Byte
#define TIMER_TBPR_TBPSRH_S         8          // GPTM Timer B Prescale High Byte
#define TIMER_TBPR_TBPSR_M          0x000000FF // GPTM Timer B Prescale
#define TIMER_TBPR_TBPSR_S          0          // GPTM Timer B Prescale

/* Bit/Fields in Register TAPMR of Module TIMER                               */
#define TIMER_TAPMR_TAPSMRH_M       0x0000FF00 // GPTM Timer A Prescale Match High
#define TIMER_TAPMR_TAPSMRH_S       8          // GPTM Timer A Prescale Match High
#define TIMER_TAPMR_TAPSMR_M        0x000000FF // GPTM TimerA Prescale Match
#define TIMER_TAPMR_TAPSMR_S        0          // GPTM TimerA Prescale Match

/* Bit/Fields in Register TBPMR of Module TIMER                               */
#define TIMER_TBPMR_TBPSMRH_M       0x0000FF00 // GPTM Timer B Prescale Match High
#define TIMER_TBPMR_TBPSMRH_S       8          // GPTM Timer B Prescale Match High
#define TIMER_TBPMR_TBPSMR_M        0x000000FF // GPTM TimerB Prescale Match
#define TIMER_TBPMR_TBPSMR_S        0          // GPTM TimerB Prescale Match

/* Bit/Fields in Register TAR of Module TIMER                                 */
#define TIMER_TAR_M                 0xFFFFFFFF // GPTM Timer A Register
#define TIMER_TAR_S                 0          // GPTM Timer A Register

/* Bit/Fields in Register TBR of Module TIMER                                 */
#define TIMER_TBR_M                 0xFFFFFFFF // GPTM Timer B Register
#define TIMER_TBR_S                 0          // GPTM Timer B Register

