hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register TAV of Module TIMER                                 */
#define TIMER_TAV_M                 0xFFFFFFFF // GPTM Timer A Value
#define TIMER_TAV_S                 0          // GPTM Timer A Value

/* Bit/Fields in Register TBV of Module TIMER                                 */
#define TIMER_TBV_M                 0xFFFFFFFF // GPTM Timer B Value
#define TIMER_TBV_S                 0          // GPTM Timer B Value

/* Bit/Fields in Register RTCPD of Module TIMER                               */
#define TIMER_RTCPD_RTCPD_M         0x0000FFFF // RTC Predivide Counter Value
#define TIMER_RTCPD_RTCPD_S         0          // RTC Predivide Counter Value

/* Bit/Fields in Register TAPS of Module TIMER                                */
#define TIMER_TAPS_PSS_M            0x0000FFFF // GPTM Timer A Prescaler Snapshot
#define TIMER_TAPS_PSS_S            0          // GPTM Timer A Prescaler Snapshot

/* Bit/Fields in Register TBPS of Module TIMER                                */
#define TIMER_TBPS_PSS_M            0x0000FFFF // GPTM Timer A Prescaler Value
#define TIMER_TBPS_PSS_S            0          // GPTM Timer A Prescaler Value

/* Bit/Fields in Register TAPV of Module TIMER                                */
#define TIMER_TAPV_PSV_M            0x0000FFFF // GPTM Timer A Prescaler Value
#define TIMER_TAPV_PSV_S            0          // GPTM Timer A Prescaler Value

/* Bit/Fields in Register TBPV of Module TIMER                                */
#define TIMER_TBPV_PSV_M            0x0000FFFF // GPTM Timer B Prescaler Value
#define TIMER_TBPV_PSV_S            0          // GPTM Timer B Prescaler Value

/* Bit/Fields in Register PP of Module TIMER                                  */
#define TIMER_PP_SIZE_M             0x0000000F // Count Size
#define TIMER_PP_SIZE_S             0          // Count Size
#define TIMER_PP_SIZE_16_V          0x00000000 // Timer A and Timer B counters are
#define TIMER_PP_SIZE_32_V          0x00000001 // Timer A and Timer B counters are


/******************************************************************************/
/*                                                                            */
/*                      ADC                                                   */
/*                                                                            */
/******************************************************************************/


/* Bit/Fields in Register ACTSS of Module ADC                                 */
#define ADC_ACTSS_BUSY_B            0x00010000 // ADC Busy
#define ADC_ACTSS_ASEN3_B           0x00000008 // ADC SS3 Enable
#define ADC_ACTSS_ASEN2_B           0x00000004 // ADC SS2 Enable
#define ADC_ACTSS_ASEN1_B           0x00000002 // ADC SS1 Enable
#define ADC_ACTSS_ASEN0_B           0x00000001 // ADC SS0 Enable

/* Bit/Fields in Register RIS of Module ADC                                   */
#define ADC_RIS_INRDC_B             0x00010000 // Digital Comparator Raw Interrupt
#define ADC_RIS_INR3_B              0x00000008 // SS3 Raw Interrupt Status
#define ADC_RIS_INR2_B              0x00000004 // SS2 Raw Interrupt Status
#define ADC_RIS_INR1_B              0x00000002 // SS1 Raw Interrupt Status
#define ADC_RIS_INR0_B              0x00000001 // SS0 Raw Interrupt Status

/* Bit/Fields in Register IM of Module ADC                                    */
#define ADC_IM_DCONSS3_B            0x00080000 // Digital Comparator Interrupt on
#define ADC_IM_DCONSS2_B            0x00040000 // Digital Comparator Interrupt on
#define ADC_IM_DCONSS1_B            0x00020000 // Digital Comparator Interrupt on
#define ADC_IM_DCONSS0_B            0x00010000 // Digital Comparator Interrupt on
#define ADC_IM_MASK3_B              0x00000008 // SS3 Interrupt Mask
#define ADC_IM_MASK2_B              0x00000004 // SS2 Interrupt Mask
#define ADC_IM_MASK1_B              0x00000002 // SS1 Interrupt Mask
#define ADC_IM_MASK0_B              0x00000001 // SS0 Interrupt Mask

/* Bit/Fields in Register ISC of Module ADC                                   */
#define ADC_ISC_DCINSS3_B           0x00080000 // Digital Comparator Interrupt
#define ADC_ISC_DCINSS2_B           0x00040000 // Digital Comparator Interrupt
#define ADC_ISC_DCINSS1_B           0x00020000 // Digital Comparator Interrupt
#define ADC_ISC_DCINSS0_B           0x00010000 // Digital Comparator Interrupt
#define ADC_ISC_IN3_B               0x00000008 // SS3 Interrupt Status and Clear
#define ADC_ISC_IN2_B               0x00000004 // SS2 Interrupt Status and Clear
#define ADC_ISC_IN1_B               0x00000002 // SS1 Interrupt Status and Clear
#define ADC_ISC_IN0_B               0x00000001 // SS0 Interrupt Status and Clear

/* Bit/Fields in Register OSTAT of Module ADC                                 */
#define ADC_OSTAT_OV3_B             0x00000008 // SS3 FIFO Overflow
#define ADC_OSTAT_OV2_B             0x00000004 // SS2 FIFO Overflow
#define ADC_OSTAT_OV1_B             0x00000002 // SS1 FIFO Overflow
#define ADC_OSTAT_OV0_B             0x00000001 // SS0 FIFO Overflow

/* Bit/Fields in Register EMUX of Module ADC                                  */
#define ADC_EMUX_EM3_M              0x0000F000 // SS3 Trigger Select
#define ADC_EMUX_EM3_S              12         // SS3 Trigger Select
#define ADC_EMUX_EM3_PROCESSOR_V    0x00000000 // Processor (default)
#define ADC_EMUX_EM3_COMP0_V        0x00001000 // Analog Comparator 0
#define ADC_EMUX_EM3_COMP1_V        0x00002000 // Analog Comparator 1
#define ADC_EMUX_EM3_EXTERNAL_V     0x00004000 // External (GPIO Pins)
#define ADC_EMUX_EM3_TIMER_V        0x00005000 // Timer
#define ADC_EMUX_EM3_PWM0_V         0x00006000 // PWM generator 0
#define ADC_EMUX_EM3_PWM1_V         0x00007000 // PWM generator 1
#define ADC_EMUX_EM3_PWM2_V         0x00008000 // PWM generator 2
#define ADC_EMUX_EM3_PWM3_V         0x00009000 // PWM generator 3
#define ADC_EMUX_EM3_ALWAYS_V       0x0000F000 // Always (continuously sample)
#define ADC_EMUX_EM2_M              0x00000F00 // SS2 Trigger Select
#define ADC_EMUX_EM2_S              8          // SS2 Trigger Select
#define ADC_EMUX_EM2_PROCESSOR_V    0x00000000 // Processor (default)
#define ADC_EMUX_EM2_COMP0_V        0x00000100 // Analog Comparator 0
#define ADC_EMUX_EM2_COMP1_V        0x00000200 // Analog Comparator 1
#define ADC_EMUX_EM2_EXTERNAL_V     0x00000400 // External (GPIO Pins)
#define ADC_EMUX_EM2_TIMER_V        0x00000500 // Timer
#define ADC_EMUX_EM2_PWM0_V         0x00000600 // PWM generator 0
#define ADC_EMUX_EM2_PWM1_V         0x00000700 // PWM generator 1
#define ADC_EMUX_EM2_PWM2_V         0x00000800 // PWM generator 2
#define ADC_EMUX_EM2_PWM3_V         0x00000900 // PWM generator 3
#define ADC_EMUX_EM2_ALWAYS_V       0x00000F00 // Always (continuously sample)
#define ADC_EMUX_EM1_M              0x000000F0 // SS1 Trigger Select
#define ADC_EMUX_EM1_S              4          // SS1 Trigger Select
#define ADC_EMUX_EM1_PROCESSOR_V    0x00000000 // Processor (default)
#define ADC_EMUX_EM1_COMP0_V        0x00000010 // Analog Comparator 0
#define ADC_EMUX_EM1_COMP1_V        0x00000020 // Analog Comparator 1
#define ADC_EMUX_EM1_EXTERNAL_V     0x00000040 // External (GPIO Pins)
#define ADC_EMUX_EM1_TIMER_V        0x00000050 // Timer
#define ADC_EMUX_EM1_PWM0_V         0x00000060 // PWM generator 0
#define ADC_EMUX_EM1_PWM1_V         0x00000070 // PWM generator 1
#define ADC_EMUX_EM1_PWM2_V         0x00000080 // PWM generator 2
#define ADC_EMUX_EM1_PWM3_V         0x00000090 // PWM generator 3
#define ADC_EMUX_EM1_ALWAYS_V       0x000000F0 // Always (continuously sample)
#define ADC_EMUX_EM0_M              0x0000000F // SS0 Trigger Select
#define ADC_EMUX_EM0_S              0          // SS0 Trigger Select
#define ADC_EMUX_EM0_PROCESSOR_V    0x00000000 // Processor (default)
#define ADC_EMUX_EM0_COMP0_V        0x00000001 // Analog Comparator 0
#define ADC_EMUX_EM0_COMP1_V        0x00000002 // Analog Comparator 1
#define ADC_EMUX_EM0_EXTERNAL_V     0x00000004 // External (GPIO Pins)
#define ADC_EMUX_EM0_TIMER_V        0x00000005 // Timer
#define ADC_EMUX_EM0_PWM0_V         0x00000006 // PWM generator 0
#define ADC_EMUX_EM0_PWM1_V         0x00000007 // PWM generator 1
#define ADC_EMUX_EM0_PWM2_V         0x00000008 // PWM generator 2
#define ADC_EMUX_EM0_PWM3_V         0x00000009 // PWM generator 3
#define ADC_EMUX_EM0_ALWAYS_V       0x0000000F // Always (continuously sample)

/* Bit/Fields in Register USTAT of Module ADC                                 */
#define ADC_USTAT_UV3_B             0x00000008 // SS3 FIFO Underflow
#define ADC_USTAT_UV2_B             0x00000004 // SS2 FIFO Underflow
#define ADC_USTAT_UV1_B             0x00000002 // SS1 FIFO Underflow
#define ADC_USTAT_UV0_B             0x00000001 // SS0 FIFO Underflow

/* Bit/Fields in Register TSSEL of Module ADC                                 */
#define ADC_TSSEL_PS3_M             0x30000000 // Generator 3 PWM Module Trigger
#define ADC_TSSEL_PS3_S             28         // Generator 3 PWM Module Trigger
#define ADC_TSSEL_PS3_0_V           0x00000000 // Use Generator 3 (and its
#define ADC_TSSEL_PS3_1_V           0x10000000 // Use Generator 3 (and its
#define ADC_TSSEL_PS2_M             0x00300000 // Generator 2 PWM Module Trigger
#define ADC_TSSEL_PS2_S             20         // Generator 2 PWM Module Trigger
#define ADC_TSSEL_PS2_0_V           0x00000000 // Use Generator 2 (and its
#define ADC_TSSEL_PS2_1_V           0x00100000 // Use Generator 2 (and its
#define ADC_TSSEL_PS1_M             0x00003000 // Generator 1 PWM Module Trigger
#define ADC_TSSEL_PS1_S             12         // Generator 1 PWM Module Trigger
#define ADC_TSSEL_PS1_0_V           0x00000000 // Use Generator 1 (and its
#define ADC_TSSEL_PS1_1_V           0x00001000 // Use Generator 1 (and its
#define ADC_TSSEL_PS0_M             0x00000030 // Generator 0 PWM Module Trigger
#define ADC_TSSEL_PS0_S             4          // Generator 0 PWM Module Trigger
#define ADC_TSSEL_PS0_0_V           0x00000000 // Use Generator 0 (and its
#define ADC_TSSEL_PS0_1_V           0x00000010 // Use Generator 0 (and its

