hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register SSPRI of Module ADC                                 */
#define ADC_SSPRI_SS3_M             0x00003000 // SS3 Priority
#define ADC_SSPRI_SS3_S             12         // SS3 Priority
#define ADC_SSPRI_SS2_M             0x00000300 // SS2 Priority
#define ADC_SSPRI_SS2_S             8          // SS2 Priority
#define ADC_SSPRI_SS1_M             0x00000030 // SS1 Priority
#define ADC_SSPRI_SS1_S             4          // SS1 Priority
#define ADC_SSPRI_SS0_M             0x00000003 // SS0 Priority
#define ADC_SSPRI_SS0_S             0          // SS0 Priority

/* Bit/Fields in Register SPC of Module ADC                                   */
#define ADC_SPC_PHASE_M             0x0000000F // Phase Difference
#define ADC_SPC_PHASE_S             0          // Phase Difference
#define ADC_SPC_PHASE_0_V           0x00000000 // ADC sample lags by 0.0
#define ADC_SPC_PHASE_22_5_V        0x00000001 // ADC sample lags by 22.5
#define ADC_SPC_PHASE_45_V          0x00000002 // ADC sample lags by 45.0
#define ADC_SPC_PHASE_67_5_V        0x00000003 // ADC sample lags by 67.5
#define ADC_SPC_PHASE_90_V          0x00000004 // ADC sample lags by 90.0
#define ADC_SPC_PHASE_112_5_V       0x00000005 // ADC sample lags by 112.5
#define ADC_SPC_PHASE_135_V         0x00000006 // ADC sample lags by 135.0
#define ADC_SPC_PHASE_157_5_V       0x00000007 // ADC sample lags by 157.5
#define ADC_SPC_PHASE_180_V         0x00000008 // ADC sample lags by 180.0
#define ADC_SPC_PHASE_202_5_V       0x00000009 // ADC sample lags by 202.5
#define ADC_SPC_PHASE_225_V         0x0000000A // ADC sample lags by 225.0
#define ADC_SPC_PHASE_247_5_V       0x0000000B // ADC sample lags by 247.5
#define ADC_SPC_PHASE_270_V         0x0000000C // ADC sample lags by 270.0
#define ADC_SPC_PHASE_292_5_V       0x0000000D // ADC sample lags by 292.5
#define ADC_SPC_PHASE_315_V         0x0000000E // ADC sample lags by 315.0
#define ADC_SPC_PHASE_337_5_V       0x0000000F // ADC sample lags by 337.5

/* Bit/Fields in Register PSSI of Module ADC                                  */
#define ADC_PSSI_GSYNC_B            0x80000000 // Global Synchronize
#define ADC_PSSI_SYNCWAIT_B         0x08000000 // Synchronize Wait
#define ADC_PSSI_SS3_B              0x00000008 // SS3 Initiate
#define ADC_PSSI_SS2_B              0x00000004 // SS2 Initiate
#define ADC_PSSI_SS1_B              0x00000002 // SS1 Initiate
#define ADC_PSSI_SS0_B              0x00000001 // SS0 Initiate

/* Bit/Fields in Register SAC of Module ADC                                   */
#define ADC_SAC_AVG_M               0x00000007 // Hardware Averaging Control
#define ADC_SAC_AVG_S               0          // Hardware Averaging Control
#define ADC_SAC_AVG_OFF_V           0x00000000 // No hardware oversampling
#define ADC_SAC_AVG_2X_V            0x00000001 // 2x hardware oversampling
#define ADC_SAC_AVG_4X_V            0x00000002 // 4x hardware oversampling
#define ADC_SAC_AVG_8X_V            0x00000003 // 8x hardware oversampling
#define ADC_SAC_AVG_16X_V           0x00000004 // 16x hardware oversampling
#define ADC_SAC_AVG_32X_V           0x00000005 // 32x hardware oversampling
#define ADC_SAC_AVG_64X_V           0x00000006 // 64x hardware oversampling

/* Bit/Fields in Register DCISC of Module ADC                                 */
#define ADC_DCISC_DCINT7_B          0x00000080 // Digital Comparator 7 Interrupt
#define ADC_DCISC_DCINT6_B          0x00000040 // Digital Comparator 6 Interrupt
#define ADC_DCISC_DCINT5_B          0x00000020 // Digital Comparator 5 Interrupt
#define ADC_DCISC_DCINT4_B          0x00000010 // Digital Comparator 4 Interrupt
#define ADC_DCISC_DCINT3_B          0x00000008 // Digital Comparator 3 Interrupt
#define ADC_DCISC_DCINT2_B          0x00000004 // Digital Comparator 2 Interrupt
#define ADC_DCISC_DCINT1_B          0x00000002 // Digital Comparator 1 Interrupt
#define ADC_DCISC_DCINT0_B          0x00000001 // Digital Comparator 0 Interrupt

/* Bit/Fields in Register CTL of Module ADC                                   */
#define ADC_CTL_DITHER_B            0x00000040 // Dither Mode Enable
#define ADC_CTL_VREF_M              0x00000001 // Voltage Reference Select
#define ADC_CTL_VREF_S              0          // Voltage Reference Select
#define ADC_CTL_VREF_INTERNAL_V     0x00000000 // VDDA and GNDA are the voltage

/* Bit/Fields in Register SSMUX0 of Module ADC                                */
#define ADC_SSMUX0_MUX7_M           0xF0000000 // 8th Sample Input Select
#define ADC_SSMUX0_MUX7_S           28         // 8th Sample Input Select
#define ADC_SSMUX0_MUX6_M           0x0F000000 // 7th Sample Input Select
#define ADC_SSMUX0_MUX6_S           24         // 7th Sample Input Select
#define ADC_SSMUX0_MUX5_M           0x00F00000 // 6th Sample Input Select
#define ADC_SSMUX0_MUX5_S           20         // 6th Sample Input Select
#define ADC_SSMUX0_MUX4_M           0x000F0000 // 5th Sample Input Select
#define ADC_SSMUX0_MUX4_S           16         // 5th Sample Input Select
#define ADC_SSMUX0_MUX3_M           0x0000F000 // 4th Sample Input Select
#define ADC_SSMUX0_MUX3_S           12         // 4th Sample Input Select
#define ADC_SSMUX0_MUX2_M           0x00000F00 // 3rd Sample Input Select
#define ADC_SSMUX0_MUX2_S           8          // 3rd Sample Input Select
#define ADC_SSMUX0_MUX1_M           0x000000F0 // 2nd Sample Input Select
#define ADC_SSMUX0_MUX1_S           4          // 2nd Sample Input Select
#define ADC_SSMUX0_MUX0_M           0x0000000F // 1st Sample Input Select
#define ADC_SSMUX0_MUX0_S           0          // 1st Sample Input Select

/* Bit/Fields in Register SSCTL0 of Module ADC                                */
#define ADC_SSCTL0_TS7_B            0x80000000 // 8th Sample Temp Sensor Select
#define ADC_SSCTL0_IE7_B            0x40000000 // 8th Sample Interrupt Enable
#define ADC_SSCTL0_END7_B           0x20000000 // 8th Sample is End of Sequence
#define ADC_SSCTL0_D7_B             0x10000000 // 8th Sample Differential Input
#define ADC_SSCTL0_TS6_B            0x08000000 // 7th Sample Temp Sensor Select
#define ADC_SSCTL0_IE6_B            0x04000000 // 7th Sample Interrupt Enable
#define ADC_SSCTL0_END6_B           0x02000000 // 7th Sample is End of Sequence
#define ADC_SSCTL0_D6_B             0x01000000 // 7th Sample Differential Input
#define ADC_SSCTL0_TS5_B            0x00800000 // 6th Sample Temp Sensor Select
#define ADC_SSCTL0_IE5_B            0x00400000 // 6th Sample Interrupt Enable
#define ADC_SSCTL0_END5_B           0x00200000 // 6th Sample is End of Sequence
#define ADC_SSCTL0_D5_B             0x00100000 // 6th Sample Differential Input
#define ADC_SSCTL0_TS4_B            0x00080000 // 5th Sample Temp Sensor Select
#define ADC_SSCTL0_IE4_B            0x00040000 // 5th Sample Interrupt Enable
#define ADC_SSCTL0_END4_B           0x00020000 // 5th Sample is End of Sequence
#define ADC_SSCTL0_D4_B             0x00010000 // 5th Sample Differential Input
#define ADC_SSCTL0_TS3_B            0x00008000 // 4th Sample Temp Sensor Select
#define ADC_SSCTL0_IE3_B            0x00004000 // 4th Sample Interrupt Enable
#define ADC_SSCTL0_END3_B           0x00002000 // 4th Sample is End of Sequence
#define ADC_SSCTL0_D3_B             0x00001000 // 4th Sample Differential Input
#define ADC_SSCTL0_TS2_B            0x00000800 // 3rd Sample Temp Sensor Select
#define ADC_SSCTL0_IE2_B            0x00000400 // 3rd Sample Interrupt Enable
#define ADC_SSCTL0_END2_B           0x00000200 // 3rd Sample is End of Sequence
#define ADC_SSCTL0_D2_B             0x00000100 // 3rd Sample Differential Input
#define ADC_SSCTL0_TS1_B            0x00000080 // 2nd Sample Temp Sensor Select
#define ADC_SSCTL0_IE1_B            0x00000040 // 2nd Sample Interrupt Enable
#define ADC_SSCTL0_END1_B           0x00000020 // 2nd Sample is End of Sequence
#define ADC_SSCTL0_D1_B             0x00000010 // 2nd Sample Differential Input
#define ADC_SSCTL0_TS0_B            0x00000008 // 1st Sample Temp Sensor Select
#define ADC_SSCTL0_IE0_B            0x00000004 // 1st Sample Interrupt Enable
#define ADC_SSCTL0_END0_B           0x00000002 // 1st Sample is End of Sequence
#define ADC_SSCTL0_D0_B             0x00000001 // 1st Sample Differential Input

/* Bit/Fields in Register SSFIFO0 of Module ADC                               */
#define ADC_SSFIFO0_DATA_M          0x00000FFF // Conversion Result Data
#define ADC_SSFIFO0_DATA_S          0          // Conversion Result Data

/* Bit/Fields in Register SSFSTAT0 of Module ADC                              */
#define ADC_SSFSTAT0_FULL_B         0x00001000 // FIFO Full
#define ADC_SSFSTAT0_EMPTY_B        0x00000100 // FIFO Empty
#define ADC_SSFSTAT0_HPTR_M         0x000000F0 // FIFO Head Pointer
#define ADC_SSFSTAT0_HPTR_S         4          // FIFO Head Pointer
#define ADC_SSFSTAT0_TPTR_M         0x0000000F // FIFO Tail Pointer
#define ADC_SSFSTAT0_TPTR_S         0          // FIFO Tail Pointer

/* Bit/Fields in Register SSOP0 of Module ADC                                 */
#define ADC_SSOP0_S7DCOP_B          0x10000000 // Sample 7 Digital Comparator
#define ADC_SSOP0_S6DCOP_B          0x01000000 // Sample 6 Digital Comparator
#define ADC_SSOP0_S5DCOP_B          0x00100000 // Sample 5 Digital Comparator
#define ADC_SSOP0_S4DCOP_B          0x00010000 // Sample 4 Digital Comparator
#define ADC_SSOP0_S3DCOP_B          0x00001000 // Sample 3 Digital Comparator
#define ADC_SSOP0_S2DCOP_B          0x00000100 // Sample 2 Digital Comparator
#define ADC_SSOP0_S1DCOP_B          0x00000010 // Sample 1 Digital Comparator
#define ADC_SSOP0_S0DCOP_B          0x00000001 // Sample 0 Digital Comparator

