hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register SSDC0 of Module ADC                                 */
#define ADC_SSDC0_S7DCSEL_M         0xF0000000 // Sample 7 Digital Comparator
#define ADC_SSDC0_S7DCSEL_S         28         // Sample 7 Digital Comparator
#define ADC_SSDC0_S6DCSEL_M         0x0F000000 // Sample 6 Digital Comparator
#define ADC_SSDC0_S6DCSEL_S         24         // Sample 6 Digital Comparator
#define ADC_SSDC0_S5DCSEL_M         0x00F00000 // Sample 5 Digital Comparator
#define ADC_SSDC0_S5DCSEL_S         20         // Sample 5 Digital Comparator
#define ADC_SSDC0_S4DCSEL_M         0x000F0000 // Sample 4 Digital Comparator
#define ADC_SSDC0_S4DCSEL_S         16         // Sample 4 Digital Comparator
#define ADC_SSDC0_S3DCSEL_M         0x0000F000 // Sample 3 Digital Comparator
#define ADC_SSDC0_S3DCSEL_S         12         // Sample 3 Digital Comparator
#define ADC_SSDC0_S2DCSEL_M         0x00000F00 // Sample 2 Digital Comparator
#define ADC_SSDC0_S2DCSEL_S         8          // Sample 2 Digital Comparator
#define ADC_SSDC0_S1DCSEL_M         0x000000F0 // Sample 1 Digital Comparator
#define ADC_SSDC0_S1DCSEL_S         4          // Sample 1 Digital Comparator
#define ADC_SSDC0_S0DCSEL_M         0x0000000F // Sample 0 Digital Comparator
#define ADC_SSDC0_S0DCSEL_S         0          // Sample 0 Digital Comparator

/* Bit/Fields in Register SSMUX1 of Module ADC                                */
#define ADC_SSMUX1_MUX3_M           0x0000F000 // 4th Sample Input Select
#define ADC_SSMUX1_MUX3_S           12         // 4th Sample Input Select
#define ADC_SSMUX1_MUX2_M           0x00000F00 // 3rd Sample Input Select
#define ADC_SSMUX1_MUX2_S           8          // 3rd Sample Input Select
#define ADC_SSMUX1_MUX1_M           0x000000F0 // 2nd Sample Input Select
#define ADC_SSMUX1_MUX1_S           4          // 2nd Sample Input Select
#define ADC_SSMUX1_MUX0_M           0x0000000F // 1st Sample Input Select
#define ADC_SSMUX1_MUX0_S           0          // 1st Sample Input Select

/* Bit/Fields in Register SSCTL1 of Module ADC                                */
#define ADC_SSCTL1_TS3_B            0x00008000 // 4th Sample Temp Sensor Select
#define ADC_SSCTL1_IE3_B            0x00004000 // 4th Sample Interrupt Enable
#define ADC_SSCTL1_END3_B           0x00002000 // 4th Sample is End of Sequence
#define ADC_SSCTL1_D3_B             0x00001000 // 4th Sample Differential Input
#define ADC_SSCTL1_TS2_B            0x00000800 // 3rd Sample Temp Sensor Select
#define ADC_SSCTL1_IE2_B            0x00000400 // 3rd Sample Interrupt Enable
#define ADC_SSCTL1_END2_B           0x00000200 // 3rd Sample is End of Sequence
#define ADC_SSCTL1_D2_B             0x00000100 // 3rd Sample Differential Input
#define ADC_SSCTL1_TS1_B            0x00000080 // 2nd Sample Temp Sensor Select
#define ADC_SSCTL1_IE1_B            0x00000040 // 2nd Sample Interrupt Enable
#define ADC_SSCTL1_END1_B           0x00000020 // 2nd Sample is End of Sequence
#define ADC_SSCTL1_D1_B             0x00000010 // 2nd Sample Differential Input
#define ADC_SSCTL1_TS0_B            0x00000008 // 1st Sample Temp Sensor Select
#define ADC_SSCTL1_IE0_B            0x00000004 // 1st Sample Interrupt Enable
#define ADC_SSCTL1_END0_B           0x00000002 // 1st Sample is End of Sequence
#define ADC_SSCTL1_D0_B             0x00000001 // 1st Sample Differential Input

/* Bit/Fields in Register SSFIFO1 of Module ADC                               */
#define ADC_SSFIFO1_DATA_M          0x00000FFF // Conversion Result Data
#define ADC_SSFIFO1_DATA_S          0          // Conversion Result Data

/* Bit/Fields in Register SSFSTAT1 of Module ADC                              */
#define ADC_SSFSTAT1_FULL_B         0x00001000 // FIFO Full
#define ADC_SSFSTAT1_EMPTY_B        0x00000100 // FIFO Empty
#define ADC_SSFSTAT1_HPTR_M         0x000000F0 // FIFO Head Pointer
#define ADC_SSFSTAT1_HPTR_S         4          // FIFO Head Pointer
#define ADC_SSFSTAT1_TPTR_M         0x0000000F // FIFO Tail Pointer
#define ADC_SSFSTAT1_TPTR_S         0          // FIFO Tail Pointer

/* Bit/Fields in Register SSOP1 of Module ADC                                 */
#define ADC_SSOP1_S3DCOP_B          0x00001000 // Sample 3 Digital Comparator
#define ADC_SSOP1_S2DCOP_B          0x00000100 // Sample 2 Digital Comparator
#define ADC_SSOP1_S1DCOP_B          0x00000010 // Sample 1 Digital Comparator
#define ADC_SSOP1_S0DCOP_B          0x00000001 // Sample 0 Digital Comparator

/* Bit/Fields in Register SSDC1 of Module ADC                                 */
#define ADC_SSDC1_S3DCSEL_M         0x0000F000 // Sample 3 Digital Comparator
#define ADC_SSDC1_S3DCSEL_S         12         // Sample 3 Digital Comparator
#define ADC_SSDC1_S2DCSEL_M         0x00000F00 // Sample 2 Digital Comparator
#define ADC_SSDC1_S2DCSEL_S         8          // Sample 2 Digital Comparator
#define ADC_SSDC1_S1DCSEL_M         0x000000F0 // Sample 1 Digital Comparator
#define ADC_SSDC1_S1DCSEL_S         4          // Sample 1 Digital Comparator
#define ADC_SSDC1_S0DCSEL_M         0x0000000F // Sample 0 Digital Comparator
#define ADC_SSDC1_S0DCSEL_S         0          // Sample 0 Digital Comparator

/* Bit/Fields in Register SSMUX2 of Module ADC                                */
#define ADC_SSMUX2_MUX3_M           0x0000F000 // 4th Sample Input Select
#define ADC_SSMUX2_MUX3_S           12         // 4th Sample Input Select
#define ADC_SSMUX2_MUX2_M           0x00000F00 // 3rd Sample Input Select
#define ADC_SSMUX2_MUX2_S           8          // 3rd Sample Input Select
#define ADC_SSMUX2_MUX1_M           0x000000F0 // 2nd Sample Input Select
#define ADC_SSMUX2_MUX1_S           4          // 2nd Sample Input Select
#define ADC_SSMUX2_MUX0_M           0x0000000F // 1st Sample Input Select
#define ADC_SSMUX2_MUX0_S           0          // 1st Sample Input Select

/* Bit/Fields in Register SSCTL2 of Module ADC                                */
#define ADC_SSCTL2_TS3_B            0x00008000 // 4th Sample Temp Sensor Select
#define ADC_SSCTL2_IE3_B            0x00004000 // 4th Sample Interrupt Enable
#define ADC_SSCTL2_END3_B           0x00002000 // 4th Sample is End of Sequence
#define ADC_SSCTL2_D3_B             0x00001000 // 4th Sample Differential Input
#define ADC_SSCTL2_TS2_B            0x00000800 // 3rd Sample Temp Sensor Select
#define ADC_SSCTL2_IE2_B            0x00000400 // 3rd Sample Interrupt Enable
#define ADC_SSCTL2_END2_B           0x00000200 // 3rd Sample is End of Sequence
#define ADC_SSCTL2_D2_B             0x00000100 // 3rd Sample Differential Input
#define ADC_SSCTL2_TS1_B            0x00000080 // 2nd Sample Temp Sensor Select
#define ADC_SSCTL2_IE1_B            0x00000040 // 2nd Sample Interrupt Enable
#define ADC_SSCTL2_END1_B           0x00000020 // 2nd Sample is End of Sequence
#define ADC_SSCTL2_D1_B             0x00000010 // 2nd Sample Differential Input
#define ADC_SSCTL2_TS0_B            0x00000008 // 1st Sample Temp Sensor Select
#define ADC_SSCTL2_IE0_B            0x00000004 // 1st Sample Interrupt Enable
#define ADC_SSCTL2_END0_B           0x00000002 // 1st Sample is End of Sequence
#define ADC_SSCTL2_D0_B             0x00000001 // 1st Sample Differential Input

/* Bit/Fields in Register SSFIFO2 of Module ADC                               */
#define ADC_SSFIFO2_DATA_M          0x00000FFF // Conversion Result Data
#define ADC_SSFIFO2_DATA_S          0          // Conversion Result Data

/* Bit/Fields in Register SSFSTAT2 of Module ADC                              */
#define ADC_SSFSTAT2_FULL_B         0x00001000 // FIFO Full
#define ADC_SSFSTAT2_EMPTY_B        0x00000100 // FIFO Empty
#define ADC_SSFSTAT2_HPTR_M         0x000000F0 // FIFO Head Pointer
#define ADC_SSFSTAT2_HPTR_S         4          // FIFO Head Pointer
#define ADC_SSFSTAT2_TPTR_M         0x0000000F // FIFO Tail Pointer
#define ADC_SSFSTAT2_TPTR_S         0          // FIFO Tail Pointer

/* Bit/Fields in Register SSOP2 of Module ADC                                 */
#define ADC_SSOP2_S3DCOP_B          0x00001000 // Sample 3 Digital Comparator
#define ADC_SSOP2_S2DCOP_B          0x00000100 // Sample 2 Digital Comparator
#define ADC_SSOP2_S1DCOP_B          0x00000010 // Sample 1 Digital Comparator
#define ADC_SSOP2_S0DCOP_B          0x00000001 // Sample 0 Digital Comparator

/* Bit/Fields in Register SSDC2 of Module ADC                                 */
#define ADC_SSDC2_S3DCSEL_M         0x0000F000 // Sample 3 Digital Comparator
#define ADC_SSDC2_S3DCSEL_S         12         // Sample 3 Digital Comparator
#define ADC_SSDC2_S2DCSEL_M         0x00000F00 // Sample 2 Digital Comparator
#define ADC_SSDC2_S2DCSEL_S         8          // Sample 2 Digital Comparator
#define ADC_SSDC2_S1DCSEL_M         0x000000F0 // Sample 1 Digital Comparator
#define ADC_SSDC2_S1DCSEL_S         4          // Sample 1 Digital Comparator
#define ADC_SSDC2_S0DCSEL_M         0x0000000F // Sample 0 Digital Comparator
#define ADC_SSDC2_S0DCSEL_S         0          // Sample 0 Digital Comparator

/* Bit/Fields in Register SSMUX3 of Module ADC                                */
#define ADC_SSMUX3_MUX0_M           0x0000000F // 1st Sample Input Select
#define ADC_SSMUX3_MUX0_S           0          // 1st Sample Input Select

/* Bit/Fields in Register SSCTL3 of Module ADC                                */
#define ADC_SSCTL3_TS0_B            0x00000008 // 1st Sample Temp Sensor Select
#define ADC_SSCTL3_IE0_B            0x00000004 // Sample Interrupt Enable
#define ADC_SSCTL3_END0_B           0x00000002 // End of Sequence
#define ADC_SSCTL3_D0_B             0x00000001 // Sample Differential Input Select

/* Bit/Fields in Register SSFIFO3 of Module ADC                               */
#define ADC_SSFIFO3_DATA_M          0x00000FFF // Conversion Result Data
#define ADC_SSFIFO3_DATA_S          0          // Conversion Result Data

