hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register SSFSTAT3 of Module ADC                              */
#define ADC_SSFSTAT3_FULL_B         0x00001000 // FIFO Full
#define ADC_SSFSTAT3_EMPTY_B        0x00000100 // FIFO Empty
#define ADC_SSFSTAT3_HPTR_M         0x000000F0 // FIFO Head Pointer
#define ADC_SSFSTAT3_HPTR_S         4          // FIFO Head Pointer
#define ADC_SSFSTAT3_TPTR_M         0x0000000F // FIFO Tail Pointer
#define ADC_SSFSTAT3_TPTR_S         0          // FIFO Tail Pointer

/* Bit/Fields in Register SSOP3 of Module ADC                                 */
#define ADC_SSOP3_S0DCOP_B          0x00000001 // Sample 0 Digital Comparator

/* Bit/Fields in Register SSDC3 of Module ADC                                 */
#define ADC_SSDC3_S0DCSEL_M         0x0000000F // Sample 0 Digital Comparator
#define ADC_SSDC3_S0DCSEL_S         0          // Sample 0 Digital Comparator

/* Bit/Fields in Register DCRIC of Module ADC                                 */
#define ADC_DCRIC_DCTRIG7_B         0x00800000 // Digital Comparator Trigger 7
#define ADC_DCRIC_DCTRIG6_B         0x00400000 // Digital Comparator Trigger 6
#define ADC_DCRIC_DCTRIG5_B         0x00200000 // Digital Comparator Trigger 5
#define ADC_DCRIC_DCTRIG4_B         0x00100000 // Digital Comparator Trigger 4
#define ADC_DCRIC_DCTRIG3_B         0x00080000 // Digital Comparator Trigger 3
#define ADC_DCRIC_DCTRIG2_B         0x00040000 // Digital Comparator Trigger 2
#define ADC_DCRIC_DCTRIG1_B         0x00020000 // Digital Comparator Trigger 1
#define ADC_DCRIC_DCTRIG0_B         0x00010000 // Digital Comparator Trigger 0
#define ADC_DCRIC_DCINT7_B          0x00000080 // Digital Comparator Interrupt 7
#define ADC_DCRIC_DCINT6_B          0x00000040 // Digital Comparator Interrupt 6
#define ADC_DCRIC_DCINT5_B          0x00000020 // Digital Comparator Interrupt 5
#define ADC_DCRIC_DCINT4_B          0x00000010 // Digital Comparator Interrupt 4
#define ADC_DCRIC_DCINT3_B          0x00000008 // Digital Comparator Interrupt 3
#define ADC_DCRIC_DCINT2_B          0x00000004 // Digital Comparator Interrupt 2
#define ADC_DCRIC_DCINT1_B          0x00000002 // Digital Comparator Interrupt 1
#define ADC_DCRIC_DCINT0_B          0x00000001 // Digital Comparator Interrupt 0

/* Bit/Fields in Register DCCTL0 of Module ADC                                */
#define ADC_DCCTL0_CTE_B            0x00001000 // Comparison Trigger Enable
#define ADC_DCCTL0_CTC_M            0x00000C00 // Comparison Trigger Condition
#define ADC_DCCTL0_CTC_S            10         // Comparison Trigger Condition
#define ADC_DCCTL0_CTC_LOW_V        0x00000000 // Low Band
#define ADC_DCCTL0_CTC_MID_V        0x00000400 // Mid Band
#define ADC_DCCTL0_CTC_HIGH_V       0x00000C00 // High Band
#define ADC_DCCTL0_CTM_M            0x00000300 // Comparison Trigger Mode
#define ADC_DCCTL0_CTM_S            8          // Comparison Trigger Mode
#define ADC_DCCTL0_CTM_ALWAYS_V     0x00000000 // Always
#define ADC_DCCTL0_CTM_ONCE_V       0x00000100 // Once
#define ADC_DCCTL0_CTM_HALWAYS_V    0x00000200 // Hysteresis Always
#define ADC_DCCTL0_CTM_HONCE_V      0x00000300 // Hysteresis Once
#define ADC_DCCTL0_CIE_B            0x00000010 // Comparison Interrupt Enable
#define ADC_DCCTL0_CIC_M            0x0000000C // Comparison Interrupt Condition
#define ADC_DCCTL0_CIC_S            2          // Comparison Interrupt Condition
#define ADC_DCCTL0_CIC_LOW_V        0x00000000 // Low Band
#define ADC_DCCTL0_CIC_MID_V        0x00000004 // Mid Band
#define ADC_DCCTL0_CIC_HIGH_V       0x0000000C // High Band
#define ADC_DCCTL0_CIM_M            0x00000003 // Comparison Interrupt Mode
#define ADC_DCCTL0_CIM_S            0          // Comparison Interrupt Mode
#define ADC_DCCTL0_CIM_ALWAYS_V     0x00000000 // Always
#define ADC_DCCTL0_CIM_ONCE_V       0x00000001 // Once
#define ADC_DCCTL0_CIM_HALWAYS_V    0x00000002 // Hysteresis Always
#define ADC_DCCTL0_CIM_HONCE_V      0x00000003 // Hysteresis Once

/* Bit/Fields in Register DCCTL1 of Module ADC                                */
#define ADC_DCCTL1_CTE_B            0x00001000 // Comparison Trigger Enable
#define ADC_DCCTL1_CTC_M            0x00000C00 // Comparison Trigger Condition
#define ADC_DCCTL1_CTC_S            10         // Comparison Trigger Condition
#define ADC_DCCTL1_CTC_LOW_V        0x00000000 // Low Band
#define ADC_DCCTL1_CTC_MID_V        0x00000400 // Mid Band
#define ADC_DCCTL1_CTC_HIGH_V       0x00000C00 // High Band
#define ADC_DCCTL1_CTM_M            0x00000300 // Comparison Trigger Mode
#define ADC_DCCTL1_CTM_S            8          // Comparison Trigger Mode
#define ADC_DCCTL1_CTM_ALWAYS_V     0x00000000 // Always
#define ADC_DCCTL1_CTM_ONCE_V       0x00000100 // Once
#define ADC_DCCTL1_CTM_HALWAYS_V    0x00000200 // Hysteresis Always
#define ADC_DCCTL1_CTM_HONCE_V      0x00000300 // Hysteresis Once
#define ADC_DCCTL1_CIE_B            0x00000010 // Comparison Interrupt Enable
#define ADC_DCCTL1_CIC_M            0x0000000C // Comparison Interrupt Condition
#define ADC_DCCTL1_CIC_S            2          // Comparison Interrupt Condition
#define ADC_DCCTL1_CIC_LOW_V        0x00000000 // Low Band
#define ADC_DCCTL1_CIC_MID_V        0x00000004 // Mid Band
#define ADC_DCCTL1_CIC_HIGH_V       0x0000000C // High Band
#define ADC_DCCTL1_CIM_M            0x00000003 // Comparison Interrupt Mode
#define ADC_DCCTL1_CIM_S            0          // Comparison Interrupt Mode
#define ADC_DCCTL1_CIM_ALWAYS_V     0x00000000 // Always
#define ADC_DCCTL1_CIM_ONCE_V       0x00000001 // Once
#define ADC_DCCTL1_CIM_HALWAYS_V    0x00000002 // Hysteresis Always
#define ADC_DCCTL1_CIM_HONCE_V      0x00000003 // Hysteresis Once

/* Bit/Fields in Register DCCTL2 of Module ADC                                */
#define ADC_DCCTL2_CTE_B            0x00001000 // Comparison Trigger Enable
#define ADC_DCCTL2_CTC_M            0x00000C00 // Comparison Trigger Condition
#define ADC_DCCTL2_CTC_S            10         // Comparison Trigger Condition
#define ADC_DCCTL2_CTC_LOW_V        0x00000000 // Low Band
#define ADC_DCCTL2_CTC_MID_V        0x00000400 // Mid Band
#define ADC_DCCTL2_CTC_HIGH_V       0x00000C00 // High Band
#define ADC_DCCTL2_CTM_M            0x00000300 // Comparison Trigger Mode
#define ADC_DCCTL2_CTM_S            8          // Comparison Trigger Mode
#define ADC_DCCTL2_CTM_ALWAYS_V     0x00000000 // Always
#define ADC_DCCTL2_CTM_ONCE_V       0x00000100 // Once
#define ADC_DCCTL2_CTM_HALWAYS_V    0x00000200 // Hysteresis Always
#define ADC_DCCTL2_CTM_HONCE_V      0x00000300 // Hysteresis Once
#define ADC_DCCTL2_CIE_B            0x00000010 // Comparison Interrupt Enable
#define ADC_DCCTL2_CIC_M            0x0000000C // Comparison Interrupt Condition
#define ADC_DCCTL2_CIC_S            2          // Comparison Interrupt Condition
#define ADC_DCCTL2_CIC_LOW_V        0x00000000 // Low Band
#define ADC_DCCTL2_CIC_MID_V        0x00000004 // Mid Band
#define ADC_DCCTL2_CIC_HIGH_V       0x0000000C // High Band
#define ADC_DCCTL2_CIM_M            0x00000003 // Comparison Interrupt Mode
#define ADC_DCCTL2_CIM_S            0          // Comparison Interrupt Mode
#define ADC_DCCTL2_CIM_ALWAYS_V     0x00000000 // Always
#define ADC_DCCTL2_CIM_ONCE_V       0x00000001 // Once
#define ADC_DCCTL2_CIM_HALWAYS_V    0x00000002 // Hysteresis Always
#define ADC_DCCTL2_CIM_HONCE_V      0x00000003 // Hysteresis Once

