hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register DCCTL3 of Module ADC                                */
#define ADC_DCCTL3_CTE_B            0x00001000 // Comparison Trigger Enable
#define ADC_DCCTL3_CTC_M            0x00000C00 // Comparison Trigger Condition
#define ADC_DCCTL3_CTC_S            10         // Comparison Trigger Condition
#define ADC_DCCTL3_CTC_LOW_V        0x00000000 // Low Band
#define ADC_DCCTL3_CTC_MID_V        0x00000400 // Mid Band
#define ADC_DCCTL3_CTC_HIGH_V       0x00000C00 // High Band
#define ADC_DCCTL3_CTM_M            0x00000300 // Comparison Trigger Mode
#define ADC_DCCTL3_CTM_S            8          // Comparison Trigger Mode
#define ADC_DCCTL3_CTM_ALWAYS_V     0x00000000 // Always
#define ADC_DCCTL3_CTM_ONCE_V       0x00000100 // Once
#define ADC_DCCTL3_CTM_HALWAYS_V    0x00000200 // Hysteresis Always
#define ADC_DCCTL3_CTM_HONCE_V      0x00000300 // Hysteresis Once
#define ADC_DCCTL3_CIE_B            0x00000010 // Comparison Interrupt Enable
#define ADC_DCCTL3_CIC_M            0x0000000C // Comparison Interrupt Condition
#define ADC_DCCTL3_CIC_S            2          // Comparison Interrupt Condition
#define ADC_DCCTL3_CIC_LOW_V        0x00000000 // Low Band
#define ADC_DCCTL3_CIC_MID_V        0x00000004 // Mid Band
#define ADC_DCCTL3_CIC_HIGH_V       0x0000000C // High Band
#define ADC_DCCTL3_CIM_M            0x00000003 // Comparison Interrupt Mode
#define ADC_DCCTL3_CIM_S            0          // Comparison Interrupt Mode
#define ADC_DCCTL3_CIM_ALWAYS_V     0x00000000 // Always
#define ADC_DCCTL3_CIM_ONCE_V       0x00000001 // Once
#define ADC_DCCTL3_CIM_HALWAYS_V    0x00000002 // Hysteresis Always
#define ADC_DCCTL3_CIM_HONCE_V      0x00000003 // Hysteresis Once

/* Bit/Fields in Register DCCTL4 of Module ADC                                */
#define ADC_DCCTL4_CTE_B            0x00001000 // Comparison Trigger Enable
#define ADC_DCCTL4_CTC_M            0x00000C00 // Comparison Trigger Condition
#define ADC_DCCTL4_CTC_S            10         // Comparison Trigger Condition
#define ADC_DCCTL4_CTC_LOW_V        0x00000000 // Low Band
#define ADC_DCCTL4_CTC_MID_V        0x00000400 // Mid Band
#define ADC_DCCTL4_CTC_HIGH_V       0x00000C00 // High Band
#define ADC_DCCTL4_CTM_M            0x00000300 // Comparison Trigger Mode
#define ADC_DCCTL4_CTM_S            8          // Comparison Trigger Mode
#define ADC_DCCTL4_CTM_ALWAYS_V     0x00000000 // Always
#define ADC_DCCTL4_CTM_ONCE_V       0x00000100 // Once
#define ADC_DCCTL4_CTM_HALWAYS_V    0x00000200 // Hysteresis Always
#define ADC_DCCTL4_CTM_HONCE_V      0x00000300 // Hysteresis Once
#define ADC_DCCTL4_CIE_B            0x00000010 // Comparison Interrupt Enable
#define ADC_DCCTL4_CIC_M            0x0000000C // Comparison Interrupt Condition
#define ADC_DCCTL4_CIC_S            2          // Comparison Interrupt Condition
#define ADC_DCCTL4_CIC_LOW_V        0x00000000 // Low Band
#define ADC_DCCTL4_CIC_MID_V        0x00000004 // Mid Band
#define ADC_DCCTL4_CIC_HIGH_V       0x0000000C // High Band
#define ADC_DCCTL4_CIM_M            0x00000003 // Comparison Interrupt Mode
#define ADC_DCCTL4_CIM_S            0          // Comparison Interrupt Mode
#define ADC_DCCTL4_CIM_ALWAYS_V     0x00000000 // Always
#define ADC_DCCTL4_CIM_ONCE_V       0x00000001 // Once
#define ADC_DCCTL4_CIM_HALWAYS_V    0x00000002 // Hysteresis Always
#define ADC_DCCTL4_CIM_HONCE_V      0x00000003 // Hysteresis Once

/* Bit/Fields in Register DCCTL5 of Module ADC                                */
#define ADC_DCCTL5_CTE_B            0x00001000 // Comparison Trigger Enable
#define ADC_DCCTL5_CTC_M            0x00000C00 // Comparison Trigger Condition
#define ADC_DCCTL5_CTC_S            10         // Comparison Trigger Condition
#define ADC_DCCTL5_CTC_LOW_V        0x00000000 // Low Band
#define ADC_DCCTL5_CTC_MID_V        0x00000400 // Mid Band
#define ADC_DCCTL5_CTC_HIGH_V       0x00000C00 // High Band
#define ADC_DCCTL5_CTM_M            0x00000300 // Comparison Trigger Mode
#define ADC_DCCTL5_CTM_S            8          // Comparison Trigger Mode
#define ADC_DCCTL5_CTM_ALWAYS_V     0x00000000 // Always
#define ADC_DCCTL5_CTM_ONCE_V       0x00000100 // Once
#define ADC_DCCTL5_CTM_HALWAYS_V    0x00000200 // Hysteresis Always
#define ADC_DCCTL5_CTM_HONCE_V      0x00000300 // Hysteresis Once
#define ADC_DCCTL5_CIE_B            0x00000010 // Comparison Interrupt Enable
#define ADC_DCCTL5_CIC_M            0x0000000C // Comparison Interrupt Condition
#define ADC_DCCTL5_CIC_S            2          // Comparison Interrupt Condition
#define ADC_DCCTL5_CIC_LOW_V        0x00000000 // Low Band
#define ADC_DCCTL5_CIC_MID_V        0x00000004 // Mid Band
#define ADC_DCCTL5_CIC_HIGH_V       0x0000000C // High Band
#define ADC_DCCTL5_CIM_M            0x00000003 // Comparison Interrupt Mode
#define ADC_DCCTL5_CIM_S            0          // Comparison Interrupt Mode
#define ADC_DCCTL5_CIM_ALWAYS_V     0x00000000 // Always
#define ADC_DCCTL5_CIM_ONCE_V       0x00000001 // Once
#define ADC_DCCTL5_CIM_HALWAYS_V    0x00000002 // Hysteresis Always
#define ADC_DCCTL5_CIM_HONCE_V      0x00000003 // Hysteresis Once

/* Bit/Fields in Register DCCTL6 of Module ADC                                */
#define ADC_DCCTL6_CTE_B            0x00001000 // Comparison Trigger Enable
#define ADC_DCCTL6_CTC_M            0x00000C00 // Comparison Trigger Condition
#define ADC_DCCTL6_CTC_S            10         // Comparison Trigger Condition
#define ADC_DCCTL6_CTC_LOW_V        0x00000000 // Low Band
#define ADC_DCCTL6_CTC_MID_V        0x00000400 // Mid Band
#define ADC_DCCTL6_CTC_HIGH_V       0x00000C00 // High Band
#define ADC_DCCTL6_CTM_M            0x00000300 // Comparison Trigger Mode
#define ADC_DCCTL6_CTM_S            8          // Comparison Trigger Mode
#define ADC_DCCTL6_CTM_ALWAYS_V     0x00000000 // Always
#define ADC_DCCTL6_CTM_ONCE_V       0x00000100 // Once
#define ADC_DCCTL6_CTM_HALWAYS_V    0x00000200 // Hysteresis Always
#define ADC_DCCTL6_CTM_HONCE_V      0x00000300 // Hysteresis Once
#define ADC_DCCTL6_CIE_B            0x00000010 // Comparison Interrupt Enable
#define ADC_DCCTL6_CIC_M            0x0000000C // Comparison Interrupt Condition
#define ADC_DCCTL6_CIC_S            2          // Comparison Interrupt Condition
#define ADC_DCCTL6_CIC_LOW_V        0x00000000 // Low Band
#define ADC_DCCTL6_CIC_MID_V        0x00000004 // Mid Band
#define ADC_DCCTL6_CIC_HIGH_V       0x0000000C // High Band
#define ADC_DCCTL6_CIM_M            0x00000003 // Comparison Interrupt Mode
#define ADC_DCCTL6_CIM_S            0          // Comparison Interrupt Mode
#define ADC_DCCTL6_CIM_ALWAYS_V     0x00000000 // Always
#define ADC_DCCTL6_CIM_ONCE_V       0x00000001 // Once
#define ADC_DCCTL6_CIM_HALWAYS_V    0x00000002 // Hysteresis Always
#define ADC_DCCTL6_CIM_HONCE_V      0x00000003 // Hysteresis Once

/* Bit/Fields in Register DCCTL7 of Module ADC                                */
#define ADC_DCCTL7_CTE_B            0x00001000 // Comparison Trigger Enable
#define ADC_DCCTL7_CTC_M            0x00000C00 // Comparison Trigger Condition
#define ADC_DCCTL7_CTC_S            10         // Comparison Trigger Condition
#define ADC_DCCTL7_CTC_LOW_V        0x00000000 // Low Band
#define ADC_DCCTL7_CTC_MID_V        0x00000400 // Mid Band
#define ADC_DCCTL7_CTC_HIGH_V       0x00000C00 // High Band
#define ADC_DCCTL7_CTM_M            0x00000300 // Comparison Trigger Mode
#define ADC_DCCTL7_CTM_S            8          // Comparison Trigger Mode
#define ADC_DCCTL7_CTM_ALWAYS_V     0x00000000 // Always
#define ADC_DCCTL7_CTM_ONCE_V       0x00000100 // Once
#define ADC_DCCTL7_CTM_HALWAYS_V    0x00000200 // Hysteresis Always
#define ADC_DCCTL7_CTM_HONCE_V      0x00000300 // Hysteresis Once
#define ADC_DCCTL7_CIE_B            0x00000010 // Comparison Interrupt Enable
#define ADC_DCCTL7_CIC_M            0x0000000C // Comparison Interrupt Condition
#define ADC_DCCTL7_CIC_S            2          // Comparison Interrupt Condition
#define ADC_DCCTL7_CIC_LOW_V        0x00000000 // Low Band
#define ADC_DCCTL7_CIC_MID_V        0x00000004 // Mid Band
#define ADC_DCCTL7_CIC_HIGH_V       0x0000000C // High Band
#define ADC_DCCTL7_CIM_M            0x00000003 // Comparison Interrupt Mode
#define ADC_DCCTL7_CIM_S            0          // Comparison Interrupt Mode
#define ADC_DCCTL7_CIM_ALWAYS_V     0x00000000 // Always
#define ADC_DCCTL7_CIM_ONCE_V       0x00000001 // Once
#define ADC_DCCTL7_CIM_HALWAYS_V    0x00000002 // Hysteresis Always
#define ADC_DCCTL7_CIM_HONCE_V      0x00000003 // Hysteresis Once

/* Bit/Fields in Register DCCMP0 of Module ADC                                */
#define ADC_DCCMP0_COMP1_M          0x0FFF0000 // Compare 1
#define ADC_DCCMP0_COMP1_S          16         // Compare 1
#define ADC_DCCMP0_COMP0_M          0x00000FFF // Compare 0
#define ADC_DCCMP0_COMP0_S          0          // Compare 0

/* Bit/Fields in Register DCCMP1 of Module ADC                                */
#define ADC_DCCMP1_COMP1_M          0x0FFF0000 // Compare 1
#define ADC_DCCMP1_COMP1_S          16         // Compare 1
#define ADC_DCCMP1_COMP0_M          0x00000FFF // Compare 0
#define ADC_DCCMP1_COMP0_S          0          // Compare 0

/* Bit/Fields in Register DCCMP2 of Module ADC                                */
#define ADC_DCCMP2_COMP1_M          0x0FFF0000 // Compare 1
#define ADC_DCCMP2_COMP1_S          16         // Compare 1
#define ADC_DCCMP2_COMP0_M          0x00000FFF // Compare 0
#define ADC_DCCMP2_COMP0_S          0          // Compare 0

/* Bit/Fields in Register DCCMP3 of Module ADC                                */
#define ADC_DCCMP3_COMP1_M          0x0FFF0000 // Compare 1
#define ADC_DCCMP3_COMP1_S          16         // Compare 1
#define ADC_DCCMP3_COMP0_M          0x00000FFF // Compare 0
#define ADC_DCCMP3_COMP0_S          0          // Compare 0

/* Bit/Fields in Register DCCMP4 of Module ADC                                */
#define ADC_DCCMP4_COMP1_M          0x0FFF0000 // Compare 1
#define ADC_DCCMP4_COMP1_S          16         // Compare 1
#define ADC_DCCMP4_COMP0_M          0x00000FFF // Compare 0
#define ADC_DCCMP4_COMP0_S          0          // Compare 0

/* Bit/Fields in Register DCCMP5 of Module ADC                                */
#define ADC_DCCMP5_COMP1_M          0x0FFF0000 // Compare 1
#define ADC_DCCMP5_COMP1_S          16         // Compare 1
#define ADC_DCCMP5_COMP0_M          0x00000FFF // Compare 0
#define ADC_DCCMP5_COMP0_S          0          // Compare 0

/* Bit/Fields in Register DCCMP6 of Module ADC                                */
#define ADC_DCCMP6_COMP1_M          0x0FFF0000 // Compare 1
#define ADC_DCCMP6_COMP1_S          16         // Compare 1
#define ADC_DCCMP6_COMP0_M          0x00000FFF // Compare 0
#define ADC_DCCMP6_COMP0_S          0          // Compare 0

/* Bit/Fields in Register DCCMP7 of Module ADC                                */
#define ADC_DCCMP7_COMP1_M          0x0FFF0000 // Compare 1
#define ADC_DCCMP7_COMP1_S          16         // Compare 1
#define ADC_DCCMP7_COMP0_M          0x00000FFF // Compare 0
#define ADC_DCCMP7_COMP0_S          0          // Compare 0

/* Bit/Fields in Register PP of Module ADC                                    */
#define ADC_PP_TS_B                 0x00800000 // Temperature Sensor
#define ADC_PP_RSL_M                0x007C0000 // Resolution
#define ADC_PP_RSL_S                18         // Resolution
#define ADC_PP_TYPE_M               0x00030000 // ADC Architecture
#define ADC_PP_TYPE_S               16         // ADC Architecture
#define ADC_PP_TYPE_SAR_V           0x00000000 // SAR
#define ADC_PP_DC_M                 0x0000FC00 // Digital Comparator Count
#define ADC_PP_DC_S                 10         // Digital Comparator Count
#define ADC_PP_CH_M                 0x000003F0 // ADC Channel Count
#define ADC_PP_CH_S                 4          // ADC Channel Count
#define ADC_PP_MSR_M                0x0000000F // Maximum ADC Sample Rate
#define ADC_PP_MSR_S                0          // Maximum ADC Sample Rate
#define ADC_PP_MSR_125K_V           0x00000001 // 125 ksps
#define ADC_PP_MSR_250K_V           0x00000003 // 250 ksps
#define ADC_PP_MSR_500K_V           0x00000005 // 500 ksps
#define ADC_PP_MSR_1M_V             0x00000007 // 1 Msps

/* Bit/Fields in Register PC of Module ADC                                    */
#define ADC_PC_SR_M                 0x0000000F // ADC Sample Rate
#define ADC_PC_SR_S                 0          // ADC Sample Rate
#define ADC_PC_SR_125K_V            0x00000001 // 125 ksps
#define ADC_PC_SR_250K_V            0x00000003 // 250 ksps
#define ADC_PC_SR_500K_V            0x00000005 // 500 ksps
#define ADC_PC_SR_1M_V              0x00000007 // 1 Msps

