hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register CC of Module ADC                                    */
#define ADC_CC_CS_M                 0x0000000F // ADC Clock Source
#define ADC_CC_CS_S                 0          // ADC Clock Source
#define ADC_CC_CS_SYSPLL_V          0x00000000 // PLL VCO divided by CLKDIV
#define ADC_CC_CS_PIOSC_V           0x00000001 // PIOSC


/******************************************************************************/
/*                                                                            */
/*                      COMP                                                  */
/*                                                                            */
/******************************************************************************/


/* Bit/Fields in Register ACMIS of Module COMP                                */
#define COMP_ACMIS_IN1_B            0x00000002 // Comparator 1 Masked Interrupt
#define COMP_ACMIS_IN0_B            0x00000001 // Comparator 0 Masked Interrupt

/* Bit/Fields in Register ACRIS of Module COMP                                */
#define COMP_ACRIS_IN1_B            0x00000002 // Comparator 1 Interrupt Status
#define COMP_ACRIS_IN0_B            0x00000001 // Comparator 0 Interrupt Status

/* Bit/Fields in Register ACINTEN of Module COMP                              */
#define COMP_ACINTEN_IN1_B          0x00000002 // Comparator 1 Interrupt Enable
#define COMP_ACINTEN_IN0_B          0x00000001 // Comparator 0 Interrupt Enable

/* Bit/Fields in Register ACREFCTL of Module COMP                             */
#define COMP_ACREFCTL_EN_B          0x00000200 // Resistor Ladder Enable
#define COMP_ACREFCTL_RNG_B         0x00000100 // Resistor Ladder Range
#define COMP_ACREFCTL_VREF_M        0x0000000F // Resistor Ladder Voltage Ref
#define COMP_ACREFCTL_VREF_S        0          // Resistor Ladder Voltage Ref

/* Bit/Fields in Register ACSTAT0 of Module COMP                              */
#define COMP_ACSTAT0_OVAL_B         0x00000002 // Comparator Output Value

/* Bit/Fields in Register ACCTL0 of Module COMP                               */
#define COMP_ACCTL0_TOEN_B          0x00000800 // Trigger Output Enable
#define COMP_ACCTL0_ASRCP_M         0x00000600 // Analog Source Positive
#define COMP_ACCTL0_ASRCP_S         9          // Analog Source Positive
#define COMP_ACCTL0_ASRCP_PIN_V     0x00000000 // Pin value of Cn+
#define COMP_ACCTL0_ASRCP_PIN0_V    0x00000200 // Pin value of C0+
#define COMP_ACCTL0_ASRCP_REF_V     0x00000400 // Internal voltage reference
#define COMP_ACCTL0_TSLVAL_B        0x00000080 // Trigger Sense Level Value
#define COMP_ACCTL0_TSEN_M          0x00000060 // Trigger Sense
#define COMP_ACCTL0_TSEN_S          5          // Trigger Sense
#define COMP_ACCTL0_TSEN_LEVEL_V    0x00000000 // Level sense, see TSLVAL
#define COMP_ACCTL0_TSEN_FALL_V     0x00000020 // Falling edge
#define COMP_ACCTL0_TSEN_RISE_V     0x00000040 // Rising edge
#define COMP_ACCTL0_TSEN_BOTH_V     0x00000060 // Either edge
#define COMP_ACCTL0_ISLVAL_B        0x00000010 // Interrupt Sense Level Value
#define COMP_ACCTL0_ISEN_M          0x0000000C // Interrupt Sense
#define COMP_ACCTL0_ISEN_S          2          // Interrupt Sense
#define COMP_ACCTL0_ISEN_LEVEL_V    0x00000000 // Level sense, see ISLVAL
#define COMP_ACCTL0_ISEN_FALL_V     0x00000004 // Falling edge
#define COMP_ACCTL0_ISEN_RISE_V     0x00000008 // Rising edge
#define COMP_ACCTL0_ISEN_BOTH_V     0x0000000C // Either edge
#define COMP_ACCTL0_CINV_B          0x00000002 // Comparator Output Invert

/* Bit/Fields in Register ACSTAT1 of Module COMP                              */
#define COMP_ACSTAT1_OVAL_B         0x00000002 // Comparator Output Value

/* Bit/Fields in Register ACCTL1 of Module COMP                               */
#define COMP_ACCTL1_TOEN_B          0x00000800 // Trigger Output Enable
#define COMP_ACCTL1_ASRCP_M         0x00000600 // Analog Source Positive
#define COMP_ACCTL1_ASRCP_S         9          // Analog Source Positive
#define COMP_ACCTL1_ASRCP_PIN_V     0x00000000 // Pin value of Cn+
#define COMP_ACCTL1_ASRCP_PIN0_V    0x00000200 // Pin value of C0+
#define COMP_ACCTL1_ASRCP_REF_V     0x00000400 // Internal voltage reference
#define COMP_ACCTL1_TSLVAL_B        0x00000080 // Trigger Sense Level Value
#define COMP_ACCTL1_TSEN_M          0x00000060 // Trigger Sense
#define COMP_ACCTL1_TSEN_S          5          // Trigger Sense
#define COMP_ACCTL1_TSEN_LEVEL_V    0x00000000 // Level sense, see TSLVAL
#define COMP_ACCTL1_TSEN_FALL_V     0x00000020 // Falling edge
#define COMP_ACCTL1_TSEN_RISE_V     0x00000040 // Rising edge
#define COMP_ACCTL1_TSEN_BOTH_V     0x00000060 // Either edge
#define COMP_ACCTL1_ISLVAL_B        0x00000010 // Interrupt Sense Level Value
#define COMP_ACCTL1_ISEN_M          0x0000000C // Interrupt Sense
#define COMP_ACCTL1_ISEN_S          2          // Interrupt Sense
#define COMP_ACCTL1_ISEN_LEVEL_V    0x00000000 // Level sense, see ISLVAL
#define COMP_ACCTL1_ISEN_FALL_V     0x00000004 // Falling edge
#define COMP_ACCTL1_ISEN_RISE_V     0x00000008 // Rising edge
#define COMP_ACCTL1_ISEN_BOTH_V     0x0000000C // Either edge
#define COMP_ACCTL1_CINV_B          0x00000002 // Comparator Output Invert

/* Bit/Fields in Register PP of Module COMP                                   */
#define COMP_PP_C1O_B               0x00020000 // Comparator Output 1 Present
#define COMP_PP_C0O_B               0x00010000 // Comparator Output 0 Present
#define COMP_PP_CMP1_B              0x00000002 // Comparator 1 Present
#define COMP_PP_CMP0_B              0x00000001 // Comparator 0 Present


/******************************************************************************/
/*                                                                            */
/*                      CAN                                                   */
/*                                                                            */
/******************************************************************************/


/* Bit/Fields in Register CTL of Module CAN                                   */
#define CAN_CTL_TEST_B              0x00000080 // Test Mode Enable
#define CAN_CTL_CCE_B               0x00000040 // Configuration Change Enable
#define CAN_CTL_DAR_B               0x00000020 // Disable Automatic-Retransmission
#define CAN_CTL_EIE_B               0x00000008 // Error Interrupt Enable
#define CAN_CTL_SIE_B               0x00000004 // Status Interrupt Enable
#define CAN_CTL_IE_B                0x00000002 // CAN Interrupt Enable
#define CAN_CTL_INIT_B              0x00000001 // Initialization

