hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register STS of Module CAN                                   */
#define CAN_STS_BOFF_B              0x00000080 // Bus-Off Status
#define CAN_STS_EWARN_B             0x00000040 // Warning Status
#define CAN_STS_EPASS_B             0x00000020 // Error Passive
#define CAN_STS_RXOK_B              0x00000010 // Received a Message Successfully
#define CAN_STS_TXOK_B              0x00000008 // Transmitted a Message
#define CAN_STS_LEC_M               0x00000007 // Last Error Code
#define CAN_STS_LEC_S               0          // Last Error Code
#define CAN_STS_LEC_NONE_V          0x00000000 // No Error
#define CAN_STS_LEC_STUFF_V         0x00000001 // Stuff Error
#define CAN_STS_LEC_FORM_V          0x00000002 // Format Error
#define CAN_STS_LEC_ACK_V           0x00000003 // ACK Error
#define CAN_STS_LEC_BIT1_V          0x00000004 // Bit 1 Error
#define CAN_STS_LEC_BIT0_V          0x00000005 // Bit 0 Error
#define CAN_STS_LEC_CRC_V           0x00000006 // CRC Error
#define CAN_STS_LEC_NOEVENT_V       0x00000007 // No Event

/* Bit/Fields in Register ERR of Module CAN                                   */
#define CAN_ERR_RP_B                0x00008000 // Received Error Passive
#define CAN_ERR_REC_M               0x00007F00 // Receive Error Counter
#define CAN_ERR_REC_S               8          // Receive Error Counter
#define CAN_ERR_TEC_M               0x000000FF // Transmit Error Counter
#define CAN_ERR_TEC_S               0          // Transmit Error Counter

/* Bit/Fields in Register BIT of Module CAN                                   */
#define CAN_BIT_TSEG2_M             0x00007000 // Time Segment after Sample Point
#define CAN_BIT_TSEG2_S             12         // Time Segment after Sample Point
#define CAN_BIT_TSEG1_M             0x00000F00 // Time Segment Before Sample Point
#define CAN_BIT_TSEG1_S             8          // Time Segment Before Sample Point
#define CAN_BIT_SJW_M               0x000000C0 // (Re)Synchronization Jump Width
#define CAN_BIT_SJW_S               6          // (Re)Synchronization Jump Width
#define CAN_BIT_BRP_M               0x0000003F // Baud Rate Prescaler
#define CAN_BIT_BRP_S               0          // Baud Rate Prescaler

/* Bit/Fields in Register INT of Module CAN                                   */
#define CAN_INT_INTID_M             0x0000FFFF // Interrupt Identifier
#define CAN_INT_INTID_S             0          // Interrupt Identifier
#define CAN_INT_INTID_NONE_V        0x00000000 // No interrupt pending
#define CAN_INT_INTID_STATUS_V      0x00008000 // Status Interrupt

/* Bit/Fields in Register TST of Module CAN                                   */
#define CAN_TST_RX_B                0x00000080 // Receive Observation
#define CAN_TST_TX_M                0x00000060 // Transmit Control
#define CAN_TST_TX_S                5          // Transmit Control
#define CAN_TST_TX_CANCTL_V         0x00000000 // CAN Module Control
#define CAN_TST_TX_SAMPLE_V         0x00000020 // Sample Point
#define CAN_TST_TX_DOMINANT_V       0x00000040 // Driven Low
#define CAN_TST_TX_RECESSIVE_V      0x00000060 // Driven High
#define CAN_TST_LBACK_B             0x00000010 // Loopback Mode
#define CAN_TST_SILENT_B            0x00000008 // Silent Mode
#define CAN_TST_BASIC_B             0x00000004 // Basic Mode

/* Bit/Fields in Register BRPE of Module CAN                                  */
#define CAN_BRPE_BRPE_M             0x0000000F // Baud Rate Prescaler Extension
#define CAN_BRPE_BRPE_S             0          // Baud Rate Prescaler Extension

/* Bit/Fields in Register IF1CRQ of Module CAN                                */
#define CAN_IF1CRQ_BUSY_B           0x00008000 // Busy Flag
#define CAN_IF1CRQ_MNUM_M           0x0000003F // Message Number
#define CAN_IF1CRQ_MNUM_S           0          // Message Number

/* Bit/Fields in Register IF1CMSK of Module CAN                               */
#define CAN_IF1CMSK_WRNRD_B         0x00000080 // Write, Not Read
#define CAN_IF1CMSK_MASK_B          0x00000040 // Access Mask Bits
#define CAN_IF1CMSK_ARB_B           0x00000020 // Access Arbitration Bits
#define CAN_IF1CMSK_CONTROL_B       0x00000010 // Access Control Bits
#define CAN_IF1CMSK_CLRINTPND_B     0x00000008 // Clear Interrupt Pending Bit
#define CAN_IF1CMSK_NEWDAT_B        0x00000004 // Access New Data
#define CAN_IF1CMSK_TXRQST_B        0x00000004 // Access Transmission Request
#define CAN_IF1CMSK_DATAA_B         0x00000002 // Access Data Byte 0 to 3
#define CAN_IF1CMSK_DATAB_B         0x00000001 // Access Data Byte 4 to 7

/* Bit/Fields in Register IF1MSK1 of Module CAN                               */
#define CAN_IF1MSK1_IDMSK_M         0x0000FFFF // Identifier Mask
#define CAN_IF1MSK1_IDMSK_S         0          // Identifier Mask

/* Bit/Fields in Register IF1MSK2 of Module CAN                               */
#define CAN_IF1MSK2_MXTD_B          0x00008000 // Mask Extended Identifier
#define CAN_IF1MSK2_MDIR_B          0x00004000 // Mask Message Direction
#define CAN_IF1MSK2_IDMSK_M         0x00001FFF // Identifier Mask
#define CAN_IF1MSK2_IDMSK_S         0          // Identifier Mask

/* Bit/Fields in Register IF1ARB1 of Module CAN                               */
#define CAN_IF1ARB1_ID_M            0x0000FFFF // Message Identifier
#define CAN_IF1ARB1_ID_S            0          // Message Identifier

/* Bit/Fields in Register IF1ARB2 of Module CAN                               */
#define CAN_IF1ARB2_MSGVAL_B        0x00008000 // Message Valid
#define CAN_IF1ARB2_XTD_B           0x00004000 // Extended Identifier
#define CAN_IF1ARB2_DIR_B           0x00002000 // Message Direction
#define CAN_IF1ARB2_ID_M            0x00001FFF // Message Identifier
#define CAN_IF1ARB2_ID_S            0          // Message Identifier

/* Bit/Fields in Register IF1MCTL of Module CAN                               */
#define CAN_IF1MCTL_NEWDAT_B        0x00008000 // New Data
#define CAN_IF1MCTL_MSGLST_B        0x00004000 // Message Lost
#define CAN_IF1MCTL_INTPND_B        0x00002000 // Interrupt Pending
#define CAN_IF1MCTL_UMASK_B         0x00001000 // Use Acceptance Mask
#define CAN_IF1MCTL_TXIE_B          0x00000800 // Transmit Interrupt Enable
#define CAN_IF1MCTL_RXIE_B          0x00000400 // Receive Interrupt Enable
#define CAN_IF1MCTL_RMTEN_B         0x00000200 // Remote Enable
#define CAN_IF1MCTL_TXRQST_B        0x00000100 // Transmit Request
#define CAN_IF1MCTL_EOB_B           0x00000080 // End of Buffer
#define CAN_IF1MCTL_DLC_M           0x0000000F // Data Length Code
#define CAN_IF1MCTL_DLC_S           0          // Data Length Code

/* Bit/Fields in Register IF1DA1 of Module CAN                                */
#define CAN_IF1DA1_DATA_M           0x0000FFFF // Data
#define CAN_IF1DA1_DATA_S           0          // Data

/* Bit/Fields in Register IF1DA2 of Module CAN                                */
#define CAN_IF1DA2_DATA_M           0x0000FFFF // Data
#define CAN_IF1DA2_DATA_S           0          // Data

/* Bit/Fields in Register IF1DB1 of Module CAN                                */
#define CAN_IF1DB1_DATA_M           0x0000FFFF // Data
#define CAN_IF1DB1_DATA_S           0          // Data

/* Bit/Fields in Register IF1DB2 of Module CAN                                */
#define CAN_IF1DB2_DATA_M           0x0000FFFF // Data
#define CAN_IF1DB2_DATA_S           0          // Data

/* Bit/Fields in Register IF2CRQ of Module CAN                                */
#define CAN_IF2CRQ_BUSY_B           0x00008000 // Busy Flag
#define CAN_IF2CRQ_MNUM_M           0x0000003F // Message Number
#define CAN_IF2CRQ_MNUM_S           0          // Message Number

/* Bit/Fields in Register IF2CMSK of Module CAN                               */
#define CAN_IF2CMSK_WRNRD_B         0x00000080 // Write, Not Read
#define CAN_IF2CMSK_MASK_B          0x00000040 // Access Mask Bits
#define CAN_IF2CMSK_ARB_B           0x00000020 // Access Arbitration Bits
#define CAN_IF2CMSK_CONTROL_B       0x00000010 // Access Control Bits
#define CAN_IF2CMSK_CLRINTPND_B     0x00000008 // Clear Interrupt Pending Bit
#define CAN_IF2CMSK_NEWDAT_B        0x00000004 // Access New Data
#define CAN_IF2CMSK_TXRQST_B        0x00000004 // Access Transmission Request
#define CAN_IF2CMSK_DATAA_B         0x00000002 // Access Data Byte 0 to 3
#define CAN_IF2CMSK_DATAB_B         0x00000001 // Access Data Byte 4 to 7

