hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register IF2MSK1 of Module CAN                               */
#define CAN_IF2MSK1_IDMSK_M         0x0000FFFF // Identifier Mask
#define CAN_IF2MSK1_IDMSK_S         0          // Identifier Mask

/* Bit/Fields in Register IF2MSK2 of Module CAN                               */
#define CAN_IF2MSK2_MXTD_B          0x00008000 // Mask Extended Identifier
#define CAN_IF2MSK2_MDIR_B          0x00004000 // Mask Message Direction
#define CAN_IF2MSK2_IDMSK_M         0x00001FFF // Identifier Mask
#define CAN_IF2MSK2_IDMSK_S         0          // Identifier Mask

/* Bit/Fields in Register IF2ARB1 of Module CAN                               */
#define CAN_IF2ARB1_ID_M            0x0000FFFF // Message Identifier
#define CAN_IF2ARB1_ID_S            0          // Message Identifier

/* Bit/Fields in Register IF2ARB2 of Module CAN                               */
#define CAN_IF2ARB2_MSGVAL_B        0x00008000 // Message Valid
#define CAN_IF2ARB2_XTD_B           0x00004000 // Extended Identifier
#define CAN_IF2ARB2_DIR_B           0x00002000 // Message Direction
#define CAN_IF2ARB2_ID_M            0x00001FFF // Message Identifier
#define CAN_IF2ARB2_ID_S            0          // Message Identifier

/* Bit/Fields in Register IF2MCTL of Module CAN                               */
#define CAN_IF2MCTL_NEWDAT_B        0x00008000 // New Data
#define CAN_IF2MCTL_MSGLST_B        0x00004000 // Message Lost
#define CAN_IF2MCTL_INTPND_B        0x00002000 // Interrupt Pending
#define CAN_IF2MCTL_UMASK_B         0x00001000 // Use Acceptance Mask
#define CAN_IF2MCTL_TXIE_B          0x00000800 // Transmit Interrupt Enable
#define CAN_IF2MCTL_RXIE_B          0x00000400 // Receive Interrupt Enable
#define CAN_IF2MCTL_RMTEN_B         0x00000200 // Remote Enable
#define CAN_IF2MCTL_TXRQST_B        0x00000100 // Transmit Request
#define CAN_IF2MCTL_EOB_B           0x00000080 // End of Buffer
#define CAN_IF2MCTL_DLC_M           0x0000000F // Data Length Code
#define CAN_IF2MCTL_DLC_S           0          // Data Length Code

/* Bit/Fields in Register IF2DA1 of Module CAN                                */
#define CAN_IF2DA1_DATA_M           0x0000FFFF // Data
#define CAN_IF2DA1_DATA_S           0          // Data

/* Bit/Fields in Register IF2DA2 of Module CAN                                */
#define CAN_IF2DA2_DATA_M           0x0000FFFF // Data
#define CAN_IF2DA2_DATA_S           0          // Data

/* Bit/Fields in Register IF2DB1 of Module CAN                                */
#define CAN_IF2DB1_DATA_M           0x0000FFFF // Data
#define CAN_IF2DB1_DATA_S           0          // Data

/* Bit/Fields in Register IF2DB2 of Module CAN                                */
#define CAN_IF2DB2_DATA_M           0x0000FFFF // Data
#define CAN_IF2DB2_DATA_S           0          // Data

/* Bit/Fields in Register TXRQ1 of Module CAN                                 */
#define CAN_TXRQ1_TXRQST_M          0x0000FFFF // Transmission Request Bits
#define CAN_TXRQ1_TXRQST_S          0          // Transmission Request Bits

/* Bit/Fields in Register TXRQ2 of Module CAN                                 */
#define CAN_TXRQ2_TXRQST_M          0x0000FFFF // Transmission Request Bits
#define CAN_TXRQ2_TXRQST_S          0          // Transmission Request Bits

/* Bit/Fields in Register NWDA1 of Module CAN                                 */
#define CAN_NWDA1_NEWDAT_M          0x0000FFFF // New Data Bits
#define CAN_NWDA1_NEWDAT_S          0          // New Data Bits

/* Bit/Fields in Register NWDA2 of Module CAN                                 */
#define CAN_NWDA2_NEWDAT_M          0x0000FFFF // New Data Bits
#define CAN_NWDA2_NEWDAT_S          0          // New Data Bits

/* Bit/Fields in Register MSG1INT of Module CAN                               */
#define CAN_MSG1INT_INTPND_M        0x0000FFFF // Interrupt Pending Bits
#define CAN_MSG1INT_INTPND_S        0          // Interrupt Pending Bits

/* Bit/Fields in Register MSG2INT of Module CAN                               */
#define CAN_MSG2INT_INTPND_M        0x0000FFFF // Interrupt Pending Bits
#define CAN_MSG2INT_INTPND_S        0          // Interrupt Pending Bits

/* Bit/Fields in Register MSG1VAL of Module CAN                               */
#define CAN_MSG1VAL_MSGVAL_M        0x0000FFFF // Message Valid Bits
#define CAN_MSG1VAL_MSGVAL_S        0          // Message Valid Bits

/* Bit/Fields in Register MSG2VAL of Module CAN                               */
#define CAN_MSG2VAL_MSGVAL_M        0x0000FFFF // Message Valid Bits
#define CAN_MSG2VAL_MSGVAL_S        0          // Message Valid Bits


/******************************************************************************/
/*                                                                            */
/*                      USB                                                   */
/*                                                                            */
/******************************************************************************/


/* Bit/Fields in Register FADDR of Module USB                                 */
#define USB_FADDR_M                 0x0000007F // Function Address
#define USB_FADDR_S                 0          // Function Address

/* Bit/Fields in Register POWER of Module USB                                 */
#define USB_POWER_ISOUP_B           0x00000080 // Isochronous Update
#define USB_POWER_SOFTCONN_B        0x00000040 // Soft Connect/Disconnect
#define USB_POWER_RESET_B           0x00000008 // RESET Signaling
#define USB_POWER_RESUME_B          0x00000004 // RESUME Signaling
#define USB_POWER_SUSPEND_B         0x00000002 // SUSPEND Mode
#define USB_POWER_PWRDNPHY_B        0x00000001 // Power Down PHY

/* Bit/Fields in Register TXIS of Module USB                                  */
#define USB_TXIS_EP7_B              0x00000080 // TX Endpoint 7 Interrupt
#define USB_TXIS_EP6_B              0x00000040 // TX Endpoint 6 Interrupt
#define USB_TXIS_EP5_B              0x00000020 // TX Endpoint 5 Interrupt
#define USB_TXIS_EP4_B              0x00000010 // TX Endpoint 4 Interrupt
#define USB_TXIS_EP3_B              0x00000008 // TX Endpoint 3 Interrupt
#define USB_TXIS_EP2_B              0x00000004 // TX Endpoint 2 Interrupt
#define USB_TXIS_EP1_B              0x00000002 // TX Endpoint 1 Interrupt
#define USB_TXIS_EP0_B              0x00000001 // TX and RX Endpoint 0 Interrupt

/* Bit/Fields in Register RXIS of Module USB                                  */
#define USB_RXIS_EP7_B              0x00000080 // RX Endpoint 7 Interrupt
#define USB_RXIS_EP6_B              0x00000040 // RX Endpoint 6 Interrupt
#define USB_RXIS_EP5_B              0x00000020 // RX Endpoint 5 Interrupt
#define USB_RXIS_EP4_B              0x00000010 // RX Endpoint 4 Interrupt
#define USB_RXIS_EP3_B              0x00000008 // RX Endpoint 3 Interrupt
#define USB_RXIS_EP2_B              0x00000004 // RX Endpoint 2 Interrupt
#define USB_RXIS_EP1_B              0x00000002 // RX Endpoint 1 Interrupt

/* Bit/Fields in Register TXIE of Module USB                                  */
#define USB_TXIE_EP7_B              0x00000080 // TX Endpoint 7 Interrupt Enable
#define USB_TXIE_EP6_B              0x00000040 // TX Endpoint 6 Interrupt Enable
#define USB_TXIE_EP5_B              0x00000020 // TX Endpoint 5 Interrupt Enable
#define USB_TXIE_EP4_B              0x00000010 // TX Endpoint 4 Interrupt Enable
#define USB_TXIE_EP3_B              0x00000008 // TX Endpoint 3 Interrupt Enable
#define USB_TXIE_EP2_B              0x00000004 // TX Endpoint 2 Interrupt Enable
#define USB_TXIE_EP1_B              0x00000002 // TX Endpoint 1 Interrupt Enable
#define USB_TXIE_EP0_B              0x00000001 // TX and RX Endpoint 0 Interrupt

/* Bit/Fields in Register RXIE of Module USB                                  */
#define USB_RXIE_EP7_B              0x00000080 // RX Endpoint 7 Interrupt Enable
#define USB_RXIE_EP6_B              0x00000040 // RX Endpoint 6 Interrupt Enable
#define USB_RXIE_EP5_B              0x00000020 // RX Endpoint 5 Interrupt Enable
#define USB_RXIE_EP4_B              0x00000010 // RX Endpoint 4 Interrupt Enable
#define USB_RXIE_EP3_B              0x00000008 // RX Endpoint 3 Interrupt Enable
#define USB_RXIE_EP2_B              0x00000004 // RX Endpoint 2 Interrupt Enable
#define USB_RXIE_EP1_B              0x00000002 // RX Endpoint 1 Interrupt Enable

/* Bit/Fields in Register IS of Module USB                                    */
#define USB_IS_VBUSERR_B            0x00000080 // VBUS Error (OTG only)
#define USB_IS_SESREQ_B             0x00000040 // SESSION REQUEST (OTG only)
#define USB_IS_DISCON_B             0x00000020 // Session Disconnect (OTG only)
#define USB_IS_CONN_B               0x00000010 // Session Connect
#define USB_IS_SOF_B                0x00000008 // Start of Frame
#define USB_IS_BABBLE_B             0x00000004 // Babble Detected
#define USB_IS_RESET_B              0x00000004 // RESET Signaling Detected
#define USB_IS_RESUME_B             0x00000002 // RESUME Signaling Detected
#define USB_IS_SUSPEND_B            0x00000001 // SUSPEND Signaling Detected

/* Bit/Fields in Register IE of Module USB                                    */
#define USB_IE_VBUSERR_B            0x00000080 // Enable VBUS Error Interrupt (OTG
#define USB_IE_SESREQ_B             0x00000040 // Enable Session Request (OTG
#define USB_IE_DISCON_B             0x00000020 // Enable Disconnect Interrupt
#define USB_IE_CONN_B               0x00000010 // Enable Connect Interrupt
#define USB_IE_SOF_B                0x00000008 // Enable Start-of-Frame Interrupt
#define USB_IE_BABBLE_B             0x00000004 // Enable Babble Interrupt
#define USB_IE_RESET_B              0x00000004 // Enable RESET Interrupt
#define USB_IE_RESUME_B             0x00000002 // Enable RESUME Interrupt
#define USB_IE_SUSPND_B             0x00000001 // Enable SUSPEND Interrupt

/* Bit/Fields in Register FRAME of Module USB                                 */
#define USB_FRAME_M                 0x000007FF // Frame Number
#define USB_FRAME_S                 0          // Frame Number

/* Bit/Fields in Register EPIDX of Module USB                                 */
#define USB_EPIDX_EPIDX_M           0x0000000F // Endpoint Index
#define USB_EPIDX_EPIDX_S           0          // Endpoint Index

