hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register TEST of Module USB                                  */
#define USB_TEST_FORCEH_B           0x00000080 // Force Host Mode
#define USB_TEST_FIFOACC_B          0x00000040 // FIFO Access
#define USB_TEST_FORCEFS_B          0x00000020 // Force Full-Speed Mode

/* Bit/Fields in Register FIFO0 of Module USB                                 */
#define USB_FIFO0_EPDATA_M          0xFFFFFFFF // Endpoint Data
#define USB_FIFO0_EPDATA_S          0          // Endpoint Data

/* Bit/Fields in Register FIFO1 of Module USB                                 */
#define USB_FIFO1_EPDATA_M          0xFFFFFFFF // Endpoint Data
#define USB_FIFO1_EPDATA_S          0          // Endpoint Data

/* Bit/Fields in Register FIFO2 of Module USB                                 */
#define USB_FIFO2_EPDATA_M          0xFFFFFFFF // Endpoint Data
#define USB_FIFO2_EPDATA_S          0          // Endpoint Data

/* Bit/Fields in Register FIFO3 of Module USB                                 */
#define USB_FIFO3_EPDATA_M          0xFFFFFFFF // Endpoint Data
#define USB_FIFO3_EPDATA_S          0          // Endpoint Data

/* Bit/Fields in Register FIFO4 of Module USB                                 */
#define USB_FIFO4_EPDATA_M          0xFFFFFFFF // Endpoint Data
#define USB_FIFO4_EPDATA_S          0          // Endpoint Data

/* Bit/Fields in Register FIFO5 of Module USB                                 */
#define USB_FIFO5_EPDATA_M          0xFFFFFFFF // Endpoint Data
#define USB_FIFO5_EPDATA_S          0          // Endpoint Data

/* Bit/Fields in Register FIFO6 of Module USB                                 */
#define USB_FIFO6_EPDATA_M          0xFFFFFFFF // Endpoint Data
#define USB_FIFO6_EPDATA_S          0          // Endpoint Data

/* Bit/Fields in Register FIFO7 of Module USB                                 */
#define USB_FIFO7_EPDATA_M          0xFFFFFFFF // Endpoint Data
#define USB_FIFO7_EPDATA_S          0          // Endpoint Data

/* Bit/Fields in Register DEVCTL of Module USB                                */
#define USB_DEVCTL_DEV_B            0x00000080 // Device Mode (OTG only)
#define USB_DEVCTL_FSDEV_B          0x00000040 // Full-Speed Device Detected
#define USB_DEVCTL_LSDEV_B          0x00000020 // Low-Speed Device Detected
#define USB_DEVCTL_VBUS_M           0x00000018 // VBUS Level (OTG only)
#define USB_DEVCTL_VBUS_S           3          // VBUS Level (OTG only)
#define USB_DEVCTL_VBUS_NONE_V      0x00000000 // Below SessionEnd
#define USB_DEVCTL_VBUS_SEND_V      0x00000008 // Above SessionEnd, below AValid
#define USB_DEVCTL_VBUS_AVALID_V    0x00000010 // Above AValid, below VBUSValid
#define USB_DEVCTL_VBUS_VALID_V     0x00000018 // Above VBUSValid
#define USB_DEVCTL_HOST_B           0x00000004 // Host Mode
#define USB_DEVCTL_HOSTREQ_B        0x00000002 // Host Request (OTG only)
#define USB_DEVCTL_SESSION_B        0x00000001 // Session Start/End (OTG only)

/* Bit/Fields in Register TXFIFOSZ of Module USB                              */
#define USB_TXFIFOSZ_DPB_B          0x00000010 // Double Packet Buffer Support
#define USB_TXFIFOSZ_SIZE_M         0x0000000F // Max Packet Size
#define USB_TXFIFOSZ_SIZE_S         0          // Max Packet Size
#define USB_TXFIFOSZ_SIZE_8_V       0x00000000 // 8
#define USB_TXFIFOSZ_SIZE_16_V      0x00000001 // 16
#define USB_TXFIFOSZ_SIZE_32_V      0x00000002 // 32
#define USB_TXFIFOSZ_SIZE_64_V      0x00000003 // 64
#define USB_TXFIFOSZ_SIZE_128_V     0x00000004 // 128
#define USB_TXFIFOSZ_SIZE_256_V     0x00000005 // 256
#define USB_TXFIFOSZ_SIZE_512_V     0x00000006 // 512
#define USB_TXFIFOSZ_SIZE_1024_V    0x00000007 // 1024
#define USB_TXFIFOSZ_SIZE_2048_V    0x00000008 // 2048

/* Bit/Fields in Register RXFIFOSZ of Module USB                              */
#define USB_RXFIFOSZ_DPB_B          0x00000010 // Double Packet Buffer Support
#define USB_RXFIFOSZ_SIZE_M         0x0000000F // Max Packet Size
#define USB_RXFIFOSZ_SIZE_S         0          // Max Packet Size
#define USB_RXFIFOSZ_SIZE_8_V       0x00000000 // 8
#define USB_RXFIFOSZ_SIZE_16_V      0x00000001 // 16
#define USB_RXFIFOSZ_SIZE_32_V      0x00000002 // 32
#define USB_RXFIFOSZ_SIZE_64_V      0x00000003 // 64
#define USB_RXFIFOSZ_SIZE_128_V     0x00000004 // 128
#define USB_RXFIFOSZ_SIZE_256_V     0x00000005 // 256
#define USB_RXFIFOSZ_SIZE_512_V     0x00000006 // 512
#define USB_RXFIFOSZ_SIZE_1024_V    0x00000007 // 1024
#define USB_RXFIFOSZ_SIZE_2048_V    0x00000008 // 2048

/* Bit/Fields in Register TXFIFOADD of Module USB                             */
#define USB_TXFIFOADD_ADDR_M        0x000001FF // Transmit/Receive Start Address
#define USB_TXFIFOADD_ADDR_S        0          // Transmit/Receive Start Address

/* Bit/Fields in Register RXFIFOADD of Module USB                             */
#define USB_RXFIFOADD_ADDR_M        0x000001FF // Transmit/Receive Start Address
#define USB_RXFIFOADD_ADDR_S        0          // Transmit/Receive Start Address

/* Bit/Fields in Register CONTIM of Module USB                                */
#define USB_CONTIM_WTCON_M          0x000000F0 // Connect Wait
#define USB_CONTIM_WTCON_S          4          // Connect Wait
#define USB_CONTIM_WTID_M           0x0000000F // Wait ID
#define USB_CONTIM_WTID_S           0          // Wait ID

/* Bit/Fields in Register VPLEN of Module USB                                 */
#define USB_VPLEN_VPLEN_M           0x000000FF // VBUS Pulse Length
#define USB_VPLEN_VPLEN_S           0          // VBUS Pulse Length

/* Bit/Fields in Register FSEOF of Module USB                                 */
#define USB_FSEOF_FSEOFG_M          0x000000FF // Full-Speed End-of-Frame Gap
#define USB_FSEOF_FSEOFG_S          0          // Full-Speed End-of-Frame Gap

/* Bit/Fields in Register LSEOF of Module USB                                 */
#define USB_LSEOF_LSEOFG_M          0x000000FF // Low-Speed End-of-Frame Gap
#define USB_LSEOF_LSEOFG_S          0          // Low-Speed End-of-Frame Gap

/* Bit/Fields in Register TXFUNCADDR0 of Module USB                           */
#define USB_TXFUNCADDR0_ADDR_M      0x0000007F // Device Address
#define USB_TXFUNCADDR0_ADDR_S      0          // Device Address

