hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register TXHUBADDR0 of Module USB                            */
#define USB_TXHUBADDR0_ADDR_M       0x0000007F // Hub Address
#define USB_TXHUBADDR0_ADDR_S       0          // Hub Address

/* Bit/Fields in Register TXHUBPORT0 of Module USB                            */
#define USB_TXHUBPORT0_PORT_M       0x0000007F // Hub Port
#define USB_TXHUBPORT0_PORT_S       0          // Hub Port

/* Bit/Fields in Register TXFUNCADDR1 of Module USB                           */
#define USB_TXFUNCADDR1_ADDR_M      0x0000007F // Device Address
#define USB_TXFUNCADDR1_ADDR_S      0          // Device Address

/* Bit/Fields in Register TXHUBADDR1 of Module USB                            */
#define USB_TXHUBADDR1_ADDR_M       0x0000007F // Hub Address
#define USB_TXHUBADDR1_ADDR_S       0          // Hub Address

/* Bit/Fields in Register TXHUBPORT1 of Module USB                            */
#define USB_TXHUBPORT1_PORT_M       0x0000007F // Hub Port
#define USB_TXHUBPORT1_PORT_S       0          // Hub Port

/* Bit/Fields in Register RXFUNCADDR1 of Module USB                           */
#define USB_RXFUNCADDR1_ADDR_M      0x0000007F // Device Address
#define USB_RXFUNCADDR1_ADDR_S      0          // Device Address

/* Bit/Fields in Register RXHUBADDR1 of Module USB                            */
#define USB_RXHUBADDR1_ADDR_M       0x0000007F // Hub Address
#define USB_RXHUBADDR1_ADDR_S       0          // Hub Address

/* Bit/Fields in Register RXHUBPORT1 of Module USB                            */
#define USB_RXHUBPORT1_PORT_M       0x0000007F // Hub Port
#define USB_RXHUBPORT1_PORT_S       0          // Hub Port

/* Bit/Fields in Register TXFUNCADDR2 of Module USB                           */
#define USB_TXFUNCADDR2_ADDR_M      0x0000007F // Device Address
#define USB_TXFUNCADDR2_ADDR_S      0          // Device Address

/* Bit/Fields in Register TXHUBADDR2 of Module USB                            */
#define USB_TXHUBADDR2_ADDR_M       0x0000007F // Hub Address
#define USB_TXHUBADDR2_ADDR_S       0          // Hub Address

/* Bit/Fields in Register TXHUBPORT2 of Module USB                            */
#define USB_TXHUBPORT2_PORT_M       0x0000007F // Hub Port
#define USB_TXHUBPORT2_PORT_S       0          // Hub Port

/* Bit/Fields in Register RXFUNCADDR2 of Module USB                           */
#define USB_RXFUNCADDR2_ADDR_M      0x0000007F // Device Address
#define USB_RXFUNCADDR2_ADDR_S      0          // Device Address

/* Bit/Fields in Register RXHUBADDR2 of Module USB                            */
#define USB_RXHUBADDR2_ADDR_M       0x0000007F // Hub Address
#define USB_RXHUBADDR2_ADDR_S       0          // Hub Address

/* Bit/Fields in Register RXHUBPORT2 of Module USB                            */
#define USB_RXHUBPORT2_PORT_M       0x0000007F // Hub Port
#define USB_RXHUBPORT2_PORT_S       0          // Hub Port

/* Bit/Fields in Register TXFUNCADDR3 of Module USB                           */
#define USB_TXFUNCADDR3_ADDR_M      0x0000007F // Device Address
#define USB_TXFUNCADDR3_ADDR_S      0          // Device Address

/* Bit/Fields in Register TXHUBADDR3 of Module USB                            */
#define USB_TXHUBADDR3_ADDR_M       0x0000007F // Hub Address
#define USB_TXHUBADDR3_ADDR_S       0          // Hub Address

/* Bit/Fields in Register TXHUBPORT3 of Module USB                            */
#define USB_TXHUBPORT3_PORT_M       0x0000007F // Hub Port
#define USB_TXHUBPORT3_PORT_S       0          // Hub Port

/* Bit/Fields in Register RXFUNCADDR3 of Module USB                           */
#define USB_RXFUNCADDR3_ADDR_M      0x0000007F // Device Address
#define USB_RXFUNCADDR3_ADDR_S      0          // Device Address

/* Bit/Fields in Register RXHUBADDR3 of Module USB                            */
#define USB_RXHUBADDR3_ADDR_M       0x0000007F // Hub Address
#define USB_RXHUBADDR3_ADDR_S       0          // Hub Address

/* Bit/Fields in Register RXHUBPORT3 of Module USB                            */
#define USB_RXHUBPORT3_PORT_M       0x0000007F // Hub Port
#define USB_RXHUBPORT3_PORT_S       0          // Hub Port

/* Bit/Fields in Register TXFUNCADDR4 of Module USB                           */
#define USB_TXFUNCADDR4_ADDR_M      0x0000007F // Device Address
#define USB_TXFUNCADDR4_ADDR_S      0          // Device Address

/* Bit/Fields in Register TXHUBADDR4 of Module USB                            */
#define USB_TXHUBADDR4_ADDR_M       0x0000007F // Hub Address
#define USB_TXHUBADDR4_ADDR_S       0          // Hub Address

/* Bit/Fields in Register TXHUBPORT4 of Module USB                            */
#define USB_TXHUBPORT4_PORT_M       0x0000007F // Hub Port
#define USB_TXHUBPORT4_PORT_S       0          // Hub Port

/* Bit/Fields in Register RXFUNCADDR4 of Module USB                           */
#define USB_RXFUNCADDR4_ADDR_M      0x0000007F // Device Address
#define USB_RXFUNCADDR4_ADDR_S      0          // Device Address

/* Bit/Fields in Register RXHUBADDR4 of Module USB                            */
#define USB_RXHUBADDR4_ADDR_M       0x0000007F // Hub Address
#define USB_RXHUBADDR4_ADDR_S       0          // Hub Address

/* Bit/Fields in Register RXHUBPORT4 of Module USB                            */
#define USB_RXHUBPORT4_PORT_M       0x0000007F // Hub Port
#define USB_RXHUBPORT4_PORT_S       0          // Hub Port

/* Bit/Fields in Register TXFUNCADDR5 of Module USB                           */
#define USB_TXFUNCADDR5_ADDR_M      0x0000007F // Device Address
#define USB_TXFUNCADDR5_ADDR_S      0          // Device Address

/* Bit/Fields in Register TXHUBADDR5 of Module USB                            */
#define USB_TXHUBADDR5_ADDR_M       0x0000007F // Hub Address
#define USB_TXHUBADDR5_ADDR_S       0          // Hub Address

/* Bit/Fields in Register TXHUBPORT5 of Module USB                            */
#define USB_TXHUBPORT5_PORT_M       0x0000007F // Hub Port
#define USB_TXHUBPORT5_PORT_S       0          // Hub Port

/* Bit/Fields in Register RXFUNCADDR5 of Module USB                           */
#define USB_RXFUNCADDR5_ADDR_M      0x0000007F // Device Address
#define USB_RXFUNCADDR5_ADDR_S      0          // Device Address

/* Bit/Fields in Register RXHUBADDR5 of Module USB                            */
#define USB_RXHUBADDR5_ADDR_M       0x0000007F // Hub Address
#define USB_RXHUBADDR5_ADDR_S       0          // Hub Address

/* Bit/Fields in Register RXHUBPORT5 of Module USB                            */
#define USB_RXHUBPORT5_PORT_M       0x0000007F // Hub Port
#define USB_RXHUBPORT5_PORT_S       0          // Hub Port

/* Bit/Fields in Register TXFUNCADDR6 of Module USB                           */
#define USB_TXFUNCADDR6_ADDR_M      0x0000007F // Device Address
#define USB_TXFUNCADDR6_ADDR_S      0          // Device Address

/* Bit/Fields in Register TXHUBADDR6 of Module USB                            */
#define USB_TXHUBADDR6_ADDR_M       0x0000007F // Hub Address
#define USB_TXHUBADDR6_ADDR_S       0          // Hub Address

