hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register TXHUBPORT6 of Module USB                            */
#define USB_TXHUBPORT6_PORT_M       0x0000007F // Hub Port
#define USB_TXHUBPORT6_PORT_S       0          // Hub Port

/* Bit/Fields in Register RXFUNCADDR6 of Module USB                           */
#define USB_RXFUNCADDR6_ADDR_M      0x0000007F // Device Address
#define USB_RXFUNCADDR6_ADDR_S      0          // Device Address

/* Bit/Fields in Register RXHUBADDR6 of Module USB                            */
#define USB_RXHUBADDR6_ADDR_M       0x0000007F // Hub Address
#define USB_RXHUBADDR6_ADDR_S       0          // Hub Address

/* Bit/Fields in Register RXHUBPORT6 of Module USB                            */
#define USB_RXHUBPORT6_PORT_M       0x0000007F // Hub Port
#define USB_RXHUBPORT6_PORT_S       0          // Hub Port

/* Bit/Fields in Register TXFUNCADDR7 of Module USB                           */
#define USB_TXFUNCADDR7_ADDR_M      0x0000007F // Device Address
#define USB_TXFUNCADDR7_ADDR_S      0          // Device Address

/* Bit/Fields in Register TXHUBADDR7 of Module USB                            */
#define USB_TXHUBADDR7_ADDR_M       0x0000007F // Hub Address
#define USB_TXHUBADDR7_ADDR_S       0          // Hub Address

/* Bit/Fields in Register TXHUBPORT7 of Module USB                            */
#define USB_TXHUBPORT7_PORT_M       0x0000007F // Hub Port
#define USB_TXHUBPORT7_PORT_S       0          // Hub Port

/* Bit/Fields in Register RXFUNCADDR7 of Module USB                           */
#define USB_RXFUNCADDR7_ADDR_M      0x0000007F // Device Address
#define USB_RXFUNCADDR7_ADDR_S      0          // Device Address

/* Bit/Fields in Register RXHUBADDR7 of Module USB                            */
#define USB_RXHUBADDR7_ADDR_M       0x0000007F // Hub Address
#define USB_RXHUBADDR7_ADDR_S       0          // Hub Address

/* Bit/Fields in Register RXHUBPORT7 of Module USB                            */
#define USB_RXHUBPORT7_PORT_M       0x0000007F // Hub Port
#define USB_RXHUBPORT7_PORT_S       0          // Hub Port

/* Bit/Fields in Register CSRL0 of Module USB                                 */
#define USB_CSRL0_NAKTO_B           0x00000080 // NAK Timeout
#define USB_CSRL0_SETENDC_B         0x00000080 // Setup End Clear
#define USB_CSRL0_STATUS_B          0x00000040 // STATUS Packet
#define USB_CSRL0_RXRDYC_B          0x00000040 // RXRDY Clear
#define USB_CSRL0_REQPKT_B          0x00000020 // Request Packet
#define USB_CSRL0_STALL_B           0x00000020 // Send Stall
#define USB_CSRL0_SETEND_B          0x00000010 // Setup End
#define USB_CSRL0_ERROR_B           0x00000010 // Error
#define USB_CSRL0_DATAEND_B         0x00000008 // Data End
#define USB_CSRL0_SETUP_B           0x00000008 // Setup Packet
#define USB_CSRL0_STALLED_B         0x00000004 // Endpoint Stalled
#define USB_CSRL0_TXRDY_B           0x00000002 // Transmit Packet Ready
#define USB_CSRL0_RXRDY_B           0x00000001 // Receive Packet Ready

/* Bit/Fields in Register CSRH0 of Module USB                                 */
#define USB_CSRH0_DTWE_B            0x00000004 // Data Toggle Write Enable
#define USB_CSRH0_DT_B              0x00000002 // Data Toggle
#define USB_CSRH0_FLUSH_B           0x00000001 // Flush FIFO

/* Bit/Fields in Register COUNT0 of Module USB                                */
#define USB_COUNT0_COUNT_M          0x0000007F // FIFO Count
#define USB_COUNT0_COUNT_S          0          // FIFO Count

/* Bit/Fields in Register TYPE0 of Module USB                                 */
#define USB_TYPE0_SPEED_M           0x000000C0 // Operating Speed
#define USB_TYPE0_SPEED_S           6          // Operating Speed
#define USB_TYPE0_SPEED_FULL_V      0x00000080 // Full
#define USB_TYPE0_SPEED_LOW_V       0x000000C0 // Low

/* Bit/Fields in Register NAKLMT of Module USB                                */
#define USB_NAKLMT_NAKLMT_M         0x0000001F // EP0 NAK Limit
#define USB_NAKLMT_NAKLMT_S         0          // EP0 NAK Limit

/* Bit/Fields in Register TXMAXP1 of Module USB                               */
#define USB_TXMAXP1_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_TXMAXP1_MAXLOAD_S       0          // Maximum Payload

/* Bit/Fields in Register TXCSRL1 of Module USB                               */
#define USB_TXCSRL1_NAKTO_B         0x00000080 // NAK Timeout
#define USB_TXCSRL1_CLRDT_B         0x00000040 // Clear Data Toggle
#define USB_TXCSRL1_STALLED_B       0x00000020 // Endpoint Stalled
#define USB_TXCSRL1_STALL_B         0x00000010 // Send STALL
#define USB_TXCSRL1_SETUP_B         0x00000010 // Setup Packet
#define USB_TXCSRL1_FLUSH_B         0x00000008 // Flush FIFO
#define USB_TXCSRL1_ERROR_B         0x00000004 // Error
#define USB_TXCSRL1_UNDRN_B         0x00000004 // Underrun
#define USB_TXCSRL1_FIFONE_B        0x00000002 // FIFO Not Empty
#define USB_TXCSRL1_TXRDY_B         0x00000001 // Transmit Packet Ready

/* Bit/Fields in Register TXCSRH1 of Module USB                               */
#define USB_TXCSRH1_AUTOSET_B       0x00000080 // Auto Set
#define USB_TXCSRH1_ISO_B           0x00000040 // Isochronous Transfers
#define USB_TXCSRH1_MODE_B          0x00000020 // Mode
#define USB_TXCSRH1_DMAEN_B         0x00000010 // DMA Request Enable
#define USB_TXCSRH1_FDT_B           0x00000008 // Force Data Toggle
#define USB_TXCSRH1_DMAMOD_B        0x00000004 // DMA Request Mode
#define USB_TXCSRH1_DTWE_B          0x00000002 // Data Toggle Write Enable
#define USB_TXCSRH1_DT_B            0x00000001 // Data Toggle

/* Bit/Fields in Register RXMAXP1 of Module USB                               */
#define USB_RXMAXP1_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_RXMAXP1_MAXLOAD_S       0          // Maximum Payload

/* Bit/Fields in Register RXCSRL1 of Module USB                               */
#define USB_RXCSRL1_CLRDT_B         0x00000080 // Clear Data Toggle
#define USB_RXCSRL1_STALLED_B       0x00000040 // Endpoint Stalled
#define USB_RXCSRL1_STALL_B         0x00000020 // Send STALL
#define USB_RXCSRL1_REQPKT_B        0x00000020 // Request Packet
#define USB_RXCSRL1_FLUSH_B         0x00000010 // Flush FIFO
#define USB_RXCSRL1_DATAERR_B       0x00000008 // Data Error
#define USB_RXCSRL1_NAKTO_B         0x00000008 // NAK Timeout
#define USB_RXCSRL1_OVER_B          0x00000004 // Overrun
#define USB_RXCSRL1_ERROR_B         0x00000004 // Error
#define USB_RXCSRL1_FULL_B          0x00000002 // FIFO Full
#define USB_RXCSRL1_RXRDY_B         0x00000001 // Receive Packet Ready

