hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register RXCSRH1 of Module USB                               */
#define USB_RXCSRH1_AUTOCL_B        0x00000080 // Auto Clear
#define USB_RXCSRH1_AUTORQ_B        0x00000040 // Auto Request
#define USB_RXCSRH1_ISO_B           0x00000040 // Isochronous Transfers
#define USB_RXCSRH1_DMAEN_B         0x00000020 // DMA Request Enable
#define USB_RXCSRH1_DISNYET_B       0x00000010 // Disable NYET
#define USB_RXCSRH1_PIDERR_B        0x00000010 // PID Error
#define USB_RXCSRH1_DMAMOD_B        0x00000008 // DMA Request Mode
#define USB_RXCSRH1_DTWE_B          0x00000004 // Data Toggle Write Enable
#define USB_RXCSRH1_DT_B            0x00000002 // Data Toggle

/* Bit/Fields in Register RXCOUNT1 of Module USB                              */
#define USB_RXCOUNT1_COUNT_M        0x00001FFF // Receive Packet Count
#define USB_RXCOUNT1_COUNT_S        0          // Receive Packet Count

/* Bit/Fields in Register TXTYPE1 of Module USB                               */
#define USB_TXTYPE1_SPEED_M         0x000000C0 // Operating Speed
#define USB_TXTYPE1_SPEED_S         6          // Operating Speed
#define USB_TXTYPE1_SPEED_DFLT_V    0x00000000 // Default
#define USB_TXTYPE1_SPEED_FULL_V    0x00000080 // Full
#define USB_TXTYPE1_SPEED_LOW_V     0x000000C0 // Low
#define USB_TXTYPE1_PROTO_M         0x00000030 // Protocol
#define USB_TXTYPE1_PROTO_S         4          // Protocol
#define USB_TXTYPE1_PROTO_CTRL_V    0x00000000 // Control
#define USB_TXTYPE1_PROTO_ISOC_V    0x00000010 // Isochronous
#define USB_TXTYPE1_PROTO_BULK_V    0x00000020 // Bulk
#define USB_TXTYPE1_PROTO_INT_V     0x00000030 // Interrupt
#define USB_TXTYPE1_TEP_M           0x0000000F // Target Endpoint Number
#define USB_TXTYPE1_TEP_S           0          // Target Endpoint Number

/* Bit/Fields in Register RXTYPE1 of Module USB                               */
#define USB_RXTYPE1_SPEED_M         0x000000C0 // Operating Speed
#define USB_RXTYPE1_SPEED_S         6          // Operating Speed
#define USB_RXTYPE1_SPEED_DFLT_V    0x00000000 // Default
#define USB_RXTYPE1_SPEED_FULL_V    0x00000080 // Full
#define USB_RXTYPE1_SPEED_LOW_V     0x000000C0 // Low
#define USB_RXTYPE1_PROTO_M         0x00000030 // Protocol
#define USB_RXTYPE1_PROTO_S         4          // Protocol
#define USB_RXTYPE1_PROTO_CTRL_V    0x00000000 // Control
#define USB_RXTYPE1_PROTO_ISOC_V    0x00000010 // Isochronous
#define USB_RXTYPE1_PROTO_BULK_V    0x00000020 // Bulk
#define USB_RXTYPE1_PROTO_INT_V     0x00000030 // Interrupt
#define USB_RXTYPE1_TEP_M           0x0000000F // Target Endpoint Number
#define USB_RXTYPE1_TEP_S           0          // Target Endpoint Number

/* Bit/Fields in Register TXMAXP2 of Module USB                               */
#define USB_TXMAXP2_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_TXMAXP2_MAXLOAD_S       0          // Maximum Payload

/* Bit/Fields in Register TXCSRL2 of Module USB                               */
#define USB_TXCSRL2_NAKTO_B         0x00000080 // NAK Timeout
#define USB_TXCSRL2_CLRDT_B         0x00000040 // Clear Data Toggle
#define USB_TXCSRL2_STALLED_B       0x00000020 // Endpoint Stalled
#define USB_TXCSRL2_SETUP_B         0x00000010 // Setup Packet
#define USB_TXCSRL2_STALL_B         0x00000010 // Send STALL
#define USB_TXCSRL2_FLUSH_B         0x00000008 // Flush FIFO
#define USB_TXCSRL2_ERROR_B         0x00000004 // Error
#define USB_TXCSRL2_UNDRN_B         0x00000004 // Underrun
#define USB_TXCSRL2_FIFONE_B        0x00000002 // FIFO Not Empty
#define USB_TXCSRL2_TXRDY_B         0x00000001 // Transmit Packet Ready

/* Bit/Fields in Register TXCSRH2 of Module USB                               */
#define USB_TXCSRH2_AUTOSET_B       0x00000080 // Auto Set
#define USB_TXCSRH2_ISO_B           0x00000040 // Isochronous Transfers
#define USB_TXCSRH2_MODE_B          0x00000020 // Mode
#define USB_TXCSRH2_DMAEN_B         0x00000010 // DMA Request Enable
#define USB_TXCSRH2_FDT_B           0x00000008 // Force Data Toggle
#define USB_TXCSRH2_DMAMOD_B        0x00000004 // DMA Request Mode
#define USB_TXCSRH2_DTWE_B          0x00000002 // Data Toggle Write Enable
#define USB_TXCSRH2_DT_B            0x00000001 // Data Toggle

/* Bit/Fields in Register RXMAXP2 of Module USB                               */
#define USB_RXMAXP2_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_RXMAXP2_MAXLOAD_S       0          // Maximum Payload

/* Bit/Fields in Register RXCSRL2 of Module USB                               */
#define USB_RXCSRL2_CLRDT_B         0x00000080 // Clear Data Toggle
#define USB_RXCSRL2_STALLED_B       0x00000040 // Endpoint Stalled
#define USB_RXCSRL2_REQPKT_B        0x00000020 // Request Packet
#define USB_RXCSRL2_STALL_B         0x00000020 // Send STALL
#define USB_RXCSRL2_FLUSH_B         0x00000010 // Flush FIFO
#define USB_RXCSRL2_DATAERR_B       0x00000008 // Data Error
#define USB_RXCSRL2_NAKTO_B         0x00000008 // NAK Timeout
#define USB_RXCSRL2_ERROR_B         0x00000004 // Error
#define USB_RXCSRL2_OVER_B          0x00000004 // Overrun
#define USB_RXCSRL2_FULL_B          0x00000002 // FIFO Full
#define USB_RXCSRL2_RXRDY_B         0x00000001 // Receive Packet Ready

/* Bit/Fields in Register RXCSRH2 of Module USB                               */
#define USB_RXCSRH2_AUTOCL_B        0x00000080 // Auto Clear
#define USB_RXCSRH2_AUTORQ_B        0x00000040 // Auto Request
#define USB_RXCSRH2_ISO_B           0x00000040 // Isochronous Transfers
#define USB_RXCSRH2_DMAEN_B         0x00000020 // DMA Request Enable
#define USB_RXCSRH2_DISNYET_B       0x00000010 // Disable NYET
#define USB_RXCSRH2_PIDERR_B        0x00000010 // PID Error
#define USB_RXCSRH2_DMAMOD_B        0x00000008 // DMA Request Mode
#define USB_RXCSRH2_DTWE_B          0x00000004 // Data Toggle Write Enable
#define USB_RXCSRH2_DT_B            0x00000002 // Data Toggle

/* Bit/Fields in Register RXCOUNT2 of Module USB                              */
#define USB_RXCOUNT2_COUNT_M        0x00001FFF // Receive Packet Count
#define USB_RXCOUNT2_COUNT_S        0          // Receive Packet Count

