hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register TXTYPE2 of Module USB                               */
#define USB_TXTYPE2_SPEED_M         0x000000C0 // Operating Speed
#define USB_TXTYPE2_SPEED_S         6          // Operating Speed
#define USB_TXTYPE2_SPEED_DFLT_V    0x00000000 // Default
#define USB_TXTYPE2_SPEED_FULL_V    0x00000080 // Full
#define USB_TXTYPE2_SPEED_LOW_V     0x000000C0 // Low
#define USB_TXTYPE2_PROTO_M         0x00000030 // Protocol
#define USB_TXTYPE2_PROTO_S         4          // Protocol
#define USB_TXTYPE2_PROTO_CTRL_V    0x00000000 // Control
#define USB_TXTYPE2_PROTO_ISOC_V    0x00000010 // Isochronous
#define USB_TXTYPE2_PROTO_BULK_V    0x00000020 // Bulk
#define USB_TXTYPE2_PROTO_INT_V     0x00000030 // Interrupt
#define USB_TXTYPE2_TEP_M           0x0000000F // Target Endpoint Number
#define USB_TXTYPE2_TEP_S           0          // Target Endpoint Number

/* Bit/Fields in Register RXTYPE2 of Module USB                               */
#define USB_RXTYPE2_SPEED_M         0x000000C0 // Operating Speed
#define USB_RXTYPE2_SPEED_S         6          // Operating Speed
#define USB_RXTYPE2_SPEED_DFLT_V    0x00000000 // Default
#define USB_RXTYPE2_SPEED_FULL_V    0x00000080 // Full
#define USB_RXTYPE2_SPEED_LOW_V     0x000000C0 // Low
#define USB_RXTYPE2_PROTO_M         0x00000030 // Protocol
#define USB_RXTYPE2_PROTO_S         4          // Protocol
#define USB_RXTYPE2_PROTO_CTRL_V    0x00000000 // Control
#define USB_RXTYPE2_PROTO_ISOC_V    0x00000010 // Isochronous
#define USB_RXTYPE2_PROTO_BULK_V    0x00000020 // Bulk
#define USB_RXTYPE2_PROTO_INT_V     0x00000030 // Interrupt
#define USB_RXTYPE2_TEP_M           0x0000000F // Target Endpoint Number
#define USB_RXTYPE2_TEP_S           0          // Target Endpoint Number

/* Bit/Fields in Register TXMAXP3 of Module USB                               */
#define USB_TXMAXP3_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_TXMAXP3_MAXLOAD_S       0          // Maximum Payload

/* Bit/Fields in Register TXCSRL3 of Module USB                               */
#define USB_TXCSRL3_NAKTO_B         0x00000080 // NAK Timeout
#define USB_TXCSRL3_CLRDT_B         0x00000040 // Clear Data Toggle
#define USB_TXCSRL3_STALLED_B       0x00000020 // Endpoint Stalled
#define USB_TXCSRL3_SETUP_B         0x00000010 // Setup Packet
#define USB_TXCSRL3_STALL_B         0x00000010 // Send STALL
#define USB_TXCSRL3_FLUSH_B         0x00000008 // Flush FIFO
#define USB_TXCSRL3_ERROR_B         0x00000004 // Error
#define USB_TXCSRL3_UNDRN_B         0x00000004 // Underrun
#define USB_TXCSRL3_FIFONE_B        0x00000002 // FIFO Not Empty
#define USB_TXCSRL3_TXRDY_B         0x00000001 // Transmit Packet Ready

/* Bit/Fields in Register TXCSRH3 of Module USB                               */
#define USB_TXCSRH3_AUTOSET_B       0x00000080 // Auto Set
#define USB_TXCSRH3_ISO_B           0x00000040 // Isochronous Transfers
#define USB_TXCSRH3_MODE_B          0x00000020 // Mode
#define USB_TXCSRH3_DMAEN_B         0x00000010 // DMA Request Enable
#define USB_TXCSRH3_FDT_B           0x00000008 // Force Data Toggle
#define USB_TXCSRH3_DMAMOD_B        0x00000004 // DMA Request Mode
#define USB_TXCSRH3_DTWE_B          0x00000002 // Data Toggle Write Enable
#define USB_TXCSRH3_DT_B            0x00000001 // Data Toggle

/* Bit/Fields in Register RXMAXP3 of Module USB                               */
#define USB_RXMAXP3_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_RXMAXP3_MAXLOAD_S       0          // Maximum Payload

/* Bit/Fields in Register RXCSRL3 of Module USB                               */
#define USB_RXCSRL3_CLRDT_B         0x00000080 // Clear Data Toggle
#define USB_RXCSRL3_STALLED_B       0x00000040 // Endpoint Stalled
#define USB_RXCSRL3_STALL_B         0x00000020 // Send STALL
#define USB_RXCSRL3_REQPKT_B        0x00000020 // Request Packet
#define USB_RXCSRL3_FLUSH_B         0x00000010 // Flush FIFO
#define USB_RXCSRL3_DATAERR_B       0x00000008 // Data Error
#define USB_RXCSRL3_NAKTO_B         0x00000008 // NAK Timeout
#define USB_RXCSRL3_ERROR_B         0x00000004 // Error
#define USB_RXCSRL3_OVER_B          0x00000004 // Overrun
#define USB_RXCSRL3_FULL_B          0x00000002 // FIFO Full
#define USB_RXCSRL3_RXRDY_B         0x00000001 // Receive Packet Ready

/* Bit/Fields in Register RXCSRH3 of Module USB                               */
#define USB_RXCSRH3_AUTOCL_B        0x00000080 // Auto Clear
#define USB_RXCSRH3_AUTORQ_B        0x00000040 // Auto Request
#define USB_RXCSRH3_ISO_B           0x00000040 // Isochronous Transfers
#define USB_RXCSRH3_DMAEN_B         0x00000020 // DMA Request Enable
#define USB_RXCSRH3_DISNYET_B       0x00000010 // Disable NYET
#define USB_RXCSRH3_PIDERR_B        0x00000010 // PID Error
#define USB_RXCSRH3_DMAMOD_B        0x00000008 // DMA Request Mode
#define USB_RXCSRH3_DTWE_B          0x00000004 // Data Toggle Write Enable
#define USB_RXCSRH3_DT_B            0x00000002 // Data Toggle

/* Bit/Fields in Register RXCOUNT3 of Module USB                              */
#define USB_RXCOUNT3_COUNT_M        0x00001FFF // Receive Packet Count
#define USB_RXCOUNT3_COUNT_S        0          // Receive Packet Count

/* Bit/Fields in Register TXTYPE3 of Module USB                               */
#define USB_TXTYPE3_SPEED_M         0x000000C0 // Operating Speed
#define USB_TXTYPE3_SPEED_S         6          // Operating Speed
#define USB_TXTYPE3_SPEED_DFLT_V    0x00000000 // Default
#define USB_TXTYPE3_SPEED_FULL_V    0x00000080 // Full
#define USB_TXTYPE3_SPEED_LOW_V     0x000000C0 // Low
#define USB_TXTYPE3_PROTO_M         0x00000030 // Protocol
#define USB_TXTYPE3_PROTO_S         4          // Protocol
#define USB_TXTYPE3_PROTO_CTRL_V    0x00000000 // Control
#define USB_TXTYPE3_PROTO_ISOC_V    0x00000010 // Isochronous
#define USB_TXTYPE3_PROTO_BULK_V    0x00000020 // Bulk
#define USB_TXTYPE3_PROTO_INT_V     0x00000030 // Interrupt
#define USB_TXTYPE3_TEP_M           0x0000000F // Target Endpoint Number
#define USB_TXTYPE3_TEP_S           0          // Target Endpoint Number

