hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register RXTYPE3 of Module USB                               */
#define USB_RXTYPE3_SPEED_M         0x000000C0 // Operating Speed
#define USB_RXTYPE3_SPEED_S         6          // Operating Speed
#define USB_RXTYPE3_SPEED_DFLT_V    0x00000000 // Default
#define USB_RXTYPE3_SPEED_FULL_V    0x00000080 // Full
#define USB_RXTYPE3_SPEED_LOW_V     0x000000C0 // Low
#define USB_RXTYPE3_PROTO_M         0x00000030 // Protocol
#define USB_RXTYPE3_PROTO_S         4          // Protocol
#define USB_RXTYPE3_PROTO_CTRL_V    0x00000000 // Control
#define USB_RXTYPE3_PROTO_ISOC_V    0x00000010 // Isochronous
#define USB_RXTYPE3_PROTO_BULK_V    0x00000020 // Bulk
#define USB_RXTYPE3_PROTO_INT_V     0x00000030 // Interrupt
#define USB_RXTYPE3_TEP_M           0x0000000F // Target Endpoint Number
#define USB_RXTYPE3_TEP_S           0          // Target Endpoint Number

/* Bit/Fields in Register TXMAXP4 of Module USB                               */
#define USB_TXMAXP4_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_TXMAXP4_MAXLOAD_S       0          // Maximum Payload

/* Bit/Fields in Register TXCSRL4 of Module USB                               */
#define USB_TXCSRL4_NAKTO_B         0x00000080 // NAK Timeout
#define USB_TXCSRL4_CLRDT_B         0x00000040 // Clear Data Toggle
#define USB_TXCSRL4_STALLED_B       0x00000020 // Endpoint Stalled
#define USB_TXCSRL4_SETUP_B         0x00000010 // Setup Packet
#define USB_TXCSRL4_STALL_B         0x00000010 // Send STALL
#define USB_TXCSRL4_FLUSH_B         0x00000008 // Flush FIFO
#define USB_TXCSRL4_ERROR_B         0x00000004 // Error
#define USB_TXCSRL4_UNDRN_B         0x00000004 // Underrun
#define USB_TXCSRL4_FIFONE_B        0x00000002 // FIFO Not Empty
#define USB_TXCSRL4_TXRDY_B         0x00000001 // Transmit Packet Ready

/* Bit/Fields in Register TXCSRH4 of Module USB                               */
#define USB_TXCSRH4_AUTOSET_B       0x00000080 // Auto Set
#define USB_TXCSRH4_ISO_B           0x00000040 // Isochronous Transfers
#define USB_TXCSRH4_MODE_B          0x00000020 // Mode
#define USB_TXCSRH4_DMAEN_B         0x00000010 // DMA Request Enable
#define USB_TXCSRH4_FDT_B           0x00000008 // Force Data Toggle
#define USB_TXCSRH4_DMAMOD_B        0x00000004 // DMA Request Mode
#define USB_TXCSRH4_DTWE_B          0x00000002 // Data Toggle Write Enable
#define USB_TXCSRH4_DT_B            0x00000001 // Data Toggle

/* Bit/Fields in Register RXMAXP4 of Module USB                               */
#define USB_RXMAXP4_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_RXMAXP4_MAXLOAD_S       0          // Maximum Payload

/* Bit/Fields in Register RXCSRL4 of Module USB                               */
#define USB_RXCSRL4_CLRDT_B         0x00000080 // Clear Data Toggle
#define USB_RXCSRL4_STALLED_B       0x00000040 // Endpoint Stalled
#define USB_RXCSRL4_STALL_B         0x00000020 // Send STALL
#define USB_RXCSRL4_REQPKT_B        0x00000020 // Request Packet
#define USB_RXCSRL4_FLUSH_B         0x00000010 // Flush FIFO
#define USB_RXCSRL4_NAKTO_B         0x00000008 // NAK Timeout
#define USB_RXCSRL4_DATAERR_B       0x00000008 // Data Error
#define USB_RXCSRL4_OVER_B          0x00000004 // Overrun
#define USB_RXCSRL4_ERROR_B         0x00000004 // Error
#define USB_RXCSRL4_FULL_B          0x00000002 // FIFO Full
#define USB_RXCSRL4_RXRDY_B         0x00000001 // Receive Packet Ready

/* Bit/Fields in Register RXCSRH4 of Module USB                               */
#define USB_RXCSRH4_AUTOCL_B        0x00000080 // Auto Clear
#define USB_RXCSRH4_AUTORQ_B        0x00000040 // Auto Request
#define USB_RXCSRH4_ISO_B           0x00000040 // Isochronous Transfers
#define USB_RXCSRH4_DMAEN_B         0x00000020 // DMA Request Enable
#define USB_RXCSRH4_DISNYET_B       0x00000010 // Disable NYET
#define USB_RXCSRH4_PIDERR_B        0x00000010 // PID Error
#define USB_RXCSRH4_DMAMOD_B        0x00000008 // DMA Request Mode
#define USB_RXCSRH4_DTWE_B          0x00000004 // Data Toggle Write Enable
#define USB_RXCSRH4_DT_B            0x00000002 // Data Toggle

/* Bit/Fields in Register RXCOUNT4 of Module USB                              */
#define USB_RXCOUNT4_COUNT_M        0x00001FFF // Receive Packet Count
#define USB_RXCOUNT4_COUNT_S        0          // Receive Packet Count

/* Bit/Fields in Register TXTYPE4 of Module USB                               */
#define USB_TXTYPE4_SPEED_M         0x000000C0 // Operating Speed
#define USB_TXTYPE4_SPEED_S         6          // Operating Speed
#define USB_TXTYPE4_SPEED_DFLT_V    0x00000000 // Default
#define USB_TXTYPE4_SPEED_FULL_V    0x00000080 // Full
#define USB_TXTYPE4_SPEED_LOW_V     0x000000C0 // Low
#define USB_TXTYPE4_PROTO_M         0x00000030 // Protocol
#define USB_TXTYPE4_PROTO_S         4          // Protocol
#define USB_TXTYPE4_PROTO_CTRL_V    0x00000000 // Control
#define USB_TXTYPE4_PROTO_ISOC_V    0x00000010 // Isochronous
#define USB_TXTYPE4_PROTO_BULK_V    0x00000020 // Bulk
#define USB_TXTYPE4_PROTO_INT_V     0x00000030 // Interrupt
#define USB_TXTYPE4_TEP_M           0x0000000F // Target Endpoint Number
#define USB_TXTYPE4_TEP_S           0          // Target Endpoint Number

/* Bit/Fields in Register RXTYPE4 of Module USB                               */
#define USB_RXTYPE4_SPEED_M         0x000000C0 // Operating Speed
#define USB_RXTYPE4_SPEED_S         6          // Operating Speed
#define USB_RXTYPE4_SPEED_DFLT_V    0x00000000 // Default
#define USB_RXTYPE4_SPEED_FULL_V    0x00000080 // Full
#define USB_RXTYPE4_SPEED_LOW_V     0x000000C0 // Low
#define USB_RXTYPE4_PROTO_M         0x00000030 // Protocol
#define USB_RXTYPE4_PROTO_S         4          // Protocol
#define USB_RXTYPE4_PROTO_CTRL_V    0x00000000 // Control
#define USB_RXTYPE4_PROTO_ISOC_V    0x00000010 // Isochronous
#define USB_RXTYPE4_PROTO_BULK_V    0x00000020 // Bulk
#define USB_RXTYPE4_PROTO_INT_V     0x00000030 // Interrupt
#define USB_RXTYPE4_TEP_M           0x0000000F // Target Endpoint Number
#define USB_RXTYPE4_TEP_S           0          // Target Endpoint Number

/* Bit/Fields in Register TXMAXP5 of Module USB                               */
#define USB_TXMAXP5_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_TXMAXP5_MAXLOAD_S       0          // Maximum Payload

/* Bit/Fields in Register TXCSRL5 of Module USB                               */
#define USB_TXCSRL5_NAKTO_B         0x00000080 // NAK Timeout
#define USB_TXCSRL5_CLRDT_B         0x00000040 // Clear Data Toggle
#define USB_TXCSRL5_STALLED_B       0x00000020 // Endpoint Stalled
#define USB_TXCSRL5_SETUP_B         0x00000010 // Setup Packet
#define USB_TXCSRL5_STALL_B         0x00000010 // Send STALL
#define USB_TXCSRL5_FLUSH_B         0x00000008 // Flush FIFO
#define USB_TXCSRL5_ERROR_B         0x00000004 // Error
#define USB_TXCSRL5_UNDRN_B         0x00000004 // Underrun
#define USB_TXCSRL5_FIFONE_B        0x00000002 // FIFO Not Empty
#define USB_TXCSRL5_TXRDY_B         0x00000001 // Transmit Packet Ready

