hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register TXCSRH5 of Module USB                               */
#define USB_TXCSRH5_AUTOSET_B       0x00000080 // Auto Set
#define USB_TXCSRH5_ISO_B           0x00000040 // Isochronous Transfers
#define USB_TXCSRH5_MODE_B          0x00000020 // Mode
#define USB_TXCSRH5_DMAEN_B         0x00000010 // DMA Request Enable
#define USB_TXCSRH5_FDT_B           0x00000008 // Force Data Toggle
#define USB_TXCSRH5_DMAMOD_B        0x00000004 // DMA Request Mode
#define USB_TXCSRH5_DTWE_B          0x00000002 // Data Toggle Write Enable
#define USB_TXCSRH5_DT_B            0x00000001 // Data Toggle

/* Bit/Fields in Register RXMAXP5 of Module USB                               */
#define USB_RXMAXP5_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_RXMAXP5_MAXLOAD_S       0          // Maximum Payload

/* Bit/Fields in Register RXCSRL5 of Module USB                               */
#define USB_RXCSRL5_CLRDT_B         0x00000080 // Clear Data Toggle
#define USB_RXCSRL5_STALLED_B       0x00000040 // Endpoint Stalled
#define USB_RXCSRL5_STALL_B         0x00000020 // Send STALL
#define USB_RXCSRL5_REQPKT_B        0x00000020 // Request Packet
#define USB_RXCSRL5_FLUSH_B         0x00000010 // Flush FIFO
#define USB_RXCSRL5_NAKTO_B         0x00000008 // NAK Timeout
#define USB_RXCSRL5_DATAERR_B       0x00000008 // Data Error
#define USB_RXCSRL5_ERROR_B         0x00000004 // Error
#define USB_RXCSRL5_OVER_B          0x00000004 // Overrun
#define USB_RXCSRL5_FULL_B          0x00000002 // FIFO Full
#define USB_RXCSRL5_RXRDY_B         0x00000001 // Receive Packet Ready

/* Bit/Fields in Register RXCSRH5 of Module USB                               */
#define USB_RXCSRH5_AUTOCL_B        0x00000080 // Auto Clear
#define USB_RXCSRH5_AUTORQ_B        0x00000040 // Auto Request
#define USB_RXCSRH5_ISO_B           0x00000040 // Isochronous Transfers
#define USB_RXCSRH5_DMAEN_B         0x00000020 // DMA Request Enable
#define USB_RXCSRH5_DISNYET_B       0x00000010 // Disable NYET
#define USB_RXCSRH5_PIDERR_B        0x00000010 // PID Error
#define USB_RXCSRH5_DMAMOD_B        0x00000008 // DMA Request Mode
#define USB_RXCSRH5_DTWE_B          0x00000004 // Data Toggle Write Enable
#define USB_RXCSRH5_DT_B            0x00000002 // Data Toggle

/* Bit/Fields in Register RXCOUNT5 of Module USB                              */
#define USB_RXCOUNT5_COUNT_M        0x00001FFF // Receive Packet Count
#define USB_RXCOUNT5_COUNT_S        0          // Receive Packet Count

/* Bit/Fields in Register TXTYPE5 of Module USB                               */
#define USB_TXTYPE5_SPEED_M         0x000000C0 // Operating Speed
#define USB_TXTYPE5_SPEED_S         6          // Operating Speed
#define USB_TXTYPE5_SPEED_DFLT_V    0x00000000 // Default
#define USB_TXTYPE5_SPEED_FULL_V    0x00000080 // Full
#define USB_TXTYPE5_SPEED_LOW_V     0x000000C0 // Low
#define USB_TXTYPE5_PROTO_M         0x00000030 // Protocol
#define USB_TXTYPE5_PROTO_S         4          // Protocol
#define USB_TXTYPE5_PROTO_CTRL_V    0x00000000 // Control
#define USB_TXTYPE5_PROTO_ISOC_V    0x00000010 // Isochronous
#define USB_TXTYPE5_PROTO_BULK_V    0x00000020 // Bulk
#define USB_TXTYPE5_PROTO_INT_V     0x00000030 // Interrupt
#define USB_TXTYPE5_TEP_M           0x0000000F // Target Endpoint Number
#define USB_TXTYPE5_TEP_S           0          // Target Endpoint Number

/* Bit/Fields in Register RXTYPE5 of Module USB                               */
#define USB_RXTYPE5_SPEED_M         0x000000C0 // Operating Speed
#define USB_RXTYPE5_SPEED_S         6          // Operating Speed
#define USB_RXTYPE5_SPEED_DFLT_V    0x00000000 // Default
#define USB_RXTYPE5_SPEED_FULL_V    0x00000080 // Full
#define USB_RXTYPE5_SPEED_LOW_V     0x000000C0 // Low
#define USB_RXTYPE5_PROTO_M         0x00000030 // Protocol
#define USB_RXTYPE5_PROTO_S         4          // Protocol
#define USB_RXTYPE5_PROTO_CTRL_V    0x00000000 // Control
#define USB_RXTYPE5_PROTO_ISOC_V    0x00000010 // Isochronous
#define USB_RXTYPE5_PROTO_BULK_V    0x00000020 // Bulk
#define USB_RXTYPE5_PROTO_INT_V     0x00000030 // Interrupt
#define USB_RXTYPE5_TEP_M           0x0000000F // Target Endpoint Number
#define USB_RXTYPE5_TEP_S           0          // Target Endpoint Number

/* Bit/Fields in Register TXMAXP6 of Module USB                               */
#define USB_TXMAXP6_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_TXMAXP6_MAXLOAD_S       0          // Maximum Payload

/* Bit/Fields in Register TXCSRL6 of Module USB                               */
#define USB_TXCSRL6_NAKTO_B         0x00000080 // NAK Timeout
#define USB_TXCSRL6_CLRDT_B         0x00000040 // Clear Data Toggle
#define USB_TXCSRL6_STALLED_B       0x00000020 // Endpoint Stalled
#define USB_TXCSRL6_STALL_B         0x00000010 // Send STALL
#define USB_TXCSRL6_SETUP_B         0x00000010 // Setup Packet
#define USB_TXCSRL6_FLUSH_B         0x00000008 // Flush FIFO
#define USB_TXCSRL6_ERROR_B         0x00000004 // Error
#define USB_TXCSRL6_UNDRN_B         0x00000004 // Underrun
#define USB_TXCSRL6_FIFONE_B        0x00000002 // FIFO Not Empty
#define USB_TXCSRL6_TXRDY_B         0x00000001 // Transmit Packet Ready

/* Bit/Fields in Register TXCSRH6 of Module USB                               */
#define USB_TXCSRH6_AUTOSET_B       0x00000080 // Auto Set
#define USB_TXCSRH6_ISO_B           0x00000040 // Isochronous Transfers
#define USB_TXCSRH6_MODE_B          0x00000020 // Mode
#define USB_TXCSRH6_DMAEN_B         0x00000010 // DMA Request Enable
#define USB_TXCSRH6_FDT_B           0x00000008 // Force Data Toggle
#define USB_TXCSRH6_DMAMOD_B        0x00000004 // DMA Request Mode
#define USB_TXCSRH6_DTWE_B          0x00000002 // Data Toggle Write Enable
#define USB_TXCSRH6_DT_B            0x00000001 // Data Toggle

/* Bit/Fields in Register RXMAXP6 of Module USB                               */
#define USB_RXMAXP6_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_RXMAXP6_MAXLOAD_S       0          // Maximum Payload

/* Bit/Fields in Register RXCSRL6 of Module USB                               */
#define USB_RXCSRL6_CLRDT_B         0x00000080 // Clear Data Toggle
#define USB_RXCSRL6_STALLED_B       0x00000040 // Endpoint Stalled
#define USB_RXCSRL6_REQPKT_B        0x00000020 // Request Packet
#define USB_RXCSRL6_STALL_B         0x00000020 // Send STALL
#define USB_RXCSRL6_FLUSH_B         0x00000010 // Flush FIFO
#define USB_RXCSRL6_NAKTO_B         0x00000008 // NAK Timeout
#define USB_RXCSRL6_DATAERR_B       0x00000008 // Data Error
#define USB_RXCSRL6_ERROR_B         0x00000004 // Error
#define USB_RXCSRL6_OVER_B          0x00000004 // Overrun
#define USB_RXCSRL6_FULL_B          0x00000002 // FIFO Full
#define USB_RXCSRL6_RXRDY_B         0x00000001 // Receive Packet Ready

