hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register RXCSRH6 of Module USB                               */
#define USB_RXCSRH6_AUTOCL_B        0x00000080 // Auto Clear
#define USB_RXCSRH6_AUTORQ_B        0x00000040 // Auto Request
#define USB_RXCSRH6_ISO_B           0x00000040 // Isochronous Transfers
#define USB_RXCSRH6_DMAEN_B         0x00000020 // DMA Request Enable
#define USB_RXCSRH6_DISNYET_B       0x00000010 // Disable NYET
#define USB_RXCSRH6_PIDERR_B        0x00000010 // PID Error
#define USB_RXCSRH6_DMAMOD_B        0x00000008 // DMA Request Mode
#define USB_RXCSRH6_DTWE_B          0x00000004 // Data Toggle Write Enable
#define USB_RXCSRH6_DT_B            0x00000002 // Data Toggle

/* Bit/Fields in Register RXCOUNT6 of Module USB                              */
#define USB_RXCOUNT6_COUNT_M        0x00001FFF // Receive Packet Count
#define USB_RXCOUNT6_COUNT_S        0          // Receive Packet Count

/* Bit/Fields in Register TXTYPE6 of Module USB                               */
#define USB_TXTYPE6_SPEED_M         0x000000C0 // Operating Speed
#define USB_TXTYPE6_SPEED_S         6          // Operating Speed
#define USB_TXTYPE6_SPEED_DFLT_V    0x00000000 // Default
#define USB_TXTYPE6_SPEED_FULL_V    0x00000080 // Full
#define USB_TXTYPE6_SPEED_LOW_V     0x000000C0 // Low
#define USB_TXTYPE6_PROTO_M         0x00000030 // Protocol
#define USB_TXTYPE6_PROTO_S         4          // Protocol
#define USB_TXTYPE6_PROTO_CTRL_V    0x00000000 // Control
#define USB_TXTYPE6_PROTO_ISOC_V    0x00000010 // Isochronous
#define USB_TXTYPE6_PROTO_BULK_V    0x00000020 // Bulk
#define USB_TXTYPE6_PROTO_INT_V     0x00000030 // Interrupt
#define USB_TXTYPE6_TEP_M           0x0000000F // Target Endpoint Number
#define USB_TXTYPE6_TEP_S           0          // Target Endpoint Number

/* Bit/Fields in Register RXTYPE6 of Module USB                               */
#define USB_RXTYPE6_SPEED_M         0x000000C0 // Operating Speed
#define USB_RXTYPE6_SPEED_S         6          // Operating Speed
#define USB_RXTYPE6_SPEED_DFLT_V    0x00000000 // Default
#define USB_RXTYPE6_SPEED_FULL_V    0x00000080 // Full
#define USB_RXTYPE6_SPEED_LOW_V     0x000000C0 // Low
#define USB_RXTYPE6_PROTO_M         0x00000030 // Protocol
#define USB_RXTYPE6_PROTO_S         4          // Protocol
#define USB_RXTYPE6_PROTO_CTRL_V    0x00000000 // Control
#define USB_RXTYPE6_PROTO_ISOC_V    0x00000010 // Isochronous
#define USB_RXTYPE6_PROTO_BULK_V    0x00000020 // Bulk
#define USB_RXTYPE6_PROTO_INT_V     0x00000030 // Interrupt
#define USB_RXTYPE6_TEP_M           0x0000000F // Target Endpoint Number
#define USB_RXTYPE6_TEP_S           0          // Target Endpoint Number

/* Bit/Fields in Register TXMAXP7 of Module USB                               */
#define USB_TXMAXP7_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_TXMAXP7_MAXLOAD_S       0          // Maximum Payload

/* Bit/Fields in Register TXCSRL7 of Module USB                               */
#define USB_TXCSRL7_NAKTO_B         0x00000080 // NAK Timeout
#define USB_TXCSRL7_CLRDT_B         0x00000040 // Clear Data Toggle
#define USB_TXCSRL7_STALLED_B       0x00000020 // Endpoint Stalled
#define USB_TXCSRL7_STALL_B         0x00000010 // Send STALL
#define USB_TXCSRL7_SETUP_B         0x00000010 // Setup Packet
#define USB_TXCSRL7_FLUSH_B         0x00000008 // Flush FIFO
#define USB_TXCSRL7_ERROR_B         0x00000004 // Error
#define USB_TXCSRL7_UNDRN_B         0x00000004 // Underrun
#define USB_TXCSRL7_FIFONE_B        0x00000002 // FIFO Not Empty
#define USB_TXCSRL7_TXRDY_B         0x00000001 // Transmit Packet Ready

/* Bit/Fields in Register TXCSRH7 of Module USB                               */
#define USB_TXCSRH7_AUTOSET_B       0x00000080 // Auto Set
#define USB_TXCSRH7_ISO_B           0x00000040 // Isochronous Transfers
#define USB_TXCSRH7_MODE_B          0x00000020 // Mode
#define USB_TXCSRH7_DMAEN_B         0x00000010 // DMA Request Enable
#define USB_TXCSRH7_FDT_B           0x00000008 // Force Data Toggle
#define USB_TXCSRH7_DMAMOD_B        0x00000004 // DMA Request Mode
#define USB_TXCSRH7_DTWE_B          0x00000002 // Data Toggle Write Enable
#define USB_TXCSRH7_DT_B            0x00000001 // Data Toggle

/* Bit/Fields in Register RXMAXP7 of Module USB                               */
#define USB_RXMAXP7_MAXLOAD_M       0x000007FF // Maximum Payload
#define USB_RXMAXP7_MAXLOAD_S       0          // Maximum Payload

/* Bit/Fields in Register RXCSRL7 of Module USB                               */
#define USB_RXCSRL7_CLRDT_B         0x00000080 // Clear Data Toggle
#define USB_RXCSRL7_STALLED_B       0x00000040 // Endpoint Stalled
#define USB_RXCSRL7_REQPKT_B        0x00000020 // Request Packet
#define USB_RXCSRL7_STALL_B         0x00000020 // Send STALL
#define USB_RXCSRL7_FLUSH_B         0x00000010 // Flush FIFO
#define USB_RXCSRL7_DATAERR_B       0x00000008 // Data Error
#define USB_RXCSRL7_NAKTO_B         0x00000008 // NAK Timeout
#define USB_RXCSRL7_ERROR_B         0x00000004 // Error
#define USB_RXCSRL7_OVER_B          0x00000004 // Overrun
#define USB_RXCSRL7_FULL_B          0x00000002 // FIFO Full
#define USB_RXCSRL7_RXRDY_B         0x00000001 // Receive Packet Ready

/* Bit/Fields in Register RXCSRH7 of Module USB                               */
#define USB_RXCSRH7_AUTOCL_B        0x00000080 // Auto Clear
#define USB_RXCSRH7_ISO_B           0x00000040 // Isochronous Transfers
#define USB_RXCSRH7_AUTORQ_B        0x00000040 // Auto Request
#define USB_RXCSRH7_DMAEN_B         0x00000020 // DMA Request Enable
#define USB_RXCSRH7_PIDERR_B        0x00000010 // PID Error
#define USB_RXCSRH7_DISNYET_B       0x00000010 // Disable NYET
#define USB_RXCSRH7_DMAMOD_B        0x00000008 // DMA Request Mode
#define USB_RXCSRH7_DTWE_B          0x00000004 // Data Toggle Write Enable
#define USB_RXCSRH7_DT_B            0x00000002 // Data Toggle

/* Bit/Fields in Register RXCOUNT7 of Module USB                              */
#define USB_RXCOUNT7_COUNT_M        0x00001FFF // Receive Packet Count
#define USB_RXCOUNT7_COUNT_S        0          // Receive Packet Count

