hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register TXTYPE7 of Module USB                               */
#define USB_TXTYPE7_SPEED_M         0x000000C0 // Operating Speed
#define USB_TXTYPE7_SPEED_S         6          // Operating Speed
#define USB_TXTYPE7_SPEED_DFLT_V    0x00000000 // Default
#define USB_TXTYPE7_SPEED_FULL_V    0x00000080 // Full
#define USB_TXTYPE7_SPEED_LOW_V     0x000000C0 // Low
#define USB_TXTYPE7_PROTO_M         0x00000030 // Protocol
#define USB_TXTYPE7_PROTO_S         4          // Protocol
#define USB_TXTYPE7_PROTO_CTRL_V    0x00000000 // Control
#define USB_TXTYPE7_PROTO_ISOC_V    0x00000010 // Isochronous
#define USB_TXTYPE7_PROTO_BULK_V    0x00000020 // Bulk
#define USB_TXTYPE7_PROTO_INT_V     0x00000030 // Interrupt
#define USB_TXTYPE7_TEP_M           0x0000000F // Target Endpoint Number
#define USB_TXTYPE7_TEP_S           0          // Target Endpoint Number

/* Bit/Fields in Register RXTYPE7 of Module USB                               */
#define USB_RXTYPE7_SPEED_M         0x000000C0 // Operating Speed
#define USB_RXTYPE7_SPEED_S         6          // Operating Speed
#define USB_RXTYPE7_SPEED_DFLT_V    0x00000000 // Default
#define USB_RXTYPE7_SPEED_FULL_V    0x00000080 // Full
#define USB_RXTYPE7_SPEED_LOW_V     0x000000C0 // Low
#define USB_RXTYPE7_PROTO_M         0x00000030 // Protocol
#define USB_RXTYPE7_PROTO_S         4          // Protocol
#define USB_RXTYPE7_PROTO_CTRL_V    0x00000000 // Control
#define USB_RXTYPE7_PROTO_ISOC_V    0x00000010 // Isochronous
#define USB_RXTYPE7_PROTO_BULK_V    0x00000020 // Bulk
#define USB_RXTYPE7_PROTO_INT_V     0x00000030 // Interrupt
#define USB_RXTYPE7_TEP_M           0x0000000F // Target Endpoint Number
#define USB_RXTYPE7_TEP_S           0          // Target Endpoint Number

/* Bit/Fields in Register RQPKTCOUNT1 of Module USB                           */
#define USB_RQPKTCOUNT1_M           0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT1_S           0          // Block Transfer Packet Count

/* Bit/Fields in Register RQPKTCOUNT2 of Module USB                           */
#define USB_RQPKTCOUNT2_M           0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT2_S           0          // Block Transfer Packet Count

/* Bit/Fields in Register RQPKTCOUNT3 of Module USB                           */
#define USB_RQPKTCOUNT3_M           0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT3_S           0          // Block Transfer Packet Count

/* Bit/Fields in Register RQPKTCOUNT4 of Module USB                           */
#define USB_RQPKTCOUNT4_COUNT_M     0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT4_COUNT_S     0          // Block Transfer Packet Count

/* Bit/Fields in Register RQPKTCOUNT5 of Module USB                           */
#define USB_RQPKTCOUNT5_COUNT_M     0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT5_COUNT_S     0          // Block Transfer Packet Count

/* Bit/Fields in Register RQPKTCOUNT6 of Module USB                           */
#define USB_RQPKTCOUNT6_COUNT_M     0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT6_COUNT_S     0          // Block Transfer Packet Count

/* Bit/Fields in Register RQPKTCOUNT7 of Module USB                           */
#define USB_RQPKTCOUNT7_COUNT_M     0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT7_COUNT_S     0          // Block Transfer Packet Count

/* Bit/Fields in Register RXDPKTBUFDIS of Module USB                          */
#define USB_RXDPKTBUFDIS_EP7_B      0x00000080 // EP7 RX Double-Packet Buffer
#define USB_RXDPKTBUFDIS_EP6_B      0x00000040 // EP6 RX Double-Packet Buffer
#define USB_RXDPKTBUFDIS_EP5_B      0x00000020 // EP5 RX Double-Packet Buffer
#define USB_RXDPKTBUFDIS_EP4_B      0x00000010 // EP4 RX Double-Packet Buffer
#define USB_RXDPKTBUFDIS_EP3_B      0x00000008 // EP3 RX Double-Packet Buffer
#define USB_RXDPKTBUFDIS_EP2_B      0x00000004 // EP2 RX Double-Packet Buffer
#define USB_RXDPKTBUFDIS_EP1_B      0x00000002 // EP1 RX Double-Packet Buffer

/* Bit/Fields in Register TXDPKTBUFDIS of Module USB                          */
#define USB_TXDPKTBUFDIS_EP7_B      0x00000080 // EP7 TX Double-Packet Buffer
#define USB_TXDPKTBUFDIS_EP6_B      0x00000040 // EP6 TX Double-Packet Buffer
#define USB_TXDPKTBUFDIS_EP5_B      0x00000020 // EP5 TX Double-Packet Buffer
#define USB_TXDPKTBUFDIS_EP4_B      0x00000010 // EP4 TX Double-Packet Buffer
#define USB_TXDPKTBUFDIS_EP3_B      0x00000008 // EP3 TX Double-Packet Buffer
#define USB_TXDPKTBUFDIS_EP2_B      0x00000004 // EP2 TX Double-Packet Buffer
#define USB_TXDPKTBUFDIS_EP1_B      0x00000002 // EP1 TX Double-Packet Buffer

/* Bit/Fields in Register EPC of Module USB                                   */
#define USB_EPC_PFLTACT_M           0x00000300 // Power Fault Action
#define USB_EPC_PFLTACT_S           8          // Power Fault Action
#define USB_EPC_PFLTACT_UNCHG_V     0x00000000 // Unchanged
#define USB_EPC_PFLTACT_TRIS_V      0x00000100 // Tristate
#define USB_EPC_PFLTACT_LOW_V       0x00000200 // Low
#define USB_EPC_PFLTACT_HIGH_V      0x00000300 // High
#define USB_EPC_PFLTAEN_B           0x00000040 // Power Fault Action Enable
#define USB_EPC_PFLTSEN_HIGH_B      0x00000020 // Power Fault Sense
#define USB_EPC_PFLTEN_B            0x00000010 // Power Fault Input Enable
#define USB_EPC_EPENDE_B            0x00000004 // EPEN Drive Enable
#define USB_EPC_EPEN_M              0x00000003 // External Power Supply Enable
#define USB_EPC_EPEN_S              0          // External Power Supply Enable
#define USB_EPC_EPEN_LOW_V          0x00000000 // Power Enable Active Low
#define USB_EPC_EPEN_HIGH_V         0x00000001 // Power Enable Active High
#define USB_EPC_EPEN_VBLOW_V        0x00000002 // Power Enable High if VBUS Low
#define USB_EPC_EPEN_VBHIGH_V       0x00000003 // Power Enable High if VBUS High

/* Bit/Fields in Register EPCRIS of Module USB                                */
#define USB_EPCRIS_PF_B             0x00000001 // USB Power Fault Interrupt Status

/* Bit/Fields in Register EPCIM of Module USB                                 */
#define USB_EPCIM_PF_B              0x00000001 // USB Power Fault Interrupt Mask

/* Bit/Fields in Register EPCISC of Module USB                                */
#define USB_EPCISC_PF_B             0x00000001 // USB Power Fault Interrupt Status

/* Bit/Fields in Register DRRIS of Module USB                                 */
#define USB_DRRIS_RESUME_B          0x00000001 // RESUME Interrupt Status

/* Bit/Fields in Register DRIM of Module USB                                  */
#define USB_DRIM_RESUME_B           0x00000001 // RESUME Interrupt Mask

/* Bit/Fields in Register DRISC of Module USB                                 */
#define USB_DRISC_RESUME_B          0x00000001 // RESUME Interrupt Status and

/* Bit/Fields in Register GPCS of Module USB                                  */
#define USB_GPCS_DEVMODOTG_B        0x00000002 // Enable Device Mode
#define USB_GPCS_DEVMOD_B           0x00000001 // Device Mode

