hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register VDC of Module USB                                   */
#define USB_VDC_VBDEN_B             0x00000001 // VBUS Droop Enable

/* Bit/Fields in Register VDCRIS of Module USB                                */
#define USB_VDCRIS_VD_B             0x00000001 // VBUS Droop Raw Interrupt Status

/* Bit/Fields in Register VDCIM of Module USB                                 */
#define USB_VDCIM_VD_B              0x00000001 // VBUS Droop Interrupt Mask

/* Bit/Fields in Register VDCISC of Module USB                                */
#define USB_VDCISC_VD_B             0x00000001 // VBUS Droop Interrupt Status and

/* Bit/Fields in Register IDVRIS of Module USB                                */
#define USB_IDVRIS_ID_B             0x00000001 // ID Valid Detect Raw Interrupt

/* Bit/Fields in Register IDVIM of Module USB                                 */
#define USB_IDVIM_ID_B              0x00000001 // ID Valid Detect Interrupt Mask

/* Bit/Fields in Register IDVISC of Module USB                                */
#define USB_IDVISC_ID_B             0x00000001 // ID Valid Detect Interrupt Status

/* Bit/Fields in Register DMASEL of Module USB                                */
#define USB_DMASEL_DMACTX_M         0x00F00000 // DMA C TX Select
#define USB_DMASEL_DMACTX_S         20         // DMA C TX Select
#define USB_DMASEL_DMACRX_M         0x000F0000 // DMA C RX Select
#define USB_DMASEL_DMACRX_S         16         // DMA C RX Select
#define USB_DMASEL_DMABTX_M         0x0000F000 // DMA B TX Select
#define USB_DMASEL_DMABTX_S         12         // DMA B TX Select
#define USB_DMASEL_DMABRX_M         0x00000F00 // DMA B RX Select
#define USB_DMASEL_DMABRX_S         8          // DMA B RX Select
#define USB_DMASEL_DMAATX_M         0x000000F0 // DMA A TX Select
#define USB_DMASEL_DMAATX_S         4          // DMA A TX Select
#define USB_DMASEL_DMAARX_M         0x0000000F // DMA A RX Select
#define USB_DMASEL_DMAARX_S         0          // DMA A RX Select

/* Bit/Fields in Register PP of Module USB                                    */
#define USB_PP_ECNT_M               0x0000FF00 // Endpoint Count
#define USB_PP_ECNT_S               8          // Endpoint Count
#define USB_PP_USB_M                0x000000C0 // USB Capability
#define USB_PP_USB_S                6          // USB Capability
#define USB_PP_USB_DEVICE_V         0x00000040 // DEVICE
#define USB_PP_USB_HOSTDEVICE_V     0x00000080 // HOST
#define USB_PP_USB_OTG_V            0x000000C0 // OTG
#define USB_PP_PHY_B                0x00000010 // PHY Present
#define USB_PP_TYPE_M               0x0000000F // Controller Type
#define USB_PP_TYPE_S               0          // Controller Type
#define USB_PP_TYPE_0_V             0x00000000 // The first-generation USB


/******************************************************************************/
/*                                                                            */
/*                      EEPROM                                                */
/*                                                                            */
/******************************************************************************/


/* Bit/Fields in Register EESIZE of Module EEPROM                             */
#define EEPROM_EESIZE_BLKCNT_M      0x07FF0000 // Number of 16-Word Blocks
#define EEPROM_EESIZE_BLKCNT_S      16         // Number of 16-Word Blocks
#define EEPROM_EESIZE_WORDCNT_M     0x0000FFFF // Number of 32-Bit Words
#define EEPROM_EESIZE_WORDCNT_S     0          // Number of 32-Bit Words

/* Bit/Fields in Register EEBLOCK of Module EEPROM                            */
#define EEPROM_EEBLOCK_BLOCK_M      0x0000FFFF // Current Block
#define EEPROM_EEBLOCK_BLOCK_S      0          // Current Block

/* Bit/Fields in Register EERDWR of Module EEPROM                             */
#define EEPROM_EERDWR_VALUE_M       0xFFFFFFFF // EEPROM Read or Write Data
#define EEPROM_EERDWR_VALUE_S       0          // EEPROM Read or Write Data

/* Bit/Fields in Register EEDONE of Module EEPROM                             */
#define EEPROM_EEDONE_WRBUSY_B      0x00000020 // Write Busy
#define EEPROM_EEDONE_NOPERM_B      0x00000010 // Write Without Permission
#define EEPROM_EEDONE_WKCOPY_B      0x00000008 // Working on a Copy
#define EEPROM_EEDONE_WKERASE_B     0x00000004 // Working on an Erase
#define EEPROM_EEDONE_WORKING_B     0x00000001 // EEPROM Working

/* Bit/Fields in Register EESUPP of Module EEPROM                             */
#define EEPROM_EESUPP_PRETRY_B      0x00000008 // Programming Must Be Retried
#define EEPROM_EESUPP_ERETRY_B      0x00000004 // Erase Must Be Retried

/* Bit/Fields in Register EEPROT of Module EEPROM                             */
#define EEPROM_EEPROT_ACC_B         0x00000008 // Access Control
#define EEPROM_EEPROT_PROT_M        0x00000007 // Protection Control
#define EEPROM_EEPROT_PROT_S        0          // Protection Control
#define EEPROM_EEPROT_PROT_RWPW_V   0x00000001 // If there is a password, the

/* Bit/Fields in Register EEPASS0 of Module EEPROM                            */
#define EEPROM_EEPASS0_PASS_M       0xFFFFFFFF // Password
#define EEPROM_EEPASS0_PASS_S       0          // Password

/* Bit/Fields in Register EEPASS1 of Module EEPROM                            */
#define EEPROM_EEPASS1_PASS_M       0xFFFFFFFF // Password
#define EEPROM_EEPASS1_PASS_S       0          // Password

/* Bit/Fields in Register EEPASS2 of Module EEPROM                            */
#define EEPROM_EEPASS2_PASS_M       0xFFFFFFFF // Password
#define EEPROM_EEPASS2_PASS_S       0          // Password

/* Bit/Fields in Register EEINT of Module EEPROM                              */
#define EEPROM_EEINT_INT_B          0x00000001 // Interrupt Enable

/* Bit/Fields in Register EEHIDE of Module EEPROM                             */
#define EEPROM_EEHIDE_HN_M          0xFFFFFFFE // Hide Block
#define EEPROM_EEHIDE_HN_S          1          // Hide Block

/* Bit/Fields in Register EEDBGME of Module EEPROM                            */
#define EEPROM_EEDBGME_KEY_M        0xFFFF0000 // Erase Key
#define EEPROM_EEDBGME_KEY_S        16         // Erase Key
#define EEPROM_EEDBGME_ME_B         0x00000001 // Mass Erase

