hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register PP of Module EEPROM                                 */
#define EEPROM_PP_SIZE_M            0x0000001F // EEPROM Size
#define EEPROM_PP_SIZE_S            0          // EEPROM Size


/******************************************************************************/
/*                                                                            */
/*                      SYSEXC                                                */
/*                                                                            */
/******************************************************************************/


/* Bit/Fields in Register RIS of Module SYSEXC                                */
#define SYSEXC_RIS_FPIXCRIS_B       0x00000020 // Floating-Point Inexact Exception
#define SYSEXC_RIS_FPOFCRIS_B       0x00000010 // Floating-Point Overflow
#define SYSEXC_RIS_FPUFCRIS_B       0x00000008 // Floating-Point Underflow
#define SYSEXC_RIS_FPIOCRIS_B       0x00000004 // Floating-Point Invalid Operation
#define SYSEXC_RIS_FPDZCRIS_B       0x00000002 // Floating-Point Divide By 0
#define SYSEXC_RIS_FPIDCRIS_B       0x00000001 // Floating-Point Input Denormal

/* Bit/Fields in Register IM of Module SYSEXC                                 */
#define SYSEXC_IM_FPIXCIM_B         0x00000020 // Floating-Point Inexact Exception
#define SYSEXC_IM_FPOFCIM_B         0x00000010 // Floating-Point Overflow
#define SYSEXC_IM_FPUFCIM_B         0x00000008 // Floating-Point Underflow
#define SYSEXC_IM_FPIOCIM_B         0x00000004 // Floating-Point Invalid Operation
#define SYSEXC_IM_FPDZCIM_B         0x00000002 // Floating-Point Divide By 0
#define SYSEXC_IM_FPIDCIM_B         0x00000001 // Floating-Point Input Denormal

/* Bit/Fields in Register MIS of Module SYSEXC                                */
#define SYSEXC_MIS_FPIXCMIS_B       0x00000020 // Floating-Point Inexact Exception
#define SYSEXC_MIS_FPOFCMIS_B       0x00000010 // Floating-Point Overflow
#define SYSEXC_MIS_FPUFCMIS_B       0x00000008 // Floating-Point Underflow
#define SYSEXC_MIS_FPIOCMIS_B       0x00000004 // Floating-Point Invalid Operation
#define SYSEXC_MIS_FPDZCMIS_B       0x00000002 // Floating-Point Divide By 0
#define SYSEXC_MIS_FPIDCMIS_B       0x00000001 // Floating-Point Input Denormal

/* Bit/Fields in Register IC of Module SYSEXC                                 */
#define SYSEXC_IC_FPIXCIC_B         0x00000020 // Floating-Point Inexact Exception
#define SYSEXC_IC_FPOFCIC_B         0x00000010 // Floating-Point Overflow
#define SYSEXC_IC_FPUFCIC_B         0x00000008 // Floating-Point Underflow
#define SYSEXC_IC_FPIOCIC_B         0x00000004 // Floating-Point Invalid Operation
#define SYSEXC_IC_FPDZCIC_B         0x00000002 // Floating-Point Divide By 0
#define SYSEXC_IC_FPIDCIC_B         0x00000001 // Floating-Point Input Denormal


/******************************************************************************/
/*                                                                            */
/*                      HIB                                                   */
/*                                                                            */
/******************************************************************************/


/* Bit/Fields in Register RTCC of Module HIB                                  */
#define HIB_RTCC_M                  0xFFFFFFFF // RTC Counter
#define HIB_RTCC_S                  0          // RTC Counter

/* Bit/Fields in Register RTCM0 of Module HIB                                 */
#define HIB_RTCM0_M                 0xFFFFFFFF // RTC Match 0
#define HIB_RTCM0_S                 0          // RTC Match 0

/* Bit/Fields in Register RTCLD of Module HIB                                 */
#define HIB_RTCLD_M                 0xFFFFFFFF // RTC Load
#define HIB_RTCLD_S                 0          // RTC Load

/* Bit/Fields in Register CTL of Module HIB                                   */
#define HIB_CTL_WRC_B               0x80000000 // Write Complete/Capable
#define HIB_CTL_OSCDRV_B            0x00020000 // Oscillator Drive Capability
#define HIB_CTL_OSCBYP_B            0x00010000 // Oscillator Bypass
#define HIB_CTL_VBATSEL_M           0x00006000 // Select for Low-Battery
#define HIB_CTL_VBATSEL_S           13         // Select for Low-Battery
#define HIB_CTL_VBATSEL_1_9V_V      0x00000000 // 1.9 Volts
#define HIB_CTL_VBATSEL_2_1V_V      0x00002000 // 2.1 Volts (default)
#define HIB_CTL_VBATSEL_2_3V_V      0x00004000 // 2.3 Volts
#define HIB_CTL_VBATSEL_2_5V_V      0x00006000 // 2.5 Volts
#define HIB_CTL_BATCHK_B            0x00000400 // Check Battery Status
#define HIB_CTL_BATWKEN_B           0x00000200 // Wake on Low Battery
#define HIB_CTL_VDD3ON_B            0x00000100 // VDD Powered
#define HIB_CTL_VABORT_B            0x00000080 // Power Cut Abort Enable
#define HIB_CTL_CLK32EN_B           0x00000040 // Clocking Enable
#define HIB_CTL_PINWEN_B            0x00000010 // External Wake Pin Enable
#define HIB_CTL_RTCWEN_B            0x00000008 // RTC Wake-up Enable
#define HIB_CTL_HIBREQ_B            0x00000002 // Hibernation Request
#define HIB_CTL_RTCEN_B             0x00000001 // RTC Timer Enable

/* Bit/Fields in Register IM of Module HIB                                    */
#define HIB_IM_WC_B                 0x00000010 // External Write Complete/Capable
#define HIB_IM_EXTW_B               0x00000008 // External Wake-Up Interrupt Mask
#define HIB_IM_LOWBAT_B             0x00000004 // Low Battery Voltage Interrupt
#define HIB_IM_RTCALT0_B            0x00000001 // RTC Alert 0 Interrupt Mask

/* Bit/Fields in Register RIS of Module HIB                                   */
#define HIB_RIS_WC_B                0x00000010 // Write Complete/Capable Raw
#define HIB_RIS_EXTW_B              0x00000008 // External Wake-Up Raw Interrupt
#define HIB_RIS_LOWBAT_B            0x00000004 // Low Battery Voltage Raw
#define HIB_RIS_RTCALT0_B           0x00000001 // RTC Alert 0 Raw Interrupt Status

/* Bit/Fields in Register MIS of Module HIB                                   */
#define HIB_MIS_WC_B                0x00000010 // Write Complete/Capable Masked
#define HIB_MIS_EXTW_B              0x00000008 // External Wake-Up Masked
#define HIB_MIS_LOWBAT_B            0x00000004 // Low Battery Voltage Masked
#define HIB_MIS_RTCALT0_B           0x00000001 // RTC Alert 0 Masked Interrupt

/* Bit/Fields in Register IC of Module HIB                                    */
#define HIB_IC_WC_B                 0x00000010 // Write Complete/Capable Interrupt
#define HIB_IC_EXTW_B               0x00000008 // External Wake-Up Interrupt Clear
#define HIB_IC_LOWBAT_B             0x00000004 // Low Battery Voltage Interrupt
#define HIB_IC_RTCALT0_B            0x00000001 // RTC Alert0 Masked Interrupt

/* Bit/Fields in Register RTCT of Module HIB                                  */
#define HIB_RTCT_TRIM_M             0x0000FFFF // RTC Trim Value
#define HIB_RTCT_TRIM_S             0          // RTC Trim Value

/* Bit/Fields in Register RTCSS of Module HIB                                 */
#define HIB_RTCSS_RTCSSM_M          0x7FFF0000 // RTC Sub Seconds Match
#define HIB_RTCSS_RTCSSM_S          16         // RTC Sub Seconds Match
#define HIB_RTCSS_RTCSSC_M          0x00007FFF // RTC Sub Seconds Count
#define HIB_RTCSS_RTCSSC_S          0          // RTC Sub Seconds Count

/* Bit/Fields in Register DATA of Module HIB                                  */
#define HIB_DATA_RTD_M              0xFFFFFFFF // Hibernation Module NV Data
#define HIB_DATA_RTD_S              0          // Hibernation Module NV Data


/******************************************************************************/
/*                                                                            */
/*                      FLASH                                                 */
/*                                                                            */
/******************************************************************************/


