hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register FMA of Module FLASH                                 */
#define FLASH_FMA_OFFSET_M          0x0003FFFF // Address Offset
#define FLASH_FMA_OFFSET_S          0          // Address Offset

/* Bit/Fields in Register FMD of Module FLASH                                 */
#define FLASH_FMD_DATA_M            0xFFFFFFFF // Data Value
#define FLASH_FMD_DATA_S            0          // Data Value

/* Bit/Fields in Register FMC of Module FLASH                                 */
#define FLASH_FMC_WRKEY_V           0xA4420000 // FLASH write key
#define FLASH_FMC_COMT_B            0x00000008 // Commit Register Value
#define FLASH_FMC_MERASE_B          0x00000004 // Mass Erase Flash Memory
#define FLASH_FMC_ERASE_B           0x00000002 // Erase a Page of Flash Memory
#define FLASH_FMC_WRITE_B           0x00000001 // Write a Word into Flash Memory

/* Bit/Fields in Register FCRIS of Module FLASH                               */
#define FLASH_FCRIS_PROGRIS_B       0x00002000 // Program Verify Error Raw
#define FLASH_FCRIS_ERRIS_B         0x00000800 // Erase Verify Error Raw Interrupt
#define FLASH_FCRIS_INVDRIS_B       0x00000400 // Invalid Data Raw Interrupt
#define FLASH_FCRIS_VOLTRIS_B       0x00000200 // Pump Voltage Raw Interrupt
#define FLASH_FCRIS_ERIS_B          0x00000004 // EEPROM Raw Interrupt Status
#define FLASH_FCRIS_PRIS_B          0x00000002 // Programming Raw Interrupt Status
#define FLASH_FCRIS_ARIS_B          0x00000001 // Access Raw Interrupt Status

/* Bit/Fields in Register FCIM of Module FLASH                                */
#define FLASH_FCIM_PROGMASK_B       0x00002000 // PROGVER Interrupt Mask
#define FLASH_FCIM_ERMASK_B         0x00000800 // ERVER Interrupt Mask
#define FLASH_FCIM_INVDMASK_B       0x00000400 // Invalid Data Interrupt Mask
#define FLASH_FCIM_VOLTMASK_B       0x00000200 // VOLT Interrupt Mask
#define FLASH_FCIM_EMASK_B          0x00000004 // EEPROM Interrupt Mask
#define FLASH_FCIM_PMASK_B          0x00000002 // Programming Interrupt Mask
#define FLASH_FCIM_AMASK_B          0x00000001 // Access Interrupt Mask

/* Bit/Fields in Register FCMISC of Module FLASH                              */
#define FLASH_FCMISC_PROGMISC_B     0x00002000 // PROGVER Masked Interrupt Status
#define FLASH_FCMISC_ERMISC_B       0x00000800 // ERVER Masked Interrupt Status
#define FLASH_FCMISC_INVDMISC_B     0x00000400 // Invalid Data Masked Interrupt
#define FLASH_FCMISC_VOLTMISC_B     0x00000200 // VOLT Masked Interrupt Status and
#define FLASH_FCMISC_EMISC_B        0x00000004 // EEPROM Masked Interrupt Status
#define FLASH_FCMISC_PMISC_B        0x00000002 // Programming Masked Interrupt
#define FLASH_FCMISC_AMISC_B        0x00000001 // Access Masked Interrupt Status

/* Bit/Fields in Register FMC2 of Module FLASH                                */
#define FLASH_FMC2_WRBUF_B          0x00000001 // Buffered Flash Memory Write

/* Bit/Fields in Register FWBVAL of Module FLASH                              */
#define FLASH_FWBVAL_FWB_M          0xFFFFFFFF // Flash Memory Write Buffer
#define FLASH_FWBVAL_FWB_S          0          // Flash Memory Write Buffer

/* Bit/Fields in Register FWBN of Module FLASH                                */
#define FLASH_FWBN_DATA_M           0xFFFFFFFF // Data
#define FLASH_FWBN_DATA_S           0          // Data

/* Bit/Fields in Register FSIZE of Module FLASH                               */
#define FLASH_FSIZE_SIZE_M          0x0000FFFF // Flash Size
#define FLASH_FSIZE_SIZE_S          0          // Flash Size
#define FLASH_FSIZE_SIZE_256KB_V    0x0000007F // 256 KB of Flash

/* Bit/Fields in Register SSIZE of Module FLASH                               */
#define FLASH_SSIZE_SIZE_M          0x0000FFFF // SRAM Size
#define FLASH_SSIZE_SIZE_S          0          // SRAM Size
#define FLASH_SSIZE_SIZE_32KB_V     0x0000007F // 32 KB of SRAM

/* Bit/Fields in Register ROMSWMAP of Module FLASH                            */
#define FLASH_ROMSWMAP_SAFERTOS_B   0x00000001 // SafeRTOS Present

/* Bit/Fields in Register RMCTL of Module FLASH                               */
#define FLASH_RMCTL_BA_B            0x00000001 // Boot Alias

/* Bit/Fields in Register BOOTCFG of Module FLASH                             */
#define FLASH_BOOTCFG_NW_B          0x80000000 // Not Written
#define FLASH_BOOTCFG_PORT_M        0x0000E000 // Boot GPIO Port
#define FLASH_BOOTCFG_PORT_S        13         // Boot GPIO Port
#define FLASH_BOOTCFG_PORT_A_V      0x00000000 // Port A
#define FLASH_BOOTCFG_PORT_B_V      0x00002000 // Port B
#define FLASH_BOOTCFG_PORT_C_V      0x00004000 // Port C
#define FLASH_BOOTCFG_PORT_D_V      0x00006000 // Port D
#define FLASH_BOOTCFG_PORT_E_V      0x00008000 // Port E
#define FLASH_BOOTCFG_PORT_F_V      0x0000A000 // Port F
#define FLASH_BOOTCFG_PORT_G_V      0x0000C000 // Port G
#define FLASH_BOOTCFG_PORT_H_V      0x0000E000 // Port H
#define FLASH_BOOTCFG_PIN_M         0x00001C00 // Boot GPIO Pin
#define FLASH_BOOTCFG_PIN_S         10         // Boot GPIO Pin
#define FLASH_BOOTCFG_PIN_0_V       0x00000000 // Pin 0
#define FLASH_BOOTCFG_PIN_1_V       0x00000400 // Pin 1
#define FLASH_BOOTCFG_PIN_2_V       0x00000800 // Pin 2
#define FLASH_BOOTCFG_PIN_3_V       0x00000C00 // Pin 3
#define FLASH_BOOTCFG_PIN_4_V       0x00001000 // Pin 4
#define FLASH_BOOTCFG_PIN_5_V       0x00001400 // Pin 5
#define FLASH_BOOTCFG_PIN_6_V       0x00001800 // Pin 6
#define FLASH_BOOTCFG_PIN_7_V       0x00001C00 // Pin 7
#define FLASH_BOOTCFG_POL_B         0x00000200 // Boot GPIO Polarity
#define FLASH_BOOTCFG_EN_B          0x00000100 // Boot GPIO Enable
#define FLASH_BOOTCFG_KEY_B         0x00000010 // KEY Select
#define FLASH_BOOTCFG_DBG1_B        0x00000002 // Debug Control 1
#define FLASH_BOOTCFG_DBG0_B        0x00000001 // Debug Control 0

/* Bit/Fields in Register USERREG0 of Module FLASH                            */
#define FLASH_USERREG0_DATA_M       0xFFFFFFFF // User Data
#define FLASH_USERREG0_DATA_S       0          // User Data

/* Bit/Fields in Register USERREG1 of Module FLASH                            */
#define FLASH_USERREG1_DATA_M       0xFFFFFFFF // User Data
#define FLASH_USERREG1_DATA_S       0          // User Data

/* Bit/Fields in Register USERREG2 of Module FLASH                            */
#define FLASH_USERREG2_DATA_M       0xFFFFFFFF // User Data
#define FLASH_USERREG2_DATA_S       0          // User Data

/* Bit/Fields in Register USERREG3 of Module FLASH                            */
#define FLASH_USERREG3_DATA_M       0xFFFFFFFF // User Data
#define FLASH_USERREG3_DATA_S       0          // User Data


/******************************************************************************/
/*                                                                            */
/*                      SYSCTL                                                */
/*                                                                            */
/******************************************************************************/


/* Bit/Fields in Register DID0 of Module SYSCTL                               */
#define SYSCTL_DID0_VER_M           0x70000000 // DID0 Version
#define SYSCTL_DID0_VER_S           28         // DID0 Version
#define SYSCTL_DID0_VER_1_V         0x10000000 // Second version of the DID0
#define SYSCTL_DID0_CLASS_M         0x00FF0000 // Device Class
#define SYSCTL_DID0_CLASS_S         16         // Device Class
#define SYSCTL_DID0_MAJ_M           0x0000FF00 // Major Revision
#define SYSCTL_DID0_MAJ_S           8          // Major Revision
#define SYSCTL_DID0_MAJ_REVA_V      0x00000000 // Revision A (initial device)
#define SYSCTL_DID0_MAJ_REVB_V      0x00000100 // Revision B (first base layer
#define SYSCTL_DID0_MAJ_REVC_V      0x00000200 // Revision C (second base layer
#define SYSCTL_DID0_MIN_M           0x000000FF // Minor Revision
#define SYSCTL_DID0_MIN_S           0          // Minor Revision
#define SYSCTL_DID0_MIN_0_V         0x00000000 // Initial device, or a major
#define SYSCTL_DID0_MIN_1_V         0x00000001 // First metal layer change
#define SYSCTL_DID0_MIN_2_V         0x00000002 // Second metal layer change

/* Bit/Fields in Register DID1 of Module SYSCTL                               */
#define SYSCTL_DID1_VER_M           0xF0000000 // DID1 Version
#define SYSCTL_DID1_VER_S           28         // DID1 Version
#define SYSCTL_DID1_VER_1_V         0x10000000 // fury_ib
#define SYSCTL_DID1_FAM_M           0x0F000000 // Family
#define SYSCTL_DID1_FAM_S           24         // Family
#define SYSCTL_DID1_FAM_TIVA_V      0x00000000 // Tiva family of microcontollers
#define SYSCTL_DID1_PRTNO_M         0x00FF0000 // Part Number
#define SYSCTL_DID1_PRTNO_S         16         // Part Number
#define SYSCTL_DID1_PINCNT_M        0x0000E000 // Package Pin Count
#define SYSCTL_DID1_PINCNT_S        13         // Package Pin Count
#define SYSCTL_DID1_PINCNT_100_V    0x00004000 // 100-pin LQFP package
#define SYSCTL_DID1_PINCNT_64_V     0x00006000 // 64-pin LQFP package
#define SYSCTL_DID1_PINCNT_144_V    0x00008000 // 144-pin LQFP package
#define SYSCTL_DID1_PINCNT_157_V    0x0000A000 // 157-pin BGA package
#define SYSCTL_DID1_PINCNT_128_V    0x0000C000 // 128-pin TQFP package
#define SYSCTL_DID1_TEMP_M          0x000000E0 // Temperature Range
#define SYSCTL_DID1_TEMP_S          5          // Temperature Range
#define SYSCTL_DID1_TEMP_I_V        0x00000020 // Industrial temperature range
#define SYSCTL_DID1_TEMP_E_V        0x00000040 // Extended temperature range
#define SYSCTL_DID1_TEMP_IE_V       0x00000060 // Available in both industrial
#define SYSCTL_DID1_PKG_M           0x00000018 // Package Type
#define SYSCTL_DID1_PKG_S           3          // Package Type
#define SYSCTL_DID1_PKG_QFP_V       0x00000008 // QFP package
#define SYSCTL_DID1_PKG_BGA_V       0x00000010 // BGA package
#define SYSCTL_DID1_ROHS_B          0x00000004 // RoHS-Compliance
#define SYSCTL_DID1_QUAL_M          0x00000003 // Qualification Status
#define SYSCTL_DID1_QUAL_S          0          // Qualification Status
#define SYSCTL_DID1_QUAL_ES_V       0x00000000 // Engineering Sample (unqualified)
#define SYSCTL_DID1_QUAL_PP_V       0x00000001 // Pilot Production (unqualified)
#define SYSCTL_DID1_QUAL_FQ_V       0x00000002 // Fully Qualified

/* Bit/Fields in Register DC0 of Module SYSCTL                                */
#define SYSCTL_DC0_SRAMSZ_M         0xFFFF0000 // SRAM Size
#define SYSCTL_DC0_SRAMSZ_S         16         // SRAM Size
#define SYSCTL_DC0_SRAMSZ_2KB_V     0x00070000 // 2 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_4KB_V     0x000F0000 // 4 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_6KB_V     0x00170000 // 6 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_8KB_V     0x001F0000 // 8 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_12KB_V    0x002F0000 // 12 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_16KB_V    0x003F0000 // 16 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_20KB_V    0x004F0000 // 20 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_24KB_V    0x005F0000 // 24 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_32KB_V    0x007F0000 // 32 KB of SRAM
#define SYSCTL_DC0_FLASHSZ_M        0x0000FFFF // Flash Size
#define SYSCTL_DC0_FLASHSZ_S        0          // Flash Size
#define SYSCTL_DC0_FLASHSZ_8KB_V    0x00000003 // 8 KB of Flash
#define SYSCTL_DC0_FLASHSZ_16KB_V   0x00000007 // 16 KB of Flash
#define SYSCTL_DC0_FLASHSZ_32KB_V   0x0000000F // 32 KB of Flash
#define SYSCTL_DC0_FLASHSZ_64KB_V   0x0000001F // 64 KB of Flash
#define SYSCTL_DC0_FLASHSZ_96KB_V   0x0000002F // 96 KB of Flash
#define SYSCTL_DC0_FLASHSZ_128K_V   0x0000003F // 128 KB of Flash
#define SYSCTL_DC0_FLASHSZ_192K_V   0x0000005F // 192 KB of Flash
#define SYSCTL_DC0_FLASHSZ_256K_V   0x0000007F // 256 KB of Flash

/* Bit/Fields in Register DC1 of Module SYSCTL                                */
#define SYSCTL_DC1_WDT1_B           0x10000000 // Watchdog Timer1 Present
#define SYSCTL_DC1_CAN1_B           0x02000000 // CAN Module 1 Present
#define SYSCTL_DC1_CAN0_B           0x01000000 // CAN Module 0 Present
#define SYSCTL_DC1_PWM1_B           0x00200000 // PWM Module 1 Present
#define SYSCTL_DC1_PWM0_B           0x00100000 // PWM Module 0 Present
#define SYSCTL_DC1_ADC1_B           0x00020000 // ADC Module 1 Present
#define SYSCTL_DC1_ADC0_B           0x00010000 // ADC Module 0 Present
#define SYSCTL_DC1_MINSYSDIV_M      0x0000F000 // System Clock Divider
#define SYSCTL_DC1_MINSYSDIV_S      12         // System Clock Divider
#define SYSCTL_DC1_MINSYSDIV_80_V   0x00001000 // Specifies an 80-MHz CPU clock
#define SYSCTL_DC1_MINSYSDIV_66_V   0x00002000 // Specifies a 66-MHz CPU clock
#define SYSCTL_DC1_MINSYSDIV_50_V   0x00003000 // Specifies a 50-MHz CPU clock
#define SYSCTL_DC1_MINSYSDIV_40_V   0x00004000 // Specifies a 40-MHz CPU clock
#define SYSCTL_DC1_MINSYSDIV_25_V   0x00007000 // Specifies a 25-MHz clock with a
#define SYSCTL_DC1_MINSYSDIV_20_V   0x00009000 // Specifies a 20-MHz clock with a
#define SYSCTL_DC1_ADC1SPD_M        0x00000C00 // Max ADC1 Speed
#define SYSCTL_DC1_ADC1SPD_S        10         // Max ADC1 Speed
#define SYSCTL_DC1_ADC1SPD_125K_V   0x00000000 // 125K samples/second
#define SYSCTL_DC1_ADC1SPD_250K_V   0x00000400 // 250K samples/second
#define SYSCTL_DC1_ADC1SPD_500K_V   0x00000800 // 500K samples/second
#define SYSCTL_DC1_ADC1SPD_1M_V     0x00000C00 // 1M samples/second
#define SYSCTL_DC1_ADC0SPD_M        0x00000300 // Max ADC0 Speed
#define SYSCTL_DC1_ADC0SPD_S        8          // Max ADC0 Speed
#define SYSCTL_DC1_ADC0SPD_125K_V   0x00000000 // 125K samples/second
#define SYSCTL_DC1_ADC0SPD_250K_V   0x00000100 // 250K samples/second
#define SYSCTL_DC1_ADC0SPD_500K_V   0x00000200 // 500K samples/second
#define SYSCTL_DC1_ADC0SPD_1M_V     0x00000300 // 1M samples/second
#define SYSCTL_DC1_MPU_B            0x00000080 // MPU Present
#define SYSCTL_DC1_HIB_B            0x00000040 // Hibernation Module Present
#define SYSCTL_DC1_TEMP_B           0x00000020 // Temp Sensor Present
#define SYSCTL_DC1_PLL_B            0x00000010 // PLL Present
#define SYSCTL_DC1_WDT0_B           0x00000008 // Watchdog Timer 0 Present
#define SYSCTL_DC1_SWO_B            0x00000004 // SWO Trace Port Present
#define SYSCTL_DC1_SWD_B            0x00000002 // SWD Present
#define SYSCTL_DC1_JTAG_B           0x00000001 // JTAG Present

/* Bit/Fields in Register DC2 of Module SYSCTL                                */
#define SYSCTL_DC2_EPI0_B           0x40000000 // EPI Module 0 Present
#define SYSCTL_DC2_I2S0_B           0x10000000 // I2S Module 0 Present
#define SYSCTL_DC2_COMP2_B          0x04000000 // Analog Comparator 2 Present
#define SYSCTL_DC2_COMP1_B          0x02000000 // Analog Comparator 1 Present
#define SYSCTL_DC2_COMP0_B          0x01000000 // Analog Comparator 0 Present
#define SYSCTL_DC2_TIMER3_B         0x00080000 // Timer Module 3 Present
#define SYSCTL_DC2_TIMER2_B         0x00040000 // Timer Module 2 Present
#define SYSCTL_DC2_TIMER1_B         0x00020000 // Timer Module 1 Present
#define SYSCTL_DC2_TIMER0_B         0x00010000 // Timer Module 0 Present
#define SYSCTL_DC2_I2C1HS_B         0x00008000 // I2C Module 1 Speed
#define SYSCTL_DC2_I2C1_B           0x00004000 // I2C Module 1 Present
#define SYSCTL_DC2_I2C0HS_B         0x00002000 // I2C Module 0 Speed
#define SYSCTL_DC2_I2C0_B           0x00001000 // I2C Module 0 Present
#define SYSCTL_DC2_QEI1_B           0x00000200 // QEI Module 1 Present
#define SYSCTL_DC2_QEI0_B           0x00000100 // QEI Module 0 Present
#define SYSCTL_DC2_SSI1_B           0x00000020 // SSI Module 1 Present
#define SYSCTL_DC2_SSI0_B           0x00000010 // SSI Module 0 Present
#define SYSCTL_DC2_UART2_B          0x00000004 // UART Module 2 Present
#define SYSCTL_DC2_UART1_B          0x00000002 // UART Module 1 Present
#define SYSCTL_DC2_UART0_B          0x00000001 // UART Module 0 Present

