hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register DC3 of Module SYSCTL                                */
#define SYSCTL_DC3_32KHZ_B          0x80000000 // 32KHz Input Clock Available
#define SYSCTL_DC3_CCP5_B           0x20000000 // T2CCP1 Pin Present
#define SYSCTL_DC3_CCP4_B           0x10000000 // T2CCP0 Pin Present
#define SYSCTL_DC3_CCP3_B           0x08000000 // T1CCP1 Pin Present
#define SYSCTL_DC3_CCP2_B           0x04000000 // T1CCP0 Pin Present
#define SYSCTL_DC3_CCP1_B           0x02000000 // T0CCP1 Pin Present
#define SYSCTL_DC3_CCP0_B           0x01000000 // T0CCP0 Pin Present
#define SYSCTL_DC3_ADC0AIN7_B       0x00800000 // ADC Module 0 AIN7 Pin Present
#define SYSCTL_DC3_ADC0AIN6_B       0x00400000 // ADC Module 0 AIN6 Pin Present
#define SYSCTL_DC3_ADC0AIN5_B       0x00200000 // ADC Module 0 AIN5 Pin Present
#define SYSCTL_DC3_ADC0AIN4_B       0x00100000 // ADC Module 0 AIN4 Pin Present
#define SYSCTL_DC3_ADC0AIN3_B       0x00080000 // ADC Module 0 AIN3 Pin Present
#define SYSCTL_DC3_ADC0AIN2_B       0x00040000 // ADC Module 0 AIN2 Pin Present
#define SYSCTL_DC3_ADC0AIN1_B       0x00020000 // ADC Module 0 AIN1 Pin Present
#define SYSCTL_DC3_ADC0AIN0_B       0x00010000 // ADC Module 0 AIN0 Pin Present
#define SYSCTL_DC3_PWMFAULT_B       0x00008000 // PWM Fault Pin Present
#define SYSCTL_DC3_C2O_B            0x00004000 // C2o Pin Present
#define SYSCTL_DC3_C2PLUS_B         0x00002000 // C2+ Pin Present
#define SYSCTL_DC3_C2MINUS_B        0x00001000 // C2- Pin Present
#define SYSCTL_DC3_C1O_B            0x00000800 // C1o Pin Present
#define SYSCTL_DC3_C1PLUS_B         0x00000400 // C1+ Pin Present
#define SYSCTL_DC3_C1MINUS_B        0x00000200 // C1- Pin Present
#define SYSCTL_DC3_C0O_B            0x00000100 // C0o Pin Present
#define SYSCTL_DC3_C0PLUS_B         0x00000080 // C0+ Pin Present
#define SYSCTL_DC3_C0MINUS_B        0x00000040 // C0- Pin Present
#define SYSCTL_DC3_PWM5_B           0x00000020 // PWM5 Pin Present
#define SYSCTL_DC3_PWM4_B           0x00000010 // PWM4 Pin Present
#define SYSCTL_DC3_PWM3_B           0x00000008 // PWM3 Pin Present
#define SYSCTL_DC3_PWM2_B           0x00000004 // PWM2 Pin Present
#define SYSCTL_DC3_PWM1_B           0x00000002 // PWM1 Pin Present
#define SYSCTL_DC3_PWM0_B           0x00000001 // PWM0 Pin Present

/* Bit/Fields in Register DC4 of Module SYSCTL                                */
#define SYSCTL_DC4_EPHY0_B          0x40000000 // Ethernet PHY Layer 0 Present
#define SYSCTL_DC4_EMAC0_B          0x10000000 // Ethernet MAC Layer 0 Present
#define SYSCTL_DC4_E1588_B          0x01000000 // 1588 Capable
#define SYSCTL_DC4_PICAL_B          0x00040000 // PIOSC Calibrate
#define SYSCTL_DC4_CCP7_B           0x00008000 // T3CCP1 Pin Present
#define SYSCTL_DC4_CCP6_B           0x00004000 // T3CCP0 Pin Present
#define SYSCTL_DC4_UDMA_B           0x00002000 // Micro-DMA Module Present
#define SYSCTL_DC4_ROM_B            0x00001000 // Internal Code ROM Present
#define SYSCTL_DC4_GPIOJ_B          0x00000100 // GPIO Port J Present
#define SYSCTL_DC4_GPIOH_B          0x00000080 // GPIO Port H Present
#define SYSCTL_DC4_GPIOG_B          0x00000040 // GPIO Port G Present
#define SYSCTL_DC4_GPIOF_B          0x00000020 // GPIO Port F Present
#define SYSCTL_DC4_GPIOE_B          0x00000010 // GPIO Port E Present
#define SYSCTL_DC4_GPIOD_B          0x00000008 // GPIO Port D Present
#define SYSCTL_DC4_GPIOC_B          0x00000004 // GPIO Port C Present
#define SYSCTL_DC4_GPIOB_B          0x00000002 // GPIO Port B Present
#define SYSCTL_DC4_GPIOA_B          0x00000001 // GPIO Port A Present

/* Bit/Fields in Register DC5 of Module SYSCTL                                */
#define SYSCTL_DC5_PWMFAULT3_B      0x08000000 // PWM Fault 3 Pin Present
#define SYSCTL_DC5_PWMFAULT2_B      0x04000000 // PWM Fault 2 Pin Present
#define SYSCTL_DC5_PWMFAULT1_B      0x02000000 // PWM Fault 1 Pin Present
#define SYSCTL_DC5_PWMFAULT0_B      0x01000000 // PWM Fault 0 Pin Present
#define SYSCTL_DC5_PWMEFLT_B        0x00200000 // PWM Extended Fault Active
#define SYSCTL_DC5_PWMESYNC_B       0x00100000 // PWM Extended SYNC Active
#define SYSCTL_DC5_PWM7_B           0x00000080 // PWM7 Pin Present
#define SYSCTL_DC5_PWM6_B           0x00000040 // PWM6 Pin Present
#define SYSCTL_DC5_PWM5_B           0x00000020 // PWM5 Pin Present
#define SYSCTL_DC5_PWM4_B           0x00000010 // PWM4 Pin Present
#define SYSCTL_DC5_PWM3_B           0x00000008 // PWM3 Pin Present
#define SYSCTL_DC5_PWM2_B           0x00000004 // PWM2 Pin Present
#define SYSCTL_DC5_PWM1_B           0x00000002 // PWM1 Pin Present
#define SYSCTL_DC5_PWM0_B           0x00000001 // PWM0 Pin Present

/* Bit/Fields in Register DC6 of Module SYSCTL                                */
#define SYSCTL_DC6_USB0PHY_B        0x00000010 // USB Module 0 PHY Present
#define SYSCTL_DC6_USB0_M           0x00000003 // USB Module 0 Present
#define SYSCTL_DC6_USB0_S           0          // USB Module 0 Present
#define SYSCTL_DC6_USB0_DEV_V       0x00000001 // USB0 is Device Only
#define SYSCTL_DC6_USB0_HOSTDEV_V   0x00000002 // USB is Device or Host
#define SYSCTL_DC6_USB0_OTG_V       0x00000003 // USB0 is OTG

/* Bit/Fields in Register DC7 of Module SYSCTL                                */
#define SYSCTL_DC7_DMACH30_B        0x40000000 // DMA Channel 30
#define SYSCTL_DC7_DMACH29_B        0x20000000 // DMA Channel 29
#define SYSCTL_DC7_DMACH28_B        0x10000000 // DMA Channel 28
#define SYSCTL_DC7_DMACH27_B        0x08000000 // DMA Channel 27
#define SYSCTL_DC7_DMACH26_B        0x04000000 // DMA Channel 26
#define SYSCTL_DC7_DMACH25_B        0x02000000 // DMA Channel 25
#define SYSCTL_DC7_DMACH24_B        0x01000000 // DMA Channel 24
#define SYSCTL_DC7_DMACH23_B        0x00800000 // DMA Channel 23
#define SYSCTL_DC7_DMACH22_B        0x00400000 // DMA Channel 22
#define SYSCTL_DC7_DMACH21_B        0x00200000 // DMA Channel 21
#define SYSCTL_DC7_DMACH20_B        0x00100000 // DMA Channel 20
#define SYSCTL_DC7_DMACH19_B        0x00080000 // DMA Channel 19
#define SYSCTL_DC7_DMACH18_B        0x00040000 // DMA Channel 18
#define SYSCTL_DC7_DMACH17_B        0x00020000 // DMA Channel 17
#define SYSCTL_DC7_DMACH16_B        0x00010000 // DMA Channel 16
#define SYSCTL_DC7_DMACH15_B        0x00008000 // DMA Channel 15
#define SYSCTL_DC7_DMACH14_B        0x00004000 // DMA Channel 14
#define SYSCTL_DC7_DMACH13_B        0x00002000 // DMA Channel 13
#define SYSCTL_DC7_DMACH12_B        0x00001000 // DMA Channel 12
#define SYSCTL_DC7_DMACH11_B        0x00000800 // DMA Channel 11
#define SYSCTL_DC7_DMACH10_B        0x00000400 // DMA Channel 10
#define SYSCTL_DC7_DMACH9_B         0x00000200 // DMA Channel 9
#define SYSCTL_DC7_DMACH8_B         0x00000100 // DMA Channel 8
#define SYSCTL_DC7_DMACH7_B         0x00000080 // DMA Channel 7
#define SYSCTL_DC7_DMACH6_B         0x00000040 // DMA Channel 6
#define SYSCTL_DC7_DMACH5_B         0x00000020 // DMA Channel 5
#define SYSCTL_DC7_DMACH4_B         0x00000010 // DMA Channel 4
#define SYSCTL_DC7_DMACH3_B         0x00000008 // DMA Channel 3
#define SYSCTL_DC7_DMACH2_B         0x00000004 // DMA Channel 2
#define SYSCTL_DC7_DMACH1_B         0x00000002 // DMA Channel 1
#define SYSCTL_DC7_DMACH0_B         0x00000001 // DMA Channel 0

/* Bit/Fields in Register DC8 of Module SYSCTL                                */
#define SYSCTL_DC8_ADC1AIN15_B      0x80000000 // ADC Module 1 AIN15 Pin Present
#define SYSCTL_DC8_ADC1AIN14_B      0x40000000 // ADC Module 1 AIN14 Pin Present
#define SYSCTL_DC8_ADC1AIN13_B      0x20000000 // ADC Module 1 AIN13 Pin Present
#define SYSCTL_DC8_ADC1AIN12_B      0x10000000 // ADC Module 1 AIN12 Pin Present
#define SYSCTL_DC8_ADC1AIN11_B      0x08000000 // ADC Module 1 AIN11 Pin Present
#define SYSCTL_DC8_ADC1AIN10_B      0x04000000 // ADC Module 1 AIN10 Pin Present
#define SYSCTL_DC8_ADC1AIN9_B       0x02000000 // ADC Module 1 AIN9 Pin Present
#define SYSCTL_DC8_ADC1AIN8_B       0x01000000 // ADC Module 1 AIN8 Pin Present
#define SYSCTL_DC8_ADC1AIN7_B       0x00800000 // ADC Module 1 AIN7 Pin Present
#define SYSCTL_DC8_ADC1AIN6_B       0x00400000 // ADC Module 1 AIN6 Pin Present
#define SYSCTL_DC8_ADC1AIN5_B       0x00200000 // ADC Module 1 AIN5 Pin Present
#define SYSCTL_DC8_ADC1AIN4_B       0x00100000 // ADC Module 1 AIN4 Pin Present
#define SYSCTL_DC8_ADC1AIN3_B       0x00080000 // ADC Module 1 AIN3 Pin Present
#define SYSCTL_DC8_ADC1AIN2_B       0x00040000 // ADC Module 1 AIN2 Pin Present
#define SYSCTL_DC8_ADC1AIN1_B       0x00020000 // ADC Module 1 AIN1 Pin Present
#define SYSCTL_DC8_ADC1AIN0_B       0x00010000 // ADC Module 1 AIN0 Pin Present
#define SYSCTL_DC8_ADC0AIN15_B      0x00008000 // ADC Module 0 AIN15 Pin Present
#define SYSCTL_DC8_ADC0AIN14_B      0x00004000 // ADC Module 0 AIN14 Pin Present
#define SYSCTL_DC8_ADC0AIN13_B      0x00002000 // ADC Module 0 AIN13 Pin Present
#define SYSCTL_DC8_ADC0AIN12_B      0x00001000 // ADC Module 0 AIN12 Pin Present
#define SYSCTL_DC8_ADC0AIN11_B      0x00000800 // ADC Module 0 AIN11 Pin Present
#define SYSCTL_DC8_ADC0AIN10_B      0x00000400 // ADC Module 0 AIN10 Pin Present
#define SYSCTL_DC8_ADC0AIN9_B       0x00000200 // ADC Module 0 AIN9 Pin Present
#define SYSCTL_DC8_ADC0AIN8_B       0x00000100 // ADC Module 0 AIN8 Pin Present
#define SYSCTL_DC8_ADC0AIN7_B       0x00000080 // ADC Module 0 AIN7 Pin Present
#define SYSCTL_DC8_ADC0AIN6_B       0x00000040 // ADC Module 0 AIN6 Pin Present
#define SYSCTL_DC8_ADC0AIN5_B       0x00000020 // ADC Module 0 AIN5 Pin Present
#define SYSCTL_DC8_ADC0AIN4_B       0x00000010 // ADC Module 0 AIN4 Pin Present
#define SYSCTL_DC8_ADC0AIN3_B       0x00000008 // ADC Module 0 AIN3 Pin Present
#define SYSCTL_DC8_ADC0AIN2_B       0x00000004 // ADC Module 0 AIN2 Pin Present
#define SYSCTL_DC8_ADC0AIN1_B       0x00000002 // ADC Module 0 AIN1 Pin Present
#define SYSCTL_DC8_ADC0AIN0_B       0x00000001 // ADC Module 0 AIN0 Pin Present

/* Bit/Fields in Register PBORCTL of Module SYSCTL                            */
#define SYSCTL_PBORCTL_BOR0_B       0x00000004 // VDD under BOR0 Event Action
#define SYSCTL_PBORCTL_BOR1_B       0x00000002 // VDD under BOR1 Event Action

/* Bit/Fields in Register SRCR0 of Module SYSCTL                              */
#define SYSCTL_SRCR0_WDT1_B         0x10000000 // WDT1 Reset Control
#define SYSCTL_SRCR0_CAN1_B         0x02000000 // CAN1 Reset Control
#define SYSCTL_SRCR0_CAN0_B         0x01000000 // CAN0 Reset Control
#define SYSCTL_SRCR0_PWM0_B         0x00100000 // PWM Reset Control
#define SYSCTL_SRCR0_ADC1_B         0x00020000 // ADC1 Reset Control
#define SYSCTL_SRCR0_ADC0_B         0x00010000 // ADC0 Reset Control
#define SYSCTL_SRCR0_HIB_B          0x00000040 // HIB Reset Control
#define SYSCTL_SRCR0_WDT0_B         0x00000008 // WDT0 Reset Control

