hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register SRCR1 of Module SYSCTL                              */
#define SYSCTL_SRCR1_COMP1_B        0x02000000 // Analog Comp 1 Reset Control
#define SYSCTL_SRCR1_COMP0_B        0x01000000 // Analog Comp 0 Reset Control
#define SYSCTL_SRCR1_TIMER3_B       0x00080000 // Timer 3 Reset Control
#define SYSCTL_SRCR1_TIMER2_B       0x00040000 // Timer 2 Reset Control
#define SYSCTL_SRCR1_TIMER1_B       0x00020000 // Timer 1 Reset Control
#define SYSCTL_SRCR1_TIMER0_B       0x00010000 // Timer 0 Reset Control
#define SYSCTL_SRCR1_I2C1_B         0x00004000 // I2C1 Reset Control
#define SYSCTL_SRCR1_I2C0_B         0x00001000 // I2C0 Reset Control
#define SYSCTL_SRCR1_QEI1_B         0x00000200 // QEI1 Reset Control
#define SYSCTL_SRCR1_QEI0_B         0x00000100 // QEI0 Reset Control
#define SYSCTL_SRCR1_SSI1_B         0x00000020 // SSI1 Reset Control
#define SYSCTL_SRCR1_SSI0_B         0x00000010 // SSI0 Reset Control
#define SYSCTL_SRCR1_UART2_B        0x00000004 // UART2 Reset Control
#define SYSCTL_SRCR1_UART1_B        0x00000002 // UART1 Reset Control
#define SYSCTL_SRCR1_UART0_B        0x00000001 // UART0 Reset Control

/* Bit/Fields in Register SRCR2 of Module SYSCTL                              */
#define SYSCTL_SRCR2_USB0_B         0x00010000 // USB0 Reset Control
#define SYSCTL_SRCR2_UDMA_B         0x00002000 // Micro-DMA Reset Control
#define SYSCTL_SRCR2_GPIOF_B        0x00000020 // Port F Reset Control
#define SYSCTL_SRCR2_GPIOE_B        0x00000010 // Port E Reset Control
#define SYSCTL_SRCR2_GPIOD_B        0x00000008 // Port D Reset Control
#define SYSCTL_SRCR2_GPIOC_B        0x00000004 // Port C Reset Control
#define SYSCTL_SRCR2_GPIOB_B        0x00000002 // Port B Reset Control
#define SYSCTL_SRCR2_GPIOA_B        0x00000001 // Port A Reset Control

/* Bit/Fields in Register RIS of Module SYSCTL                                */
#define SYSCTL_RIS_BOR0RIS_B        0x00000800 // VDD under BOR0 Raw Interrupt
#define SYSCTL_RIS_VDDARIS_B        0x00000400 // VDDA Power OK Event Raw
#define SYSCTL_RIS_MOSCPUPRIS_B     0x00000100 // MOSC Power Up Raw Interrupt
#define SYSCTL_RIS_USBPLLLRIS_B     0x00000080 // USB PLL Lock Raw Interrupt
#define SYSCTL_RIS_PLLLRIS_B        0x00000040 // PLL Lock Raw Interrupt Status
#define SYSCTL_RIS_MOFRIS_B         0x00000008 // Main Oscillator Failure Raw
#define SYSCTL_RIS_BOR1RIS_B        0x00000002 // VDD under BOR1 Raw Interrupt

/* Bit/Fields in Register IMC of Module SYSCTL                                */
#define SYSCTL_IMC_BOR0IM_B         0x00000800 // VDD under BOR0 Interrupt Mask
#define SYSCTL_IMC_VDDAIM_B         0x00000400 // VDDA Power OK Interrupt Mask
#define SYSCTL_IMC_MOSCPUPIM_B      0x00000100 // MOSC Power Up Interrupt Mask
#define SYSCTL_IMC_USBPLLLIM_B      0x00000080 // USB PLL Lock Interrupt Mask
#define SYSCTL_IMC_PLLLIM_B         0x00000040 // PLL Lock Interrupt Mask
#define SYSCTL_IMC_MOFIM_B          0x00000008 // Main Oscillator Failure
#define SYSCTL_IMC_BOR1IM_B         0x00000002 // VDD under BOR1 Interrupt Mask

/* Bit/Fields in Register MISC of Module SYSCTL                               */
#define SYSCTL_MISC_BOR0MIS_B       0x00000800 // VDD under BOR0 Masked Interrupt
#define SYSCTL_MISC_VDDAMIS_B       0x00000400 // VDDA Power OK Masked Interrupt
#define SYSCTL_MISC_MOSCPUPMIS_B    0x00000100 // MOSC Power Up Masked Interrupt
#define SYSCTL_MISC_USBPLLLMIS_B    0x00000080 // USB PLL Lock Masked Interrupt
#define SYSCTL_MISC_PLLLMIS_B       0x00000040 // PLL Lock Masked Interrupt Status
#define SYSCTL_MISC_MOFMIS_B        0x00000008 // Main Oscillator Failure Masked
#define SYSCTL_MISC_BOR1MIS_B       0x00000002 // VDD under BOR1 Masked Interrupt

/* Bit/Fields in Register RESC of Module SYSCTL                               */
#define SYSCTL_RESC_MOSCFAIL_B      0x00010000 // MOSC Failure Reset
#define SYSCTL_RESC_WDT1_B          0x00000020 // Watchdog Timer 1 Reset
#define SYSCTL_RESC_SW_B            0x00000010 // Software Reset
#define SYSCTL_RESC_WDT0_B          0x00000008 // Watchdog Timer 0 Reset
#define SYSCTL_RESC_BOR_B           0x00000004 // Brown-Out Reset
#define SYSCTL_RESC_POR_B           0x00000002 // Power-On Reset
#define SYSCTL_RESC_EXT_B           0x00000001 // External Reset

/* Bit/Fields in Register RCC of Module SYSCTL                                */
#define SYSCTL_RCC_ACG_B            0x08000000 // Auto Clock Gating
#define SYSCTL_RCC_SYSDIV_M         0x07800000 // System Clock Divisor
#define SYSCTL_RCC_SYSDIV_S         23         // System Clock Divisor
#define SYSCTL_RCC_USESYSDIV_B      0x00400000 // Enable System Clock Divider
#define SYSCTL_RCC_USEPWMDIV_B      0x00100000 // Enable PWM Clock Divisor
#define SYSCTL_RCC_PWMDIV_M         0x000E0000 // PWM Unit Clock Divisor
#define SYSCTL_RCC_PWMDIV_S         17         // PWM Unit Clock Divisor
#define SYSCTL_RCC_PWMDIV_2_V       0x00000000 // PWM clock /2
#define SYSCTL_RCC_PWMDIV_4_V       0x00020000 // PWM clock /4
#define SYSCTL_RCC_PWMDIV_8_V       0x00040000 // PWM clock /8
#define SYSCTL_RCC_PWMDIV_16_V      0x00060000 // PWM clock /16
#define SYSCTL_RCC_PWMDIV_32_V      0x00080000 // PWM clock /32
#define SYSCTL_RCC_PWMDIV_64_V      0x000A0000 // PWM clock /64
#define SYSCTL_RCC_PWRDN_B          0x00002000 // PLL Power Down
#define SYSCTL_RCC_BYPASS_B         0x00000800 // PLL Bypass
#define SYSCTL_RCC_XTAL_M           0x000007C0 // Crystal Value
#define SYSCTL_RCC_XTAL_S           6          // Crystal Value
#define SYSCTL_RCC_XTAL_4MHZ_V      0x00000180 // 4 MHz
#define SYSCTL_RCC_XTAL_4_09MHZ_V   0x000001C0 // 4.096 MHz
#define SYSCTL_RCC_XTAL_4_91MHZ_V   0x00000200 // 4.9152 MHz
#define SYSCTL_RCC_XTAL_5MHZ_V      0x00000240 // 5 MHz
#define SYSCTL_RCC_XTAL_5_12MHZ_V   0x00000280 // 5.12 MHz
#define SYSCTL_RCC_XTAL_6MHZ_V      0x000002C0 // 6 MHz
#define SYSCTL_RCC_XTAL_6_14MHZ_V   0x00000300 // 6.144 MHz
#define SYSCTL_RCC_XTAL_7_37MHZ_V   0x00000340 // 7.3728 MHz
#define SYSCTL_RCC_XTAL_8MHZ_V      0x00000380 // 8 MHz
#define SYSCTL_RCC_XTAL_8_19MHZ_V   0x000003C0 // 8.192 MHz
#define SYSCTL_RCC_XTAL_10MHZ_V     0x00000400 // 10 MHz
#define SYSCTL_RCC_XTAL_12MHZ_V     0x00000440 // 12 MHz
#define SYSCTL_RCC_XTAL_12_2MHZ_V   0x00000480 // 12.288 MHz
#define SYSCTL_RCC_XTAL_13_5MHZ_V   0x000004C0 // 13.56 MHz
#define SYSCTL_RCC_XTAL_14_3MHZ_V   0x00000500 // 14.31818 MHz
#define SYSCTL_RCC_XTAL_16MHZ_V     0x00000540 // 16 MHz
#define SYSCTL_RCC_XTAL_16_3MHZ_V   0x00000580 // 16.384 MHz
#define SYSCTL_RCC_XTAL_18MHZ_V     0x000005C0 // 18.0 MHz (USB)
#define SYSCTL_RCC_XTAL_20MHZ_V     0x00000600 // 20.0 MHz (USB)
#define SYSCTL_RCC_XTAL_24MHZ_V     0x00000640 // 24.0 MHz (USB)
#define SYSCTL_RCC_XTAL_25MHZ_V     0x00000680 // 25.0 MHz (USB)
#define SYSCTL_RCC_OSCSRC_M         0x00000030 // Oscillator Source
#define SYSCTL_RCC_OSCSRC_S         4          // Oscillator Source
#define SYSCTL_RCC_OSCSRC_MOSC_V    0x00000000 // MOSC
#define SYSCTL_RCC_OSCSRC_IOSC_V    0x00000010 // IOSC
#define SYSCTL_RCC_OSCSRC_IOSC_4_V  0x00000020 // IOSC/4
#define SYSCTL_RCC_OSCSRC_LFIOSC_V  0x00000030 // LFIOSC
#define SYSCTL_RCC_MOSCDIS_B        0x00000001 // Main Oscillator Disable

