hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register GPIOHBCTL of Module SYSCTL                          */
#define SYSCTL_GPIOHBCTL_PORTF_B    0x00000020 // Port F Advanced High-Performance
#define SYSCTL_GPIOHBCTL_PORTE_B    0x00000010 // Port E Advanced High-Performance
#define SYSCTL_GPIOHBCTL_PORTD_B    0x00000008 // Port D Advanced High-Performance
#define SYSCTL_GPIOHBCTL_PORTC_B    0x00000004 // Port C Advanced High-Performance
#define SYSCTL_GPIOHBCTL_PORTB_B    0x00000002 // Port B Advanced High-Performance
#define SYSCTL_GPIOHBCTL_PORTA_B    0x00000001 // Port A Advanced High-Performance

/* Bit/Fields in Register RCC2 of Module SYSCTL                               */
#define SYSCTL_RCC2_USERCC2_B       0x80000000 // Use RCC2
#define SYSCTL_RCC2_DIV400_B        0x40000000 // Divide PLL as 400 MHz vs. 200
#define SYSCTL_RCC2_SYSDIV2_M       0x1F800000 // System Clock Divisor 2
#define SYSCTL_RCC2_SYSDIV2_S       23         // System Clock Divisor 2
#define SYSCTL_RCC2_SYSDIV2LSB_B    0x00400000 // Additional LSB for SYSDIV2
#define SYSCTL_RCC2_USBPWRDN_B      0x00004000 // Power-Down USB PLL
#define SYSCTL_RCC2_PWRDN2_B        0x00002000 // Power-Down PLL 2
#define SYSCTL_RCC2_BYPASS2_B       0x00000800 // PLL Bypass 2
#define SYSCTL_RCC2_OSCSRC2_M       0x00000070 // Oscillator Source 2
#define SYSCTL_RCC2_OSCSRC2_S       4          // Oscillator Source 2
#define SYSCTL_RCC2_OSCSRC2_MOSC_V   0x00000000 // MOSC
#define SYSCTL_RCC2_OSCSRC2_IOSC_V   0x00000010 // PIOSC
#define SYSCTL_RCC2_OSCSRC2_IOSC_4_V 0x00000020 // PIOSC/4
#define SYSCTL_RCC2_OSCSRC2_LFIOSC_V 0x00000030 // LFIOSC
#define SYSCTL_RCC2_OSCSRC2_HIBOSC_V 0x00000070 // 32.768 kHz

/* Bit/Fields in Register MOSCCTL of Module SYSCTL                            */
#define SYSCTL_MOSCCTL_NOXTAL_B     0x00000004 // No Crystal Connected
#define SYSCTL_MOSCCTL_MOSCIM_B     0x00000002 // MOSC Failure Action
#define SYSCTL_MOSCCTL_CVAL_B       0x00000001 // Clock Validation for MOSC

/* Bit/Fields in Register RCGC0 of Module SYSCTL                              */
#define SYSCTL_RCGC0_WDT1_B         0x10000000 // WDT1 Clock Gating Control
#define SYSCTL_RCGC0_CAN1_B         0x02000000 // CAN1 Clock Gating Control
#define SYSCTL_RCGC0_CAN0_B         0x01000000 // CAN0 Clock Gating Control
#define SYSCTL_RCGC0_PWM0_B         0x00100000 // PWM Clock Gating Control
#define SYSCTL_RCGC0_ADC1_B         0x00020000 // ADC1 Clock Gating Control
#define SYSCTL_RCGC0_ADC0_B         0x00010000 // ADC0 Clock Gating Control
#define SYSCTL_RCGC0_ADC1SPD_M      0x00000C00 // ADC1 Sample Speed
#define SYSCTL_RCGC0_ADC1SPD_S      10         // ADC1 Sample Speed
#define SYSCTL_RCGC0_ADC1SPD_1M_V   0x00000C00 // 1M samples/second
#define SYSCTL_RCGC0_ADC0SPD_M      0x00000300 // ADC0 Sample Speed
#define SYSCTL_RCGC0_ADC0SPD_S      8          // ADC0 Sample Speed
#define SYSCTL_RCGC0_ADC0SPD_1M_V   0x00000300 // 1M samples/second
#define SYSCTL_RCGC0_HIB_B          0x00000040 // HIB Clock Gating Control
#define SYSCTL_RCGC0_WDT0_B         0x00000008 // WDT0 Clock Gating Control

/* Bit/Fields in Register RCGC1 of Module SYSCTL                              */
#define SYSCTL_RCGC1_COMP1_B        0x02000000 // Analog Comparator 1 Clock Gating
#define SYSCTL_RCGC1_COMP0_B        0x01000000 // Analog Comparator 0 Clock Gating
#define SYSCTL_RCGC1_TIMER3_B       0x00080000 // Timer 3 Clock Gating Control
#define SYSCTL_RCGC1_TIMER2_B       0x00040000 // Timer 2 Clock Gating Control
#define SYSCTL_RCGC1_TIMER1_B       0x00020000 // Timer 1 Clock Gating Control
#define SYSCTL_RCGC1_TIMER0_B       0x00010000 // Timer 0 Clock Gating Control
#define SYSCTL_RCGC1_I2C1_B         0x00004000 // I2C1 Clock Gating Control
#define SYSCTL_RCGC1_I2C0_B         0x00001000 // I2C0 Clock Gating Control
#define SYSCTL_RCGC1_QEI1_B         0x00000200 // QEI1 Clock Gating Control
#define SYSCTL_RCGC1_QEI0_B         0x00000100 // QEI0 Clock Gating Control
#define SYSCTL_RCGC1_SSI1_B         0x00000020 // SSI1 Clock Gating Control
#define SYSCTL_RCGC1_SSI0_B         0x00000010 // SSI0 Clock Gating Control
#define SYSCTL_RCGC1_UART2_B        0x00000004 // UART2 Clock Gating Control
#define SYSCTL_RCGC1_UART1_B        0x00000002 // UART1 Clock Gating Control
#define SYSCTL_RCGC1_UART0_B        0x00000001 // UART0 Clock Gating Control

/* Bit/Fields in Register RCGC2 of Module SYSCTL                              */
#define SYSCTL_RCGC2_USB0_B         0x00010000 // USB0 Clock Gating Control
#define SYSCTL_RCGC2_UDMA_B         0x00002000 // Micro-DMA Clock Gating Control
#define SYSCTL_RCGC2_GPIOF_B        0x00000020 // Port F Clock Gating Control
#define SYSCTL_RCGC2_GPIOE_B        0x00000010 // Port E Clock Gating Control
#define SYSCTL_RCGC2_GPIOD_B        0x00000008 // Port D Clock Gating Control
#define SYSCTL_RCGC2_GPIOC_B        0x00000004 // Port C Clock Gating Control
#define SYSCTL_RCGC2_GPIOB_B        0x00000002 // Port B Clock Gating Control
#define SYSCTL_RCGC2_GPIOA_B        0x00000001 // Port A Clock Gating Control

/* Bit/Fields in Register SCGC0 of Module SYSCTL                              */
#define SYSCTL_SCGC0_WDT1_B         0x10000000 // WDT1 Clock Gating Control
#define SYSCTL_SCGC0_CAN1_B         0x02000000 // CAN1 Clock Gating Control
#define SYSCTL_SCGC0_CAN0_B         0x01000000 // CAN0 Clock Gating Control
#define SYSCTL_SCGC0_PWM0_B         0x00100000 // PWM Clock Gating Control
#define SYSCTL_SCGC0_ADC1_B         0x00020000 // ADC1 Clock Gating Control
#define SYSCTL_SCGC0_ADC0_B         0x00010000 // ADC0 Clock Gating Control
#define SYSCTL_SCGC0_HIB_B          0x00000040 // HIB Clock Gating Control
#define SYSCTL_SCGC0_WDT0_B         0x00000008 // WDT0 Clock Gating Control

/* Bit/Fields in Register SCGC1 of Module SYSCTL                              */
#define SYSCTL_SCGC1_COMP1_B        0x02000000 // Analog Comparator 1 Clock Gating
#define SYSCTL_SCGC1_COMP0_B        0x01000000 // Analog Comparator 0 Clock Gating
#define SYSCTL_SCGC1_TIMER3_B       0x00080000 // Timer 3 Clock Gating Control
#define SYSCTL_SCGC1_TIMER2_B       0x00040000 // Timer 2 Clock Gating Control
#define SYSCTL_SCGC1_TIMER1_B       0x00020000 // Timer 1 Clock Gating Control
#define SYSCTL_SCGC1_TIMER0_B       0x00010000 // Timer 0 Clock Gating Control
#define SYSCTL_SCGC1_I2C1_B         0x00004000 // I2C1 Clock Gating Control
#define SYSCTL_SCGC1_I2C0_B         0x00001000 // I2C0 Clock Gating Control
#define SYSCTL_SCGC1_QEI1_B         0x00000200 // QEI1 Clock Gating Control
#define SYSCTL_SCGC1_QEI0_B         0x00000100 // QEI0 Clock Gating Control
#define SYSCTL_SCGC1_SSI1_B         0x00000020 // SSI1 Clock Gating Control
#define SYSCTL_SCGC1_SSI0_B         0x00000010 // SSI0 Clock Gating Control
#define SYSCTL_SCGC1_UART2_B        0x00000004 // UART2 Clock Gating Control
#define SYSCTL_SCGC1_UART1_B        0x00000002 // UART1 Clock Gating Control
#define SYSCTL_SCGC1_UART0_B        0x00000001 // UART0 Clock Gating Control

/* Bit/Fields in Register SCGC2 of Module SYSCTL                              */
#define SYSCTL_SCGC2_USB0_B         0x00010000 // USB0 Clock Gating Control
#define SYSCTL_SCGC2_UDMA_B         0x00002000 // Micro-DMA Clock Gating Control
#define SYSCTL_SCGC2_GPIOF_B        0x00000020 // Port F Clock Gating Control
#define SYSCTL_SCGC2_GPIOE_B        0x00000010 // Port E Clock Gating Control
#define SYSCTL_SCGC2_GPIOD_B        0x00000008 // Port D Clock Gating Control
#define SYSCTL_SCGC2_GPIOC_B        0x00000004 // Port C Clock Gating Control
#define SYSCTL_SCGC2_GPIOB_B        0x00000002 // Port B Clock Gating Control
#define SYSCTL_SCGC2_GPIOA_B        0x00000001 // Port A Clock Gating Control

/* Bit/Fields in Register DCGC0 of Module SYSCTL                              */
#define SYSCTL_DCGC0_WDT1_B         0x10000000 // WDT1 Clock Gating Control
#define SYSCTL_DCGC0_CAN1_B         0x02000000 // CAN1 Clock Gating Control
#define SYSCTL_DCGC0_CAN0_B         0x01000000 // CAN0 Clock Gating Control
#define SYSCTL_DCGC0_PWM0_B         0x00100000 // PWM Clock Gating Control
#define SYSCTL_DCGC0_ADC1_B         0x00020000 // ADC1 Clock Gating Control
#define SYSCTL_DCGC0_ADC0_B         0x00010000 // ADC0 Clock Gating Control
#define SYSCTL_DCGC0_HIB_B          0x00000040 // HIB Clock Gating Control
#define SYSCTL_DCGC0_WDT0_B         0x00000008 // WDT0 Clock Gating Control

/* Bit/Fields in Register DCGC1 of Module SYSCTL                              */
#define SYSCTL_DCGC1_COMP1_B        0x02000000 // Analog Comparator 1 Clock Gating
#define SYSCTL_DCGC1_COMP0_B        0x01000000 // Analog Comparator 0 Clock Gating
#define SYSCTL_DCGC1_TIMER3_B       0x00080000 // Timer 3 Clock Gating Control
#define SYSCTL_DCGC1_TIMER2_B       0x00040000 // Timer 2 Clock Gating Control
#define SYSCTL_DCGC1_TIMER1_B       0x00020000 // Timer 1 Clock Gating Control
#define SYSCTL_DCGC1_TIMER0_B       0x00010000 // Timer 0 Clock Gating Control
#define SYSCTL_DCGC1_I2C1_B         0x00004000 // I2C1 Clock Gating Control
#define SYSCTL_DCGC1_I2C0_B         0x00001000 // I2C0 Clock Gating Control
#define SYSCTL_DCGC1_QEI1_B         0x00000200 // QEI1 Clock Gating Control
#define SYSCTL_DCGC1_QEI0_B         0x00000100 // QEI0 Clock Gating Control
#define SYSCTL_DCGC1_SSI1_B         0x00000020 // SSI1 Clock Gating Control
#define SYSCTL_DCGC1_SSI0_B         0x00000010 // SSI0 Clock Gating Control
#define SYSCTL_DCGC1_UART2_B        0x00000004 // UART2 Clock Gating Control
#define SYSCTL_DCGC1_UART1_B        0x00000002 // UART1 Clock Gating Control
#define SYSCTL_DCGC1_UART0_B        0x00000001 // UART0 Clock Gating Control

