hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register DCGC2 of Module SYSCTL                              */
#define SYSCTL_DCGC2_USB0_B         0x00010000 // USB0 Clock Gating Control
#define SYSCTL_DCGC2_UDMA_B         0x00002000 // Micro-DMA Clock Gating Control
#define SYSCTL_DCGC2_GPIOF_B        0x00000020 // Port F Clock Gating Control
#define SYSCTL_DCGC2_GPIOE_B        0x00000010 // Port E Clock Gating Control
#define SYSCTL_DCGC2_GPIOD_B        0x00000008 // Port D Clock Gating Control
#define SYSCTL_DCGC2_GPIOC_B        0x00000004 // Port C Clock Gating Control
#define SYSCTL_DCGC2_GPIOB_B        0x00000002 // Port B Clock Gating Control
#define SYSCTL_DCGC2_GPIOA_B        0x00000001 // Port A Clock Gating Control

/* Bit/Fields in Register DSLPCLKCFG of Module SYSCTL                         */
#define SYSCTL_DSLPCLKCFG_D_M       0x1F800000 // Divider Field Override
#define SYSCTL_DSLPCLKCFG_D_S       23         // Divider Field Override
#define SYSCTL_DSLPCLKCFG_O_M       0x00000070 // Clock Source
#define SYSCTL_DSLPCLKCFG_O_S       4          // Clock Source
#define SYSCTL_DSLPCLKCFG_O_IGN_V   0x00000000 // MOSC
#define SYSCTL_DSLPCLKCFG_O_IO_V    0x00000010 // PIOSC
#define SYSCTL_DSLPCLKCFG_O_30_V    0x00000030 // LFIOSC
#define SYSCTL_DSLPCLKCFG_O_32_V    0x00000070 // 32.768 kHz

/* Bit/Fields in Register SYSPROP of Module SYSCTL                            */
#define SYSCTL_SYSPROP_FPU_B        0x00000001 // FPU Present

/* Bit/Fields in Register PIOSCCAL of Module SYSCTL                           */
#define SYSCTL_PIOSCCAL_UTEN_B      0x80000000 // Use User Trim Value
#define SYSCTL_PIOSCCAL_CAL_B       0x00000200 // Start Calibration
#define SYSCTL_PIOSCCAL_UPDATE_B    0x00000100 // Update Trim
#define SYSCTL_PIOSCCAL_UT_M        0x0000007F // User Trim Value
#define SYSCTL_PIOSCCAL_UT_S        0          // User Trim Value

/* Bit/Fields in Register PIOSCSTAT of Module SYSCTL                          */
#define SYSCTL_PIOSCSTAT_DT_M       0x007F0000 // Default Trim Value
#define SYSCTL_PIOSCSTAT_DT_S       16         // Default Trim Value
#define SYSCTL_PIOSCSTAT_CR_M       0x00000300 // Calibration Result
#define SYSCTL_PIOSCSTAT_CR_S       8          // Calibration Result
#define SYSCTL_PIOSCSTAT_CRNONE_V   0x00000000 // Calibration has not been
#define SYSCTL_PIOSCSTAT_CRPASS_V   0x00000100 // The last calibration operation
#define SYSCTL_PIOSCSTAT_CRFAIL_V   0x00000200 // The last calibration operation
#define SYSCTL_PIOSCSTAT_CT_M       0x0000007F // Calibration Trim Value
#define SYSCTL_PIOSCSTAT_CT_S       0          // Calibration Trim Value

/* Bit/Fields in Register PLLFREQ0 of Module SYSCTL                           */
#define SYSCTL_PLLFREQ0_MFRAC_M     0x000FFC00 // PLL M Fractional Value
#define SYSCTL_PLLFREQ0_MFRAC_S     10         // PLL M Fractional Value
#define SYSCTL_PLLFREQ0_MINT_M      0x000003FF // PLL M Integer Value
#define SYSCTL_PLLFREQ0_MINT_S      0          // PLL M Integer Value

/* Bit/Fields in Register PLLFREQ1 of Module SYSCTL                           */
#define SYSCTL_PLLFREQ1_Q_M         0x00001F00 // PLL Q Value
#define SYSCTL_PLLFREQ1_Q_S         8          // PLL Q Value
#define SYSCTL_PLLFREQ1_N_M         0x0000001F // PLL N Value
#define SYSCTL_PLLFREQ1_N_S         0          // PLL N Value

/* Bit/Fields in Register PLLSTAT of Module SYSCTL                            */
#define SYSCTL_PLLSTAT_LOCK_B       0x00000001 // PLL Lock

/* Bit/Fields in Register DC9 of Module SYSCTL                                */
#define SYSCTL_DC9_ADC1DC7_B        0x00800000 // ADC1 DC7 Present
#define SYSCTL_DC9_ADC1DC6_B        0x00400000 // ADC1 DC6 Present
#define SYSCTL_DC9_ADC1DC5_B        0x00200000 // ADC1 DC5 Present
#define SYSCTL_DC9_ADC1DC4_B        0x00100000 // ADC1 DC4 Present
#define SYSCTL_DC9_ADC1DC3_B        0x00080000 // ADC1 DC3 Present
#define SYSCTL_DC9_ADC1DC2_B        0x00040000 // ADC1 DC2 Present
#define SYSCTL_DC9_ADC1DC1_B        0x00020000 // ADC1 DC1 Present
#define SYSCTL_DC9_ADC1DC0_B        0x00010000 // ADC1 DC0 Present
#define SYSCTL_DC9_ADC0DC7_B        0x00000080 // ADC0 DC7 Present
#define SYSCTL_DC9_ADC0DC6_B        0x00000040 // ADC0 DC6 Present
#define SYSCTL_DC9_ADC0DC5_B        0x00000020 // ADC0 DC5 Present
#define SYSCTL_DC9_ADC0DC4_B        0x00000010 // ADC0 DC4 Present
#define SYSCTL_DC9_ADC0DC3_B        0x00000008 // ADC0 DC3 Present
#define SYSCTL_DC9_ADC0DC2_B        0x00000004 // ADC0 DC2 Present
#define SYSCTL_DC9_ADC0DC1_B        0x00000002 // ADC0 DC1 Present
#define SYSCTL_DC9_ADC0DC0_B        0x00000001 // ADC0 DC0 Present

/* Bit/Fields in Register NVMSTAT of Module SYSCTL                            */
#define SYSCTL_NVMSTAT_FWB_B        0x00000001 // 32 Word Flash Write Buffer

/* Bit/Fields in Register LDOSPCTL of Module SYSCTL                           */
#define SYSCTL_LDOSPCTL_VADJEN_B    0x80000000 // Voltage Adjust Enable
#define SYSCTL_LDOSPCTL_VLDO_M      0x000000FF // LDO Output Voltage
#define SYSCTL_LDOSPCTL_VLDO_S      0          // LDO Output Voltage

/* Bit/Fields in Register LDODPCTL of Module SYSCTL                           */
#define SYSCTL_LDODPCTL_VADJEN_B    0x80000000 // Voltage Adjust Enable
#define SYSCTL_LDODPCTL_VLDO_M      0x000000FF // LDO Output Voltage
#define SYSCTL_LDODPCTL_VLDO_S      0          // LDO Output Voltage

/* Bit/Fields in Register PPWD of Module SYSCTL                               */
#define SYSCTL_PPWD_P1_B            0x00000002 // Watchdog Timer 1 Present
#define SYSCTL_PPWD_P0_B            0x00000001 // Watchdog Timer 0 Present

/* Bit/Fields in Register PPTIMER of Module SYSCTL                            */
#define SYSCTL_PPTIMER_P5_B         0x00000020 // 16/32-Bit General-Purpose Timer
#define SYSCTL_PPTIMER_P4_B         0x00000010 // 16/32-Bit General-Purpose Timer
#define SYSCTL_PPTIMER_P3_B         0x00000008 // 16/32-Bit General-Purpose Timer
#define SYSCTL_PPTIMER_P2_B         0x00000004 // 16/32-Bit General-Purpose Timer
#define SYSCTL_PPTIMER_P1_B         0x00000002 // 16/32-Bit General-Purpose Timer
#define SYSCTL_PPTIMER_P0_B         0x00000001 // 16/32-Bit General-Purpose Timer

/* Bit/Fields in Register PPGPIO of Module SYSCTL                             */
#define SYSCTL_PPGPIO_P14_B         0x00004000 // GPIO Port Q Present
#define SYSCTL_PPGPIO_P13_B         0x00002000 // GPIO Port P Present
#define SYSCTL_PPGPIO_P12_B         0x00001000 // GPIO Port N Present
#define SYSCTL_PPGPIO_P11_B         0x00000800 // GPIO Port M Present
#define SYSCTL_PPGPIO_P10_B         0x00000400 // GPIO Port L Present
#define SYSCTL_PPGPIO_P9_B          0x00000200 // GPIO Port K Present
#define SYSCTL_PPGPIO_P8_B          0x00000100 // GPIO Port J Present
#define SYSCTL_PPGPIO_P7_B          0x00000080 // GPIO Port H Present
#define SYSCTL_PPGPIO_P6_B          0x00000040 // GPIO Port G Present
#define SYSCTL_PPGPIO_P5_B          0x00000020 // GPIO Port F Present
#define SYSCTL_PPGPIO_P4_B          0x00000010 // GPIO Port E Present
#define SYSCTL_PPGPIO_P3_B          0x00000008 // GPIO Port D Present
#define SYSCTL_PPGPIO_P2_B          0x00000004 // GPIO Port C Present
#define SYSCTL_PPGPIO_P1_B          0x00000002 // GPIO Port B Present
#define SYSCTL_PPGPIO_P0_B          0x00000001 // GPIO Port A Present

/* Bit/Fields in Register PPDMA of Module SYSCTL                              */
#define SYSCTL_PPDMA_P0_B           0x00000001 // uDMA Module Present

/* Bit/Fields in Register PPHIB of Module SYSCTL                              */
#define SYSCTL_PPHIB_P0_B           0x00000001 // Hibernation Module Present

/* Bit/Fields in Register PPUART of Module SYSCTL                             */
#define SYSCTL_PPUART_P7_B          0x00000080 // UART Module 7 Present
#define SYSCTL_PPUART_P6_B          0x00000040 // UART Module 6 Present
#define SYSCTL_PPUART_P5_B          0x00000020 // UART Module 5 Present
#define SYSCTL_PPUART_P4_B          0x00000010 // UART Module 4 Present
#define SYSCTL_PPUART_P3_B          0x00000008 // UART Module 3 Present
#define SYSCTL_PPUART_P2_B          0x00000004 // UART Module 2 Present
#define SYSCTL_PPUART_P1_B          0x00000002 // UART Module 1 Present
#define SYSCTL_PPUART_P0_B          0x00000001 // UART Module 0 Present

/* Bit/Fields in Register PPSSI of Module SYSCTL                              */
#define SYSCTL_PPSSI_P3_B           0x00000008 // SSI Module 3 Present
#define SYSCTL_PPSSI_P2_B           0x00000004 // SSI Module 2 Present
#define SYSCTL_PPSSI_P1_B           0x00000002 // SSI Module 1 Present
#define SYSCTL_PPSSI_P0_B           0x00000001 // SSI Module 0 Present

/* Bit/Fields in Register PPI2C of Module SYSCTL                              */
#define SYSCTL_PPI2C_P5_B           0x00000020 // I2C Module 5 Present
#define SYSCTL_PPI2C_P4_B           0x00000010 // I2C Module 4 Present
#define SYSCTL_PPI2C_P3_B           0x00000008 // I2C Module 3 Present
#define SYSCTL_PPI2C_P2_B           0x00000004 // I2C Module 2 Present
#define SYSCTL_PPI2C_P1_B           0x00000002 // I2C Module 1 Present
#define SYSCTL_PPI2C_P0_B           0x00000001 // I2C Module 0 Present

