hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register PPUSB of Module SYSCTL                              */
#define SYSCTL_PPUSB_P0_B           0x00000001 // USB Module Present

/* Bit/Fields in Register PPCAN of Module SYSCTL                              */
#define SYSCTL_PPCAN_P1_B           0x00000002 // CAN Module 1 Present
#define SYSCTL_PPCAN_P0_B           0x00000001 // CAN Module 0 Present

/* Bit/Fields in Register PPADC of Module SYSCTL                              */
#define SYSCTL_PPADC_P1_B           0x00000002 // ADC Module 1 Present
#define SYSCTL_PPADC_P0_B           0x00000001 // ADC Module 0 Present

/* Bit/Fields in Register PPACMP of Module SYSCTL                             */
#define SYSCTL_PPACMP_P0_B          0x00000001 // Analog Comparator Module Present

/* Bit/Fields in Register PPPWM of Module SYSCTL                              */
#define SYSCTL_PPPWM_P1_B           0x00000002 // PWM Module 1 Present
#define SYSCTL_PPPWM_P0_B           0x00000001 // PWM Module 0 Present

/* Bit/Fields in Register PPQEI of Module SYSCTL                              */
#define SYSCTL_PPQEI_P1_B           0x00000002 // QEI Module 1 Present
#define SYSCTL_PPQEI_P0_B           0x00000001 // QEI Module 0 Present

/* Bit/Fields in Register PPEEPROM of Module SYSCTL                           */
#define SYSCTL_PPEEPROM_P0_B        0x00000001 // EEPROM Module Present

/* Bit/Fields in Register PPWTIMER of Module SYSCTL                           */
#define SYSCTL_PPWTIMER_P5_B        0x00000020 // 32/64-Bit Wide General-Purpose
#define SYSCTL_PPWTIMER_P4_B        0x00000010 // 32/64-Bit Wide General-Purpose
#define SYSCTL_PPWTIMER_P3_B        0x00000008 // 32/64-Bit Wide General-Purpose
#define SYSCTL_PPWTIMER_P2_B        0x00000004 // 32/64-Bit Wide General-Purpose
#define SYSCTL_PPWTIMER_P1_B        0x00000002 // 32/64-Bit Wide General-Purpose
#define SYSCTL_PPWTIMER_P0_B        0x00000001 // 32/64-Bit Wide General-Purpose

/* Bit/Fields in Register SRWD of Module SYSCTL                               */
#define SYSCTL_SRWD_R1_B            0x00000002 // Watchdog Timer 1 Software Reset
#define SYSCTL_SRWD_R0_B            0x00000001 // Watchdog Timer 0 Software Reset

/* Bit/Fields in Register SRTIMER of Module SYSCTL                            */
#define SYSCTL_SRTIMER_R5_B         0x00000020 // 16/32-Bit General-Purpose Timer
#define SYSCTL_SRTIMER_R4_B         0x00000010 // 16/32-Bit General-Purpose Timer
#define SYSCTL_SRTIMER_R3_B         0x00000008 // 16/32-Bit General-Purpose Timer
#define SYSCTL_SRTIMER_R2_B         0x00000004 // 16/32-Bit General-Purpose Timer
#define SYSCTL_SRTIMER_R1_B         0x00000002 // 16/32-Bit General-Purpose Timer
#define SYSCTL_SRTIMER_R0_B         0x00000001 // 16/32-Bit General-Purpose Timer

/* Bit/Fields in Register SRGPIO of Module SYSCTL                             */
#define SYSCTL_SRGPIO_R5_B          0x00000020 // GPIO Port F Software Reset
#define SYSCTL_SRGPIO_R4_B          0x00000010 // GPIO Port E Software Reset
#define SYSCTL_SRGPIO_R3_B          0x00000008 // GPIO Port D Software Reset
#define SYSCTL_SRGPIO_R2_B          0x00000004 // GPIO Port C Software Reset
#define SYSCTL_SRGPIO_R1_B          0x00000002 // GPIO Port B Software Reset
#define SYSCTL_SRGPIO_R0_B          0x00000001 // GPIO Port A Software Reset

/* Bit/Fields in Register SRDMA of Module SYSCTL                              */
#define SYSCTL_SRDMA_R0_B           0x00000001 // uDMA Module Software Reset

/* Bit/Fields in Register SRHIB of Module SYSCTL                              */
#define SYSCTL_SRHIB_R0_B           0x00000001 // Hibernation Module Software

/* Bit/Fields in Register SRUART of Module SYSCTL                             */
#define SYSCTL_SRUART_R7_B          0x00000080 // UART Module 7 Software Reset
#define SYSCTL_SRUART_R6_B          0x00000040 // UART Module 6 Software Reset
#define SYSCTL_SRUART_R5_B          0x00000020 // UART Module 5 Software Reset
#define SYSCTL_SRUART_R4_B          0x00000010 // UART Module 4 Software Reset
#define SYSCTL_SRUART_R3_B          0x00000008 // UART Module 3 Software Reset
#define SYSCTL_SRUART_R2_B          0x00000004 // UART Module 2 Software Reset
#define SYSCTL_SRUART_R1_B          0x00000002 // UART Module 1 Software Reset
#define SYSCTL_SRUART_R0_B          0x00000001 // UART Module 0 Software Reset

/* Bit/Fields in Register SRSSI of Module SYSCTL                              */
#define SYSCTL_SRSSI_R3_B           0x00000008 // SSI Module 3 Software Reset
#define SYSCTL_SRSSI_R2_B           0x00000004 // SSI Module 2 Software Reset
#define SYSCTL_SRSSI_R1_B           0x00000002 // SSI Module 1 Software Reset
#define SYSCTL_SRSSI_R0_B           0x00000001 // SSI Module 0 Software Reset

/* Bit/Fields in Register SRI2C of Module SYSCTL                              */
#define SYSCTL_SRI2C_R3_B           0x00000008 // I2C Module 3 Software Reset
#define SYSCTL_SRI2C_R2_B           0x00000004 // I2C Module 2 Software Reset
#define SYSCTL_SRI2C_R1_B           0x00000002 // I2C Module 1 Software Reset
#define SYSCTL_SRI2C_R0_B           0x00000001 // I2C Module 0 Software Reset

/* Bit/Fields in Register SRUSB of Module SYSCTL                              */
#define SYSCTL_SRUSB_R0_B           0x00000001 // USB Module Software Reset

/* Bit/Fields in Register SRCAN of Module SYSCTL                              */
#define SYSCTL_SRCAN_R1_B           0x00000002 // CAN Module 1 Software Reset
#define SYSCTL_SRCAN_R0_B           0x00000001 // CAN Module 0 Software Reset

/* Bit/Fields in Register SRADC of Module SYSCTL                              */
#define SYSCTL_SRADC_R1_B           0x00000002 // ADC Module 1 Software Reset
#define SYSCTL_SRADC_R0_B           0x00000001 // ADC Module 0 Software Reset

/* Bit/Fields in Register SRACMP of Module SYSCTL                             */
#define SYSCTL_SRACMP_R0_B          0x00000001 // Analog Comparator Module 0

/* Bit/Fields in Register SRPWM of Module SYSCTL                              */
#define SYSCTL_SRPWM_R1_B           0x00000002 // PWM Module 1 Software Reset
#define SYSCTL_SRPWM_R0_B           0x00000001 // PWM Module 0 Software Reset

/* Bit/Fields in Register SRQEI of Module SYSCTL                              */
#define SYSCTL_SRQEI_R1_B           0x00000002 // QEI Module 1 Software Reset
#define SYSCTL_SRQEI_R0_B           0x00000001 // QEI Module 0 Software Reset

/* Bit/Fields in Register SREEPROM of Module SYSCTL                           */
#define SYSCTL_SREEPROM_R0_B        0x00000001 // EEPROM Module Software Reset

