hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register SRWTIMER of Module SYSCTL                           */
#define SYSCTL_SRWTIMER_R5_B        0x00000020 // 32/64-Bit Wide General-Purpose
#define SYSCTL_SRWTIMER_R4_B        0x00000010 // 32/64-Bit Wide General-Purpose
#define SYSCTL_SRWTIMER_R3_B        0x00000008 // 32/64-Bit Wide General-Purpose
#define SYSCTL_SRWTIMER_R2_B        0x00000004 // 32/64-Bit Wide General-Purpose
#define SYSCTL_SRWTIMER_R1_B        0x00000002 // 32/64-Bit Wide General-Purpose
#define SYSCTL_SRWTIMER_R0_B        0x00000001 // 32/64-Bit Wide General-Purpose

/* Bit/Fields in Register RCGCWD of Module SYSCTL                             */
#define SYSCTL_RCGCWD_R1_B          0x00000002 // Watchdog Timer 1 Run Mode Clock
#define SYSCTL_RCGCWD_R0_B          0x00000001 // Watchdog Timer 0 Run Mode Clock

/* Bit/Fields in Register RCGCTIMER of Module SYSCTL                          */
#define SYSCTL_RCGCTIMER_R5_B       0x00000020 // 16/32-Bit General-Purpose Timer
#define SYSCTL_RCGCTIMER_R4_B       0x00000010 // 16/32-Bit General-Purpose Timer
#define SYSCTL_RCGCTIMER_R3_B       0x00000008 // 16/32-Bit General-Purpose Timer
#define SYSCTL_RCGCTIMER_R2_B       0x00000004 // 16/32-Bit General-Purpose Timer
#define SYSCTL_RCGCTIMER_R1_B       0x00000002 // 16/32-Bit General-Purpose Timer
#define SYSCTL_RCGCTIMER_R0_B       0x00000001 // 16/32-Bit General-Purpose Timer

/* Bit/Fields in Register RCGCGPIO of Module SYSCTL                           */
#define SYSCTL_RCGCGPIO_R5_B        0x00000020 // GPIO Port F Run Mode Clock
#define SYSCTL_RCGCGPIO_R4_B        0x00000010 // GPIO Port E Run Mode Clock
#define SYSCTL_RCGCGPIO_R3_B        0x00000008 // GPIO Port D Run Mode Clock
#define SYSCTL_RCGCGPIO_R2_B        0x00000004 // GPIO Port C Run Mode Clock
#define SYSCTL_RCGCGPIO_R1_B        0x00000002 // GPIO Port B Run Mode Clock
#define SYSCTL_RCGCGPIO_R0_B        0x00000001 // GPIO Port A Run Mode Clock

/* Bit/Fields in Register RCGCDMA of Module SYSCTL                            */
#define SYSCTL_RCGCDMA_R0_B         0x00000001 // uDMA Module Run Mode Clock

/* Bit/Fields in Register RCGCHIB of Module SYSCTL                            */
#define SYSCTL_RCGCHIB_R0_B         0x00000001 // Hibernation Module Run Mode

/* Bit/Fields in Register RCGCUART of Module SYSCTL                           */
#define SYSCTL_RCGCUART_R7_B        0x00000080 // UART Module 7 Run Mode Clock
#define SYSCTL_RCGCUART_R6_B        0x00000040 // UART Module 6 Run Mode Clock
#define SYSCTL_RCGCUART_R5_B        0x00000020 // UART Module 5 Run Mode Clock
#define SYSCTL_RCGCUART_R4_B        0x00000010 // UART Module 4 Run Mode Clock
#define SYSCTL_RCGCUART_R3_B        0x00000008 // UART Module 3 Run Mode Clock
#define SYSCTL_RCGCUART_R2_B        0x00000004 // UART Module 2 Run Mode Clock
#define SYSCTL_RCGCUART_R1_B        0x00000002 // UART Module 1 Run Mode Clock
#define SYSCTL_RCGCUART_R0_B        0x00000001 // UART Module 0 Run Mode Clock

/* Bit/Fields in Register RCGCSSI of Module SYSCTL                            */
#define SYSCTL_RCGCSSI_R3_B         0x00000008 // SSI Module 3 Run Mode Clock
#define SYSCTL_RCGCSSI_R2_B         0x00000004 // SSI Module 2 Run Mode Clock
#define SYSCTL_RCGCSSI_R1_B         0x00000002 // SSI Module 1 Run Mode Clock
#define SYSCTL_RCGCSSI_R0_B         0x00000001 // SSI Module 0 Run Mode Clock

/* Bit/Fields in Register RCGCI2C of Module SYSCTL                            */
#define SYSCTL_RCGCI2C_R3_B         0x00000008 // I2C Module 3 Run Mode Clock
#define SYSCTL_RCGCI2C_R2_B         0x00000004 // I2C Module 2 Run Mode Clock
#define SYSCTL_RCGCI2C_R1_B         0x00000002 // I2C Module 1 Run Mode Clock
#define SYSCTL_RCGCI2C_R0_B         0x00000001 // I2C Module 0 Run Mode Clock

/* Bit/Fields in Register RCGCUSB of Module SYSCTL                            */
#define SYSCTL_RCGCUSB_R0_B         0x00000001 // USB Module Run Mode Clock Gating

/* Bit/Fields in Register RCGCCAN of Module SYSCTL                            */
#define SYSCTL_RCGCCAN_R1_B         0x00000002 // CAN Module 1 Run Mode Clock
#define SYSCTL_RCGCCAN_R0_B         0x00000001 // CAN Module 0 Run Mode Clock

/* Bit/Fields in Register RCGCADC of Module SYSCTL                            */
#define SYSCTL_RCGCADC_R1_B         0x00000002 // ADC Module 1 Run Mode Clock
#define SYSCTL_RCGCADC_R0_B         0x00000001 // ADC Module 0 Run Mode Clock

/* Bit/Fields in Register RCGCACMP of Module SYSCTL                           */
#define SYSCTL_RCGCACMP_R0_B        0x00000001 // Analog Comparator Module 0 Run

/* Bit/Fields in Register RCGCPWM of Module SYSCTL                            */
#define SYSCTL_RCGCPWM_R1_B         0x00000002 // PWM Module 1 Run Mode Clock
#define SYSCTL_RCGCPWM_R0_B         0x00000001 // PWM Module 0 Run Mode Clock

/* Bit/Fields in Register RCGCQEI of Module SYSCTL                            */
#define SYSCTL_RCGCQEI_R1_B         0x00000002 // QEI Module 1 Run Mode Clock
#define SYSCTL_RCGCQEI_R0_B         0x00000001 // QEI Module 0 Run Mode Clock

/* Bit/Fields in Register RCGCEEPROM of Module SYSCTL                         */
#define SYSCTL_RCGCEEPROM_R0_B      0x00000001 // EEPROM Module Run Mode Clock

/* Bit/Fields in Register RCGCWTIMER of Module SYSCTL                         */
#define SYSCTL_RCGCWTIMER_R5_B      0x00000020 // 32/64-Bit Wide General-Purpose
#define SYSCTL_RCGCWTIMER_R4_B      0x00000010 // 32/64-Bit Wide General-Purpose
#define SYSCTL_RCGCWTIMER_R3_B      0x00000008 // 32/64-Bit Wide General-Purpose
#define SYSCTL_RCGCWTIMER_R2_B      0x00000004 // 32/64-Bit Wide General-Purpose
#define SYSCTL_RCGCWTIMER_R1_B      0x00000002 // 32/64-Bit Wide General-Purpose
#define SYSCTL_RCGCWTIMER_R0_B      0x00000001 // 32/64-Bit Wide General-Purpose

/* Bit/Fields in Register SCGCWD of Module SYSCTL                             */
#define SYSCTL_SCGCWD_S1_B          0x00000002 // Watchdog Timer 1 Sleep Mode
#define SYSCTL_SCGCWD_S0_B          0x00000001 // Watchdog Timer 0 Sleep Mode

/* Bit/Fields in Register SCGCTIMER of Module SYSCTL                          */
#define SYSCTL_SCGCTIMER_S5_B       0x00000020 // 16/32-Bit General-Purpose Timer
#define SYSCTL_SCGCTIMER_S4_B       0x00000010 // 16/32-Bit General-Purpose Timer
#define SYSCTL_SCGCTIMER_S3_B       0x00000008 // 16/32-Bit General-Purpose Timer
#define SYSCTL_SCGCTIMER_S2_B       0x00000004 // 16/32-Bit General-Purpose Timer
#define SYSCTL_SCGCTIMER_S1_B       0x00000002 // 16/32-Bit General-Purpose Timer
#define SYSCTL_SCGCTIMER_S0_B       0x00000001 // 16/32-Bit General-Purpose Timer

/* Bit/Fields in Register SCGCGPIO of Module SYSCTL                           */
#define SYSCTL_SCGCGPIO_S5_B        0x00000020 // GPIO Port F Sleep Mode Clock
#define SYSCTL_SCGCGPIO_S4_B        0x00000010 // GPIO Port E Sleep Mode Clock
#define SYSCTL_SCGCGPIO_S3_B        0x00000008 // GPIO Port D Sleep Mode Clock
#define SYSCTL_SCGCGPIO_S2_B        0x00000004 // GPIO Port C Sleep Mode Clock
#define SYSCTL_SCGCGPIO_S1_B        0x00000002 // GPIO Port B Sleep Mode Clock
#define SYSCTL_SCGCGPIO_S0_B        0x00000001 // GPIO Port A Sleep Mode Clock

/* Bit/Fields in Register SCGCDMA of Module SYSCTL                            */
#define SYSCTL_SCGCDMA_S0_B         0x00000001 // uDMA Module Sleep Mode Clock

