hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register SCGCHIB of Module SYSCTL                            */
#define SYSCTL_SCGCHIB_S0_B         0x00000001 // Hibernation Module Sleep Mode

/* Bit/Fields in Register SCGCUART of Module SYSCTL                           */
#define SYSCTL_SCGCUART_S7_B        0x00000080 // UART Module 7 Sleep Mode Clock
#define SYSCTL_SCGCUART_S6_B        0x00000040 // UART Module 6 Sleep Mode Clock
#define SYSCTL_SCGCUART_S5_B        0x00000020 // UART Module 5 Sleep Mode Clock
#define SYSCTL_SCGCUART_S4_B        0x00000010 // UART Module 4 Sleep Mode Clock
#define SYSCTL_SCGCUART_S3_B        0x00000008 // UART Module 3 Sleep Mode Clock
#define SYSCTL_SCGCUART_S2_B        0x00000004 // UART Module 2 Sleep Mode Clock
#define SYSCTL_SCGCUART_S1_B        0x00000002 // UART Module 1 Sleep Mode Clock
#define SYSCTL_SCGCUART_S0_B        0x00000001 // UART Module 0 Sleep Mode Clock

/* Bit/Fields in Register SCGCSSI of Module SYSCTL                            */
#define SYSCTL_SCGCSSI_S3_B         0x00000008 // SSI Module 3 Sleep Mode Clock
#define SYSCTL_SCGCSSI_S2_B         0x00000004 // SSI Module 2 Sleep Mode Clock
#define SYSCTL_SCGCSSI_S1_B         0x00000002 // SSI Module 1 Sleep Mode Clock
#define SYSCTL_SCGCSSI_S0_B         0x00000001 // SSI Module 0 Sleep Mode Clock

/* Bit/Fields in Register SCGCI2C of Module SYSCTL                            */
#define SYSCTL_SCGCI2C_S3_B         0x00000008 // I2C Module 3 Sleep Mode Clock
#define SYSCTL_SCGCI2C_S2_B         0x00000004 // I2C Module 2 Sleep Mode Clock
#define SYSCTL_SCGCI2C_S1_B         0x00000002 // I2C Module 1 Sleep Mode Clock
#define SYSCTL_SCGCI2C_S0_B         0x00000001 // I2C Module 0 Sleep Mode Clock

/* Bit/Fields in Register SCGCUSB of Module SYSCTL                            */
#define SYSCTL_SCGCUSB_S0_B         0x00000001 // USB Module Sleep Mode Clock

/* Bit/Fields in Register SCGCCAN of Module SYSCTL                            */
#define SYSCTL_SCGCCAN_S1_B         0x00000002 // CAN Module 1 Sleep Mode Clock
#define SYSCTL_SCGCCAN_S0_B         0x00000001 // CAN Module 0 Sleep Mode Clock

/* Bit/Fields in Register SCGCADC of Module SYSCTL                            */
#define SYSCTL_SCGCADC_S1_B         0x00000002 // ADC Module 1 Sleep Mode Clock
#define SYSCTL_SCGCADC_S0_B         0x00000001 // ADC Module 0 Sleep Mode Clock

/* Bit/Fields in Register SCGCACMP of Module SYSCTL                           */
#define SYSCTL_SCGCACMP_S0_B        0x00000001 // Analog Comparator Module 0 Sleep

/* Bit/Fields in Register SCGCPWM of Module SYSCTL                            */
#define SYSCTL_SCGCPWM_S1_B         0x00000002 // PWM Module 1 Sleep Mode Clock
#define SYSCTL_SCGCPWM_S0_B         0x00000001 // PWM Module 0 Sleep Mode Clock

/* Bit/Fields in Register SCGCQEI of Module SYSCTL                            */
#define SYSCTL_SCGCQEI_S1_B         0x00000002 // QEI Module 1 Sleep Mode Clock
#define SYSCTL_SCGCQEI_S0_B         0x00000001 // QEI Module 0 Sleep Mode Clock

/* Bit/Fields in Register SCGCEEPROM of Module SYSCTL                         */
#define SYSCTL_SCGCEEPROM_S0_B      0x00000001 // EEPROM Module Sleep Mode Clock

/* Bit/Fields in Register SCGCWTIMER of Module SYSCTL                         */
#define SYSCTL_SCGCWTIMER_S5_B      0x00000020 // 32/64-Bit Wide General-Purpose
#define SYSCTL_SCGCWTIMER_S4_B      0x00000010 // 32/64-Bit Wide General-Purpose
#define SYSCTL_SCGCWTIMER_S3_B      0x00000008 // 32/64-Bit Wide General-Purpose
#define SYSCTL_SCGCWTIMER_S2_B      0x00000004 // 32/64-Bit Wide General-Purpose
#define SYSCTL_SCGCWTIMER_S1_B      0x00000002 // 32/64-Bit Wide General-Purpose
#define SYSCTL_SCGCWTIMER_S0_B      0x00000001 // 32/64-Bit Wide General-Purpose

/* Bit/Fields in Register DCGCWD of Module SYSCTL                             */
#define SYSCTL_DCGCWD_D1_B          0x00000002 // Watchdog Timer 1 Deep-Sleep Mode
#define SYSCTL_DCGCWD_D0_B          0x00000001 // Watchdog Timer 0 Deep-Sleep Mode

/* Bit/Fields in Register DCGCTIMER of Module SYSCTL                          */
#define SYSCTL_DCGCTIMER_D5_B       0x00000020 // 16/32-Bit General-Purpose Timer
#define SYSCTL_DCGCTIMER_D4_B       0x00000010 // 16/32-Bit General-Purpose Timer
#define SYSCTL_DCGCTIMER_D3_B       0x00000008 // 16/32-Bit General-Purpose Timer
#define SYSCTL_DCGCTIMER_D2_B       0x00000004 // 16/32-Bit General-Purpose Timer
#define SYSCTL_DCGCTIMER_D1_B       0x00000002 // 16/32-Bit General-Purpose Timer
#define SYSCTL_DCGCTIMER_D0_B       0x00000001 // 16/32-Bit General-Purpose Timer

/* Bit/Fields in Register DCGCGPIO of Module SYSCTL                           */
#define SYSCTL_DCGCGPIO_D5_B        0x00000020 // GPIO Port F Deep-Sleep Mode
#define SYSCTL_DCGCGPIO_D4_B        0x00000010 // GPIO Port E Deep-Sleep Mode
#define SYSCTL_DCGCGPIO_D3_B        0x00000008 // GPIO Port D Deep-Sleep Mode
#define SYSCTL_DCGCGPIO_D2_B        0x00000004 // GPIO Port C Deep-Sleep Mode
#define SYSCTL_DCGCGPIO_D1_B        0x00000002 // GPIO Port B Deep-Sleep Mode
#define SYSCTL_DCGCGPIO_D0_B        0x00000001 // GPIO Port A Deep-Sleep Mode

/* Bit/Fields in Register DCGCDMA of Module SYSCTL                            */
#define SYSCTL_DCGCDMA_D0_B         0x00000001 // uDMA Module Deep-Sleep Mode

/* Bit/Fields in Register DCGCHIB of Module SYSCTL                            */
#define SYSCTL_DCGCHIB_D0_B         0x00000001 // Hibernation Module Deep-Sleep

/* Bit/Fields in Register DCGCUART of Module SYSCTL                           */
#define SYSCTL_DCGCUART_D7_B        0x00000080 // UART Module 7 Deep-Sleep Mode
#define SYSCTL_DCGCUART_D6_B        0x00000040 // UART Module 6 Deep-Sleep Mode
#define SYSCTL_DCGCUART_D5_B        0x00000020 // UART Module 5 Deep-Sleep Mode
#define SYSCTL_DCGCUART_D4_B        0x00000010 // UART Module 4 Deep-Sleep Mode
#define SYSCTL_DCGCUART_D3_B        0x00000008 // UART Module 3 Deep-Sleep Mode
#define SYSCTL_DCGCUART_D2_B        0x00000004 // UART Module 2 Deep-Sleep Mode
#define SYSCTL_DCGCUART_D1_B        0x00000002 // UART Module 1 Deep-Sleep Mode
#define SYSCTL_DCGCUART_D0_B        0x00000001 // UART Module 0 Deep-Sleep Mode

/* Bit/Fields in Register DCGCSSI of Module SYSCTL                            */
#define SYSCTL_DCGCSSI_D3_B         0x00000008 // SSI Module 3 Deep-Sleep Mode
#define SYSCTL_DCGCSSI_D2_B         0x00000004 // SSI Module 2 Deep-Sleep Mode
#define SYSCTL_DCGCSSI_D1_B         0x00000002 // SSI Module 1 Deep-Sleep Mode
#define SYSCTL_DCGCSSI_D0_B         0x00000001 // SSI Module 0 Deep-Sleep Mode

