hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register DCGCI2C of Module SYSCTL                            */
#define SYSCTL_DCGCI2C_D3_B         0x00000008 // I2C Module 3 Deep-Sleep Mode
#define SYSCTL_DCGCI2C_D2_B         0x00000004 // I2C Module 2 Deep-Sleep Mode
#define SYSCTL_DCGCI2C_D1_B         0x00000002 // I2C Module 1 Deep-Sleep Mode
#define SYSCTL_DCGCI2C_D0_B         0x00000001 // I2C Module 0 Deep-Sleep Mode

/* Bit/Fields in Register DCGCUSB of Module SYSCTL                            */
#define SYSCTL_DCGCUSB_D0_B         0x00000001 // USB Module Deep-Sleep Mode Clock

/* Bit/Fields in Register DCGCCAN of Module SYSCTL                            */
#define SYSCTL_DCGCCAN_D1_B         0x00000002 // CAN Module 1 Deep-Sleep Mode
#define SYSCTL_DCGCCAN_D0_B         0x00000001 // CAN Module 0 Deep-Sleep Mode

/* Bit/Fields in Register DCGCADC of Module SYSCTL                            */
#define SYSCTL_DCGCADC_D1_B         0x00000002 // ADC Module 1 Deep-Sleep Mode
#define SYSCTL_DCGCADC_D0_B         0x00000001 // ADC Module 0 Deep-Sleep Mode

/* Bit/Fields in Register DCGCACMP of Module SYSCTL                           */
#define SYSCTL_DCGCACMP_D0_B        0x00000001 // Analog Comparator Module 0

/* Bit/Fields in Register DCGCPWM of Module SYSCTL                            */
#define SYSCTL_DCGCPWM_D1_B         0x00000002 // PWM Module 1 Deep-Sleep Mode
#define SYSCTL_DCGCPWM_D0_B         0x00000001 // PWM Module 0 Deep-Sleep Mode

/* Bit/Fields in Register DCGCQEI of Module SYSCTL                            */
#define SYSCTL_DCGCQEI_D1_B         0x00000002 // QEI Module 1 Deep-Sleep Mode
#define SYSCTL_DCGCQEI_D0_B         0x00000001 // QEI Module 0 Deep-Sleep Mode

/* Bit/Fields in Register DCGCEEPROM of Module SYSCTL                         */
#define SYSCTL_DCGCEEPROM_D0_B      0x00000001 // EEPROM Module Deep-Sleep Mode

/* Bit/Fields in Register DCGCWTIMER of Module SYSCTL                         */
#define SYSCTL_DCGCWTIMER_D5_B      0x00000020 // 32/64-Bit Wide General-Purpose
#define SYSCTL_DCGCWTIMER_D4_B      0x00000010 // 32/64-Bit Wide General-Purpose
#define SYSCTL_DCGCWTIMER_D3_B      0x00000008 // 32/64-Bit Wide General-Purpose
#define SYSCTL_DCGCWTIMER_D2_B      0x00000004 // 32/64-Bit Wide General-Purpose
#define SYSCTL_DCGCWTIMER_D1_B      0x00000002 // 32/64-Bit Wide General-Purpose
#define SYSCTL_DCGCWTIMER_D0_B      0x00000001 // 32/64-Bit Wide General-Purpose

/* Bit/Fields in Register PRWD of Module SYSCTL                               */
#define SYSCTL_PRWD_R1_B            0x00000002 // Watchdog Timer 1 Peripheral
#define SYSCTL_PRWD_R0_B            0x00000001 // Watchdog Timer 0 Peripheral

/* Bit/Fields in Register PRTIMER of Module SYSCTL                            */
#define SYSCTL_PRTIMER_R5_B         0x00000020 // 16/32-Bit General-Purpose Timer
#define SYSCTL_PRTIMER_R4_B         0x00000010 // 16/32-Bit General-Purpose Timer
#define SYSCTL_PRTIMER_R3_B         0x00000008 // 16/32-Bit General-Purpose Timer
#define SYSCTL_PRTIMER_R2_B         0x00000004 // 16/32-Bit General-Purpose Timer
#define SYSCTL_PRTIMER_R1_B         0x00000002 // 16/32-Bit General-Purpose Timer
#define SYSCTL_PRTIMER_R0_B         0x00000001 // 16/32-Bit General-Purpose Timer

/* Bit/Fields in Register PRGPIO of Module SYSCTL                             */
#define SYSCTL_PRGPIO_R5_B          0x00000020 // GPIO Port F Peripheral Ready
#define SYSCTL_PRGPIO_R4_B          0x00000010 // GPIO Port E Peripheral Ready
#define SYSCTL_PRGPIO_R3_B          0x00000008 // GPIO Port D Peripheral Ready
#define SYSCTL_PRGPIO_R2_B          0x00000004 // GPIO Port C Peripheral Ready
#define SYSCTL_PRGPIO_R1_B          0x00000002 // GPIO Port B Peripheral Ready
#define SYSCTL_PRGPIO_R0_B          0x00000001 // GPIO Port A Peripheral Ready

/* Bit/Fields in Register PRDMA of Module SYSCTL                              */
#define SYSCTL_PRDMA_R0_B           0x00000001 // uDMA Module Peripheral Ready

/* Bit/Fields in Register PRHIB of Module SYSCTL                              */
#define SYSCTL_PRHIB_R0_B           0x00000001 // Hibernation Module Peripheral

/* Bit/Fields in Register PRUART of Module SYSCTL                             */
#define SYSCTL_PRUART_R7_B          0x00000080 // UART Module 7 Peripheral Ready
#define SYSCTL_PRUART_R6_B          0x00000040 // UART Module 6 Peripheral Ready
#define SYSCTL_PRUART_R5_B          0x00000020 // UART Module 5 Peripheral Ready
#define SYSCTL_PRUART_R4_B          0x00000010 // UART Module 4 Peripheral Ready
#define SYSCTL_PRUART_R3_B          0x00000008 // UART Module 3 Peripheral Ready
#define SYSCTL_PRUART_R2_B          0x00000004 // UART Module 2 Peripheral Ready
#define SYSCTL_PRUART_R1_B          0x00000002 // UART Module 1 Peripheral Ready
#define SYSCTL_PRUART_R0_B          0x00000001 // UART Module 0 Peripheral Ready

/* Bit/Fields in Register PRSSI of Module SYSCTL                              */
#define SYSCTL_PRSSI_R3_B           0x00000008 // SSI Module 3 Peripheral Ready
#define SYSCTL_PRSSI_R2_B           0x00000004 // SSI Module 2 Peripheral Ready
#define SYSCTL_PRSSI_R1_B           0x00000002 // SSI Module 1 Peripheral Ready
#define SYSCTL_PRSSI_R0_B           0x00000001 // SSI Module 0 Peripheral Ready

/* Bit/Fields in Register PRI2C of Module SYSCTL                              */
#define SYSCTL_PRI2C_R3_B           0x00000008 // I2C Module 3 Peripheral Ready
#define SYSCTL_PRI2C_R2_B           0x00000004 // I2C Module 2 Peripheral Ready
#define SYSCTL_PRI2C_R1_B           0x00000002 // I2C Module 1 Peripheral Ready
#define SYSCTL_PRI2C_R0_B           0x00000001 // I2C Module 0 Peripheral Ready

/* Bit/Fields in Register PRUSB of Module SYSCTL                              */
#define SYSCTL_PRUSB_R0_B           0x00000001 // USB Module Peripheral Ready

/* Bit/Fields in Register PRCAN of Module SYSCTL                              */
#define SYSCTL_PRCAN_R1_B           0x00000002 // CAN Module 1 Peripheral Ready
#define SYSCTL_PRCAN_R0_B           0x00000001 // CAN Module 0 Peripheral Ready

/* Bit/Fields in Register PRADC of Module SYSCTL                              */
#define SYSCTL_PRADC_R1_B           0x00000002 // ADC Module 1 Peripheral Ready
#define SYSCTL_PRADC_R0_B           0x00000001 // ADC Module 0 Peripheral Ready

/* Bit/Fields in Register PRACMP of Module SYSCTL                             */
#define SYSCTL_PRACMP_R0_B          0x00000001 // Analog Comparator Module 0

/* Bit/Fields in Register PRPWM of Module SYSCTL                              */
#define SYSCTL_PRPWM_R1_B           0x00000002 // PWM Module 1 Peripheral Ready
#define SYSCTL_PRPWM_R0_B           0x00000001 // PWM Module 0 Peripheral Ready

/* Bit/Fields in Register PRQEI of Module SYSCTL                              */
#define SYSCTL_PRQEI_R1_B           0x00000002 // QEI Module 1 Peripheral Ready
#define SYSCTL_PRQEI_R0_B           0x00000001 // QEI Module 0 Peripheral Ready

/* Bit/Fields in Register PREEPROM of Module SYSCTL                           */
#define SYSCTL_PREEPROM_R0_B        0x00000001 // EEPROM Module Peripheral Ready

/* Bit/Fields in Register PRWTIMER of Module SYSCTL                           */
#define SYSCTL_PRWTIMER_R5_B        0x00000020 // 32/64-Bit Wide General-Purpose
#define SYSCTL_PRWTIMER_R4_B        0x00000010 // 32/64-Bit Wide General-Purpose
#define SYSCTL_PRWTIMER_R3_B        0x00000008 // 32/64-Bit Wide General-Purpose
#define SYSCTL_PRWTIMER_R2_B        0x00000004 // 32/64-Bit Wide General-Purpose
#define SYSCTL_PRWTIMER_R1_B        0x00000002 // 32/64-Bit Wide General-Purpose
#define SYSCTL_PRWTIMER_R0_B        0x00000001 // 32/64-Bit Wide General-Purpose


/******************************************************************************/
/*                                                                            */
/*                      UDMA                                                  */
/*                                                                            */
/******************************************************************************/


/* Bit/Fields in Register STAT of Module UDMA                                 */
#define UDMA_STAT_DMACHANS_M        0x001F0000 // Available uDMA Channels Minus 1
#define UDMA_STAT_DMACHANS_S        16         // Available uDMA Channels Minus 1
#define UDMA_STAT_STATE_M           0x000000F0 // Control State Machine Status
#define UDMA_STAT_STATE_S           4          // Control State Machine Status
#define UDMA_STAT_STATE_IDLE_V      0x00000000 // Idle
#define UDMA_STAT_STATE_RD_CTRL_V   0x00000010 // Reading channel controller data
#define UDMA_STAT_STATE_WAIT_V      0x00000060 // Waiting for uDMA request to
#define UDMA_STAT_STATE_WR_CTRL_V   0x00000070 // Writing channel controller data
#define UDMA_STAT_STATE_STALL_V     0x00000080 // Stalled
#define UDMA_STAT_STATE_DONE_V      0x00000090 // Done
#define UDMA_STAT_STATE_UNDEF_V     0x000000A0 // Undefined
#define UDMA_STAT_MASTEN_B          0x00000001 // Master Enable Status

/* Bit/Fields in Register CFG of Module UDMA                                  */
#define UDMA_CFG_MASTEN_B           0x00000001 // Controller Master Enable

/* Bit/Fields in Register CTLBASE of Module UDMA                              */
#define UDMA_CTLBASE_ADDR_M         0xFFFFFC00 // Channel Control Base Address
#define UDMA_CTLBASE_ADDR_S         10         // Channel Control Base Address

