hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register ALTBASE of Module UDMA                              */
#define UDMA_ALTBASE_ADDR_M         0xFFFFFFFF // Alternate Channel Address
#define UDMA_ALTBASE_ADDR_S         0          // Alternate Channel Address

/* Bit/Fields in Register WAITSTAT of Module UDMA                             */
#define UDMA_WAITSTAT_WAITREQ_M     0xFFFFFFFF // Channel [n] Wait Status
#define UDMA_WAITSTAT_WAITREQ_S     0          // Channel [n] Wait Status

/* Bit/Fields in Register SWREQ of Module UDMA                                */
#define UDMA_SWREQ_M                0xFFFFFFFF // Channel [n] Software Request
#define UDMA_SWREQ_S                0          // Channel [n] Software Request

/* Bit/Fields in Register USEBURSTSET of Module UDMA                          */
#define UDMA_USEBURSTSET_SET_M      0xFFFFFFFF // Channel [n] Useburst Set
#define UDMA_USEBURSTSET_SET_S      0          // Channel [n] Useburst Set

/* Bit/Fields in Register USEBURSTCLR of Module UDMA                          */
#define UDMA_USEBURSTCLR_CLR_M      0xFFFFFFFF // Channel [n] Useburst Clear
#define UDMA_USEBURSTCLR_CLR_S      0          // Channel [n] Useburst Clear

/* Bit/Fields in Register REQMASKSET of Module UDMA                           */
#define UDMA_REQMASKSET_SET_M       0xFFFFFFFF // Channel [n] Request Mask Set
#define UDMA_REQMASKSET_SET_S       0          // Channel [n] Request Mask Set

/* Bit/Fields in Register REQMASKCLR of Module UDMA                           */
#define UDMA_REQMASKCLR_CLR_M       0xFFFFFFFF // Channel [n] Request Mask Clear
#define UDMA_REQMASKCLR_CLR_S       0          // Channel [n] Request Mask Clear

/* Bit/Fields in Register ENASET of Module UDMA                               */
#define UDMA_ENASET_SET_M           0xFFFFFFFF // Channel [n] Enable Set
#define UDMA_ENASET_SET_S           0          // Channel [n] Enable Set

/* Bit/Fields in Register ENACLR of Module UDMA                               */
#define UDMA_ENACLR_CLR_M           0xFFFFFFFF // Clear Channel [n] Enable Clear
#define UDMA_ENACLR_CLR_S           0          // Clear Channel [n] Enable Clear

/* Bit/Fields in Register ALTSET of Module UDMA                               */
#define UDMA_ALTSET_SET_M           0xFFFFFFFF // Channel [n] Alternate Set
#define UDMA_ALTSET_SET_S           0          // Channel [n] Alternate Set

/* Bit/Fields in Register ALTCLR of Module UDMA                               */
#define UDMA_ALTCLR_CLR_M           0xFFFFFFFF // Channel [n] Alternate Clear
#define UDMA_ALTCLR_CLR_S           0          // Channel [n] Alternate Clear

/* Bit/Fields in Register PRIOSET of Module UDMA                              */
#define UDMA_PRIOSET_SET_M          0xFFFFFFFF // Channel [n] Priority Set
#define UDMA_PRIOSET_SET_S          0          // Channel [n] Priority Set

/* Bit/Fields in Register PRIOCLR of Module UDMA                              */
#define UDMA_PRIOCLR_CLR_M          0xFFFFFFFF // Channel [n] Priority Clear
#define UDMA_PRIOCLR_CLR_S          0          // Channel [n] Priority Clear

/* Bit/Fields in Register ERRCLR of Module UDMA                               */
#define UDMA_ERRCLR_ERRCLR_B        0x00000001 // uDMA Bus Error Status

/* Bit/Fields in Register CHASGN of Module UDMA                               */
#define UDMA_CHASGN_M               0xFFFFFFFF // Channel [n] Assignment Select
#define UDMA_CHASGN_S               0          // Channel [n] Assignment Select
#define UDMA_CHASGN_PRIMARY_V       0x00000000 // Use the primary channel
#define UDMA_CHASGN_SECONDARY_V     0x00000001 // Use the secondary channel

/* Bit/Fields in Register CHIS of Module UDMA                                 */
#define UDMA_CHIS_M                 0xFFFFFFFF // Channel [n] Interrupt Status
#define UDMA_CHIS_S                 0          // Channel [n] Interrupt Status

/* Bit/Fields in Register CHMAP0 of Module UDMA                               */
#define UDMA_CHMAP0_CH7SEL_M        0xF0000000 // uDMA Channel 7 Source Select
#define UDMA_CHMAP0_CH7SEL_S        28         // uDMA Channel 7 Source Select
#define UDMA_CHMAP0_CH6SEL_M        0x0F000000 // uDMA Channel 6 Source Select
#define UDMA_CHMAP0_CH6SEL_S        24         // uDMA Channel 6 Source Select
#define UDMA_CHMAP0_CH5SEL_M        0x00F00000 // uDMA Channel 5 Source Select
#define UDMA_CHMAP0_CH5SEL_S        20         // uDMA Channel 5 Source Select
#define UDMA_CHMAP0_CH4SEL_M        0x000F0000 // uDMA Channel 4 Source Select
#define UDMA_CHMAP0_CH4SEL_S        16         // uDMA Channel 4 Source Select
#define UDMA_CHMAP0_CH3SEL_M        0x0000F000 // uDMA Channel 3 Source Select
#define UDMA_CHMAP0_CH3SEL_S        12         // uDMA Channel 3 Source Select
#define UDMA_CHMAP0_CH2SEL_M        0x00000F00 // uDMA Channel 2 Source Select
#define UDMA_CHMAP0_CH2SEL_S        8          // uDMA Channel 2 Source Select
#define UDMA_CHMAP0_CH1SEL_M        0x000000F0 // uDMA Channel 1 Source Select
#define UDMA_CHMAP0_CH1SEL_S        4          // uDMA Channel 1 Source Select
#define UDMA_CHMAP0_CH0SEL_M        0x0000000F // uDMA Channel 0 Source Select
#define UDMA_CHMAP0_CH0SEL_S        0          // uDMA Channel 0 Source Select

/* Bit/Fields in Register CHMAP1 of Module UDMA                               */
#define UDMA_CHMAP1_CH15SEL_M       0xF0000000 // uDMA Channel 15 Source Select
#define UDMA_CHMAP1_CH15SEL_S       28         // uDMA Channel 15 Source Select
#define UDMA_CHMAP1_CH14SEL_M       0x0F000000 // uDMA Channel 14 Source Select
#define UDMA_CHMAP1_CH14SEL_S       24         // uDMA Channel 14 Source Select
#define UDMA_CHMAP1_CH13SEL_M       0x00F00000 // uDMA Channel 13 Source Select
#define UDMA_CHMAP1_CH13SEL_S       20         // uDMA Channel 13 Source Select
#define UDMA_CHMAP1_CH12SEL_M       0x000F0000 // uDMA Channel 12 Source Select
#define UDMA_CHMAP1_CH12SEL_S       16         // uDMA Channel 12 Source Select
#define UDMA_CHMAP1_CH11SEL_M       0x0000F000 // uDMA Channel 11 Source Select
#define UDMA_CHMAP1_CH11SEL_S       12         // uDMA Channel 11 Source Select
#define UDMA_CHMAP1_CH10SEL_M       0x00000F00 // uDMA Channel 10 Source Select
#define UDMA_CHMAP1_CH10SEL_S       8          // uDMA Channel 10 Source Select
#define UDMA_CHMAP1_CH9SEL_M        0x000000F0 // uDMA Channel 9 Source Select
#define UDMA_CHMAP1_CH9SEL_S        4          // uDMA Channel 9 Source Select
#define UDMA_CHMAP1_CH8SEL_M        0x0000000F // uDMA Channel 8 Source Select
#define UDMA_CHMAP1_CH8SEL_S        0          // uDMA Channel 8 Source Select

/* Bit/Fields in Register CHMAP2 of Module UDMA                               */
#define UDMA_CHMAP2_CH23SEL_M       0xF0000000 // uDMA Channel 23 Source Select
#define UDMA_CHMAP2_CH23SEL_S       28         // uDMA Channel 23 Source Select
#define UDMA_CHMAP2_CH22SEL_M       0x0F000000 // uDMA Channel 22 Source Select
#define UDMA_CHMAP2_CH22SEL_S       24         // uDMA Channel 22 Source Select
#define UDMA_CHMAP2_CH21SEL_M       0x00F00000 // uDMA Channel 21 Source Select
#define UDMA_CHMAP2_CH21SEL_S       20         // uDMA Channel 21 Source Select
#define UDMA_CHMAP2_CH20SEL_M       0x000F0000 // uDMA Channel 20 Source Select
#define UDMA_CHMAP2_CH20SEL_S       16         // uDMA Channel 20 Source Select
#define UDMA_CHMAP2_CH19SEL_M       0x0000F000 // uDMA Channel 19 Source Select
#define UDMA_CHMAP2_CH19SEL_S       12         // uDMA Channel 19 Source Select
#define UDMA_CHMAP2_CH18SEL_M       0x00000F00 // uDMA Channel 18 Source Select
#define UDMA_CHMAP2_CH18SEL_S       8          // uDMA Channel 18 Source Select
#define UDMA_CHMAP2_CH17SEL_M       0x000000F0 // uDMA Channel 17 Source Select
#define UDMA_CHMAP2_CH17SEL_S       4          // uDMA Channel 17 Source Select
#define UDMA_CHMAP2_CH16SEL_M       0x0000000F // uDMA Channel 16 Source Select
#define UDMA_CHMAP2_CH16SEL_S       0          // uDMA Channel 16 Source Select

