hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register CHMAP3 of Module UDMA                               */
#define UDMA_CHMAP3_CH31SEL_M       0xF0000000 // uDMA Channel 31 Source Select
#define UDMA_CHMAP3_CH31SEL_S       28         // uDMA Channel 31 Source Select
#define UDMA_CHMAP3_CH30SEL_M       0x0F000000 // uDMA Channel 30 Source Select
#define UDMA_CHMAP3_CH30SEL_S       24         // uDMA Channel 30 Source Select
#define UDMA_CHMAP3_CH29SEL_M       0x00F00000 // uDMA Channel 29 Source Select
#define UDMA_CHMAP3_CH29SEL_S       20         // uDMA Channel 29 Source Select
#define UDMA_CHMAP3_CH28SEL_M       0x000F0000 // uDMA Channel 28 Source Select
#define UDMA_CHMAP3_CH28SEL_S       16         // uDMA Channel 28 Source Select
#define UDMA_CHMAP3_CH27SEL_M       0x0000F000 // uDMA Channel 27 Source Select
#define UDMA_CHMAP3_CH27SEL_S       12         // uDMA Channel 27 Source Select
#define UDMA_CHMAP3_CH26SEL_M       0x00000F00 // uDMA Channel 26 Source Select
#define UDMA_CHMAP3_CH26SEL_S       8          // uDMA Channel 26 Source Select
#define UDMA_CHMAP3_CH25SEL_M       0x000000F0 // uDMA Channel 25 Source Select
#define UDMA_CHMAP3_CH25SEL_S       4          // uDMA Channel 25 Source Select
#define UDMA_CHMAP3_CH24SEL_M       0x0000000F // uDMA Channel 24 Source Select
#define UDMA_CHMAP3_CH24SEL_S       0          // uDMA Channel 24 Source Select

/* Bit/Fields in Register SRCENDP of Module UDMA                              */
#define UDMA_SRCENDP_ADDR_M         0xFFFFFFFF // Source Address End Pointer
#define UDMA_SRCENDP_ADDR_S         0          // Source Address End Pointer

/* Bit/Fields in Register DSTENDP of Module UDMA                              */
#define UDMA_DSTENDP_ADDR_M         0xFFFFFFFF // Destination Address End Pointer
#define UDMA_DSTENDP_ADDR_S         0          // Destination Address End Pointer

/* Bit/Fields in Register CHCTL of Module UDMA                                */
#define UDMA_CHCTL_DSTINC_M         0xC0000000 // Destination Address Increment
#define UDMA_CHCTL_DSTINC_S         30         // Destination Address Increment
#define UDMA_CHCTL_DSTINC_8_V       0x00000000 // Byte
#define UDMA_CHCTL_DSTINC_16_V      0x40000000 // Half-word
#define UDMA_CHCTL_DSTINC_32_V      0x80000000 // Word
#define UDMA_CHCTL_DSTINC_NONE_V    0xC0000000 // No increment
#define UDMA_CHCTL_DSTSIZE_M        0x30000000 // Destination Data Size
#define UDMA_CHCTL_DSTSIZE_S        28         // Destination Data Size
#define UDMA_CHCTL_DSTSIZE_8_V      0x00000000 // Byte
#define UDMA_CHCTL_DSTSIZE_16_V     0x10000000 // Half-word
#define UDMA_CHCTL_DSTSIZE_32_V     0x20000000 // Word
#define UDMA_CHCTL_SRCINC_M         0x0C000000 // Source Address Increment
#define UDMA_CHCTL_SRCINC_S         26         // Source Address Increment
#define UDMA_CHCTL_SRCINC_8_V       0x00000000 // Byte
#define UDMA_CHCTL_SRCINC_16_V      0x04000000 // Half-word
#define UDMA_CHCTL_SRCINC_32_V      0x08000000 // Word
#define UDMA_CHCTL_SRCINC_NONE_V    0x0C000000 // No increment
#define UDMA_CHCTL_SRCSIZE_M        0x03000000 // Source Data Size
#define UDMA_CHCTL_SRCSIZE_S        24         // Source Data Size
#define UDMA_CHCTL_SRCSIZE_8_V      0x00000000 // Byte
#define UDMA_CHCTL_SRCSIZE_16_V     0x01000000 // Half-word
#define UDMA_CHCTL_SRCSIZE_32_V     0x02000000 // Word
#define UDMA_CHCTL_ARBSIZE_M        0x0003C000 // Arbitration Size
#define UDMA_CHCTL_ARBSIZE_S        14         // Arbitration Size
#define UDMA_CHCTL_ARBSIZE_1_V      0x00000000 // 1 Transfer
#define UDMA_CHCTL_ARBSIZE_2_V      0x00004000 // 2 Transfers
#define UDMA_CHCTL_ARBSIZE_4_V      0x00008000 // 4 Transfers
#define UDMA_CHCTL_ARBSIZE_8_V      0x0000C000 // 8 Transfers
#define UDMA_CHCTL_ARBSIZE_16_V     0x00010000 // 16 Transfers
#define UDMA_CHCTL_ARBSIZE_32_V     0x00014000 // 32 Transfers
#define UDMA_CHCTL_ARBSIZE_64_V     0x00018000 // 64 Transfers
#define UDMA_CHCTL_ARBSIZE_128_V    0x0001C000 // 128 Transfers
#define UDMA_CHCTL_ARBSIZE_256_V    0x00020000 // 256 Transfers
#define UDMA_CHCTL_ARBSIZE_512_V    0x00024000 // 512 Transfers
#define UDMA_CHCTL_ARBSIZE_1024_V   0x00028000 // 1024 Transfers
#define UDMA_CHCTL_XFERSIZE_M       0x00003FF0 // Transfer Size (minus 1)
#define UDMA_CHCTL_XFERSIZE_S       4          // Transfer Size (minus 1)
#define UDMA_CHCTL_NXTUSEBURST_B    0x00000008 // Next Useburst
#define UDMA_CHCTL_XFERMODE_M       0x00000007 // uDMA Transfer Mode
#define UDMA_CHCTL_XFERMODE_S       0          // uDMA Transfer Mode


/******************************************************************************/
/*                                                                            */
/*                      NVIC                                                  */
/*                                                                            */
/******************************************************************************/


/* Bit/Fields in Register ACTLR of Module NVIC                                */
#define NVIC_ACTLR_DISOOFP_B        0x00000200 // Disable Out-Of-Order Floating
#define NVIC_ACTLR_DISFPCA_B        0x00000100 // Disable CONTROL
#define NVIC_ACTLR_DISFOLD_B        0x00000004 // Disable IT Folding
#define NVIC_ACTLR_DISWBUF_B        0x00000002 // Disable Write Buffer
#define NVIC_ACTLR_DISMCYC_B        0x00000001 // Disable Interrupts of Multiple

/* Bit/Fields in Register ST of Module NVIC                                   */
#define NVIC_ST_CTRL_COUNT_B        0x00010000 // Count Flag
#define NVIC_ST_CTRL_CLK_SRC_B      0x00000004 // Clock Source
#define NVIC_ST_CTRL_INTEN_B        0x00000002 // Interrupt Enable
#define NVIC_ST_CTRL_ENABLE_B       0x00000001 // Enable
#define NVIC_ST_RELOAD_M            0x00FFFFFF // Reload Value
#define NVIC_ST_RELOAD_S            0          // Reload Value
#define NVIC_ST_CURRENT_M           0x00FFFFFF // Current Value
#define NVIC_ST_CURRENT_S           0          // Current Value

/* Bit/Fields in Register EN0 of Module NVIC                                  */
#define NVIC_EN0_INT_M              0xFFFFFFFF // Interrupt Enable
#define NVIC_EN0_INT_S              0          // Interrupt Enable

