hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register EN1 of Module NVIC                                  */
#define NVIC_EN1_INT_M              0xFFFFFFFF // Interrupt Enable
#define NVIC_EN1_INT_S              0          // Interrupt Enable

/* Bit/Fields in Register EN2 of Module NVIC                                  */
#define NVIC_EN2_INT_M              0xFFFFFFFF // Interrupt Enable
#define NVIC_EN2_INT_S              0          // Interrupt Enable

/* Bit/Fields in Register EN3 of Module NVIC                                  */
#define NVIC_EN3_INT_M              0xFFFFFFFF // Interrupt Enable
#define NVIC_EN3_INT_S              0          // Interrupt Enable

/* Bit/Fields in Register EN4 of Module NVIC                                  */
#define NVIC_EN4_INT_M              0x000007FF // Interrupt Enable
#define NVIC_EN4_INT_S              0          // Interrupt Enable

/* Bit/Fields in Register DIS0 of Module NVIC                                 */
#define NVIC_DIS0_INT_M             0xFFFFFFFF // Interrupt Disable
#define NVIC_DIS0_INT_S             0          // Interrupt Disable

/* Bit/Fields in Register DIS1 of Module NVIC                                 */
#define NVIC_DIS1_INT_M             0xFFFFFFFF // Interrupt Disable
#define NVIC_DIS1_INT_S             0          // Interrupt Disable

/* Bit/Fields in Register DIS2 of Module NVIC                                 */
#define NVIC_DIS2_INT_M             0xFFFFFFFF // Interrupt Disable
#define NVIC_DIS2_INT_S             0          // Interrupt Disable

/* Bit/Fields in Register DIS3 of Module NVIC                                 */
#define NVIC_DIS3_INT_M             0xFFFFFFFF // Interrupt Disable
#define NVIC_DIS3_INT_S             0          // Interrupt Disable

/* Bit/Fields in Register DIS4 of Module NVIC                                 */
#define NVIC_DIS4_INT_M             0x000007FF // Interrupt Disable
#define NVIC_DIS4_INT_S             0          // Interrupt Disable

/* Bit/Fields in Register PEND0 of Module NVIC                                */
#define NVIC_PEND0_INT_M            0xFFFFFFFF // Interrupt Set Pending
#define NVIC_PEND0_INT_S            0          // Interrupt Set Pending

/* Bit/Fields in Register PEND1 of Module NVIC                                */
#define NVIC_PEND1_INT_M            0xFFFFFFFF // Interrupt Set Pending
#define NVIC_PEND1_INT_S            0          // Interrupt Set Pending

/* Bit/Fields in Register PEND2 of Module NVIC                                */
#define NVIC_PEND2_INT_M            0xFFFFFFFF // Interrupt Set Pending
#define NVIC_PEND2_INT_S            0          // Interrupt Set Pending

/* Bit/Fields in Register PEND3 of Module NVIC                                */
#define NVIC_PEND3_INT_M            0xFFFFFFFF // Interrupt Set Pending
#define NVIC_PEND3_INT_S            0          // Interrupt Set Pending

/* Bit/Fields in Register PEND4 of Module NVIC                                */
#define NVIC_PEND4_INT_M            0x000007FF // Interrupt Set Pending
#define NVIC_PEND4_INT_S            0          // Interrupt Set Pending

/* Bit/Fields in Register UNPEND0 of Module NVIC                              */
#define NVIC_UNPEND0_INT_M          0xFFFFFFFF // Interrupt Clear Pending
#define NVIC_UNPEND0_INT_S          0          // Interrupt Clear Pending

/* Bit/Fields in Register UNPEND1 of Module NVIC                              */
#define NVIC_UNPEND1_INT_M          0xFFFFFFFF // Interrupt Clear Pending
#define NVIC_UNPEND1_INT_S          0          // Interrupt Clear Pending

/* Bit/Fields in Register UNPEND2 of Module NVIC                              */
#define NVIC_UNPEND2_INT_M          0xFFFFFFFF // Interrupt Clear Pending
#define NVIC_UNPEND2_INT_S          0          // Interrupt Clear Pending

/* Bit/Fields in Register UNPEND3 of Module NVIC                              */
#define NVIC_UNPEND3_INT_M          0xFFFFFFFF // Interrupt Clear Pending
#define NVIC_UNPEND3_INT_S          0          // Interrupt Clear Pending

/* Bit/Fields in Register UNPEND4 of Module NVIC                              */
#define NVIC_UNPEND4_INT_M          0x000007FF // Interrupt Clear Pending
#define NVIC_UNPEND4_INT_S          0          // Interrupt Clear Pending

/* Bit/Fields in Register ACTIVE0 of Module NVIC                              */
#define NVIC_ACTIVE0_INT_M          0xFFFFFFFF // Interrupt Active
#define NVIC_ACTIVE0_INT_S          0          // Interrupt Active

/* Bit/Fields in Register ACTIVE1 of Module NVIC                              */
#define NVIC_ACTIVE1_INT_M          0xFFFFFFFF // Interrupt Active
#define NVIC_ACTIVE1_INT_S          0          // Interrupt Active

/* Bit/Fields in Register ACTIVE2 of Module NVIC                              */
#define NVIC_ACTIVE2_INT_M          0xFFFFFFFF // Interrupt Active
#define NVIC_ACTIVE2_INT_S          0          // Interrupt Active

/* Bit/Fields in Register ACTIVE3 of Module NVIC                              */
#define NVIC_ACTIVE3_INT_M          0xFFFFFFFF // Interrupt Active
#define NVIC_ACTIVE3_INT_S          0          // Interrupt Active

/* Bit/Fields in Register ACTIVE4 of Module NVIC                              */
#define NVIC_ACTIVE4_INT_M          0x000007FF // Interrupt Active
#define NVIC_ACTIVE4_INT_S          0          // Interrupt Active

/* Bit/Fields in Register PRI0 of Module NVIC                                 */
#define NVIC_PRI0_INT3_M            0xE0000000 // Interrupt 3 Priority Mask
#define NVIC_PRI0_INT3_S            29         // Interrupt 3 Priority Mask
#define NVIC_PRI0_INT2_M            0x00E00000 // Interrupt 2 Priority Mask
#define NVIC_PRI0_INT2_S            21         // Interrupt 2 Priority Mask
#define NVIC_PRI0_INT1_M            0x0000E000 // Interrupt 1 Priority Mask
#define NVIC_PRI0_INT1_S            13         // Interrupt 1 Priority Mask
#define NVIC_PRI0_INT0_M            0x000000E0 // Interrupt 0 Priority Mask
#define NVIC_PRI0_INT0_S            5          // Interrupt 0 Priority Mask

