hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register PRI1 of Module NVIC                                 */
#define NVIC_PRI1_INT7_M            0xE0000000 // Interrupt 7 Priority Mask
#define NVIC_PRI1_INT7_S            29         // Interrupt 7 Priority Mask
#define NVIC_PRI1_INT6_M            0x00E00000 // Interrupt 6 Priority Mask
#define NVIC_PRI1_INT6_S            21         // Interrupt 6 Priority Mask
#define NVIC_PRI1_INT5_M            0x0000E000 // Interrupt 5 Priority Mask
#define NVIC_PRI1_INT5_S            13         // Interrupt 5 Priority Mask
#define NVIC_PRI1_INT4_M            0x000000E0 // Interrupt 4 Priority Mask
#define NVIC_PRI1_INT4_S            5          // Interrupt 4 Priority Mask

/* Bit/Fields in Register PRI2 of Module NVIC                                 */
#define NVIC_PRI2_INT11_M           0xE0000000 // Interrupt 11 Priority Mask
#define NVIC_PRI2_INT11_S           29         // Interrupt 11 Priority Mask
#define NVIC_PRI2_INT10_M           0x00E00000 // Interrupt 10 Priority Mask
#define NVIC_PRI2_INT10_S           21         // Interrupt 10 Priority Mask
#define NVIC_PRI2_INT9_M            0x0000E000 // Interrupt 9 Priority Mask
#define NVIC_PRI2_INT9_S            13         // Interrupt 9 Priority Mask
#define NVIC_PRI2_INT8_M            0x000000E0 // Interrupt 8 Priority Mask
#define NVIC_PRI2_INT8_S            5          // Interrupt 8 Priority Mask

/* Bit/Fields in Register PRI3 of Module NVIC                                 */
#define NVIC_PRI3_INT15_M           0xE0000000 // Interrupt 15 Priority Mask
#define NVIC_PRI3_INT15_S           29         // Interrupt 15 Priority Mask
#define NVIC_PRI3_INT14_M           0x00E00000 // Interrupt 14 Priority Mask
#define NVIC_PRI3_INT14_S           21         // Interrupt 14 Priority Mask
#define NVIC_PRI3_INT13_M           0x0000E000 // Interrupt 13 Priority Mask
#define NVIC_PRI3_INT13_S           13         // Interrupt 13 Priority Mask
#define NVIC_PRI3_INT12_M           0x000000E0 // Interrupt 12 Priority Mask
#define NVIC_PRI3_INT12_S           5          // Interrupt 12 Priority Mask

/* Bit/Fields in Register PRI4 of Module NVIC                                 */
#define NVIC_PRI4_INT19_M           0xE0000000 // Interrupt 19 Priority Mask
#define NVIC_PRI4_INT19_S           29         // Interrupt 19 Priority Mask
#define NVIC_PRI4_INT18_M           0x00E00000 // Interrupt 18 Priority Mask
#define NVIC_PRI4_INT18_S           21         // Interrupt 18 Priority Mask
#define NVIC_PRI4_INT17_M           0x0000E000 // Interrupt 17 Priority Mask
#define NVIC_PRI4_INT17_S           13         // Interrupt 17 Priority Mask
#define NVIC_PRI4_INT16_M           0x000000E0 // Interrupt 16 Priority Mask
#define NVIC_PRI4_INT16_S           5          // Interrupt 16 Priority Mask

/* Bit/Fields in Register PRI5 of Module NVIC                                 */
#define NVIC_PRI5_INT23_M           0xE0000000 // Interrupt 23 Priority Mask
#define NVIC_PRI5_INT23_S           29         // Interrupt 23 Priority Mask
#define NVIC_PRI5_INT22_M           0x00E00000 // Interrupt 22 Priority Mask
#define NVIC_PRI5_INT22_S           21         // Interrupt 22 Priority Mask
#define NVIC_PRI5_INT21_M           0x0000E000 // Interrupt 21 Priority Mask
#define NVIC_PRI5_INT21_S           13         // Interrupt 21 Priority Mask
#define NVIC_PRI5_INT20_M           0x000000E0 // Interrupt 20 Priority Mask
#define NVIC_PRI5_INT20_S           5          // Interrupt 20 Priority Mask

/* Bit/Fields in Register PRI6 of Module NVIC                                 */
#define NVIC_PRI6_INT27_M           0xE0000000 // Interrupt 27 Priority Mask
#define NVIC_PRI6_INT27_S           29         // Interrupt 27 Priority Mask
#define NVIC_PRI6_INT26_M           0x00E00000 // Interrupt 26 Priority Mask
#define NVIC_PRI6_INT26_S           21         // Interrupt 26 Priority Mask
#define NVIC_PRI6_INT25_M           0x0000E000 // Interrupt 25 Priority Mask
#define NVIC_PRI6_INT25_S           13         // Interrupt 25 Priority Mask
#define NVIC_PRI6_INT24_M           0x000000E0 // Interrupt 24 Priority Mask
#define NVIC_PRI6_INT24_S           5          // Interrupt 24 Priority Mask

/* Bit/Fields in Register PRI7 of Module NVIC                                 */
#define NVIC_PRI7_INT31_M           0xE0000000 // Interrupt 31 Priority Mask
#define NVIC_PRI7_INT31_S           29         // Interrupt 31 Priority Mask
#define NVIC_PRI7_INT30_M           0x00E00000 // Interrupt 30 Priority Mask
#define NVIC_PRI7_INT30_S           21         // Interrupt 30 Priority Mask
#define NVIC_PRI7_INT29_M           0x0000E000 // Interrupt 29 Priority Mask
#define NVIC_PRI7_INT29_S           13         // Interrupt 29 Priority Mask
#define NVIC_PRI7_INT28_M           0x000000E0 // Interrupt 28 Priority Mask
#define NVIC_PRI7_INT28_S           5          // Interrupt 28 Priority Mask

/* Bit/Fields in Register PRI8 of Module NVIC                                 */
#define NVIC_PRI8_INT35_M           0xE0000000 // Interrupt 35 Priority Mask
#define NVIC_PRI8_INT35_S           29         // Interrupt 35 Priority Mask
#define NVIC_PRI8_INT34_M           0x00E00000 // Interrupt 34 Priority Mask
#define NVIC_PRI8_INT34_S           21         // Interrupt 34 Priority Mask
#define NVIC_PRI8_INT33_M           0x0000E000 // Interrupt 33 Priority Mask
#define NVIC_PRI8_INT33_S           13         // Interrupt 33 Priority Mask
#define NVIC_PRI8_INT32_M           0x000000E0 // Interrupt 32 Priority Mask
#define NVIC_PRI8_INT32_S           5          // Interrupt 32 Priority Mask

/* Bit/Fields in Register PRI9 of Module NVIC                                 */
#define NVIC_PRI9_INT39_M           0xE0000000 // Interrupt 39 Priority Mask
#define NVIC_PRI9_INT39_S           29         // Interrupt 39 Priority Mask
#define NVIC_PRI9_INT38_M           0x00E00000 // Interrupt 38 Priority Mask
#define NVIC_PRI9_INT38_S           21         // Interrupt 38 Priority Mask
#define NVIC_PRI9_INT37_M           0x0000E000 // Interrupt 37 Priority Mask
#define NVIC_PRI9_INT37_S           13         // Interrupt 37 Priority Mask
#define NVIC_PRI9_INT36_M           0x000000E0 // Interrupt 36 Priority Mask
#define NVIC_PRI9_INT36_S           5          // Interrupt 36 Priority Mask

