hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register PRI10 of Module NVIC                                */
#define NVIC_PRI10_INT43_M          0xE0000000 // Interrupt 43 Priority Mask
#define NVIC_PRI10_INT43_S          29         // Interrupt 43 Priority Mask
#define NVIC_PRI10_INT42_M          0x00E00000 // Interrupt 42 Priority Mask
#define NVIC_PRI10_INT42_S          21         // Interrupt 42 Priority Mask
#define NVIC_PRI10_INT41_M          0x0000E000 // Interrupt 41 Priority Mask
#define NVIC_PRI10_INT41_S          13         // Interrupt 41 Priority Mask
#define NVIC_PRI10_INT40_M          0x000000E0 // Interrupt 40 Priority Mask
#define NVIC_PRI10_INT40_S          5          // Interrupt 40 Priority Mask

/* Bit/Fields in Register PRI11 of Module NVIC                                */
#define NVIC_PRI11_INT47_M          0xE0000000 // Interrupt 47 Priority Mask
#define NVIC_PRI11_INT47_S          29         // Interrupt 47 Priority Mask
#define NVIC_PRI11_INT46_M          0x00E00000 // Interrupt 46 Priority Mask
#define NVIC_PRI11_INT46_S          21         // Interrupt 46 Priority Mask
#define NVIC_PRI11_INT45_M          0x0000E000 // Interrupt 45 Priority Mask
#define NVIC_PRI11_INT45_S          13         // Interrupt 45 Priority Mask
#define NVIC_PRI11_INT44_M          0x000000E0 // Interrupt 44 Priority Mask
#define NVIC_PRI11_INT44_S          5          // Interrupt 44 Priority Mask

/* Bit/Fields in Register PRI12 of Module NVIC                                */
#define NVIC_PRI12_INT51_M          0xE0000000 // Interrupt 51 Priority Mask
#define NVIC_PRI12_INT51_S          29         // Interrupt 51 Priority Mask
#define NVIC_PRI12_INT50_M          0x00E00000 // Interrupt 50 Priority Mask
#define NVIC_PRI12_INT50_S          21         // Interrupt 50 Priority Mask
#define NVIC_PRI12_INT49_M          0x0000E000 // Interrupt 49 Priority Mask
#define NVIC_PRI12_INT49_S          13         // Interrupt 49 Priority Mask
#define NVIC_PRI12_INT48_M          0x000000E0 // Interrupt 48 Priority Mask
#define NVIC_PRI12_INT48_S          5          // Interrupt 48 Priority Mask

/* Bit/Fields in Register PRI13 of Module NVIC                                */
#define NVIC_PRI13_INT55_M          0xE0000000 // Interrupt 55 Priority Mask
#define NVIC_PRI13_INT55_S          29         // Interrupt 55 Priority Mask
#define NVIC_PRI13_INT54_M          0x00E00000 // Interrupt 54 Priority Mask
#define NVIC_PRI13_INT54_S          21         // Interrupt 54 Priority Mask
#define NVIC_PRI13_INT53_M          0x0000E000 // Interrupt 53 Priority Mask
#define NVIC_PRI13_INT53_S          13         // Interrupt 53 Priority Mask
#define NVIC_PRI13_INT52_M          0x000000E0 // Interrupt 52 Priority Mask
#define NVIC_PRI13_INT52_S          5          // Interrupt 52 Priority Mask

/* Bit/Fields in Register PRI14 of Module NVIC                                */
#define NVIC_PRI14_INTD_M           0xE0000000 // Interrupt 59 Priority Mask
#define NVIC_PRI14_INTD_S           29         // Interrupt 59 Priority Mask
#define NVIC_PRI14_INTC_M           0x00E00000 // Interrupt 58 Priority Mask
#define NVIC_PRI14_INTC_S           21         // Interrupt 58 Priority Mask
#define NVIC_PRI14_INTB_M           0x0000E000 // Interrupt 57 Priority Mask
#define NVIC_PRI14_INTB_S           13         // Interrupt 57 Priority Mask
#define NVIC_PRI14_INTA_M           0x000000E0 // Interrupt 56 Priority Mask
#define NVIC_PRI14_INTA_S           5          // Interrupt 56 Priority Mask

/* Bit/Fields in Register PRI15 of Module NVIC                                */
#define NVIC_PRI15_INTD_M           0xE0000000 // Interrupt 63 Priority Mask
#define NVIC_PRI15_INTD_S           29         // Interrupt 63 Priority Mask
#define NVIC_PRI15_INTC_M           0x00E00000 // Interrupt 62 Priority Mask
#define NVIC_PRI15_INTC_S           21         // Interrupt 62 Priority Mask
#define NVIC_PRI15_INTB_M           0x0000E000 // Interrupt 61 Priority Mask
#define NVIC_PRI15_INTB_S           13         // Interrupt 61 Priority Mask
#define NVIC_PRI15_INTA_M           0x000000E0 // Interrupt 60 Priority Mask
#define NVIC_PRI15_INTA_S           5          // Interrupt 60 Priority Mask

/* Bit/Fields in Register PRI16 of Module NVIC                                */
#define NVIC_PRI16_INTD_M           0xE0000000 // Interrupt 67 Priority Mask
#define NVIC_PRI16_INTD_S           29         // Interrupt 67 Priority Mask
#define NVIC_PRI16_INTC_M           0x00E00000 // Interrupt 66 Priority Mask
#define NVIC_PRI16_INTC_S           21         // Interrupt 66 Priority Mask
#define NVIC_PRI16_INTB_M           0x0000E000 // Interrupt 65 Priority Mask
#define NVIC_PRI16_INTB_S           13         // Interrupt 65 Priority Mask
#define NVIC_PRI16_INTA_M           0x000000E0 // Interrupt 64 Priority Mask
#define NVIC_PRI16_INTA_S           5          // Interrupt 64 Priority Mask

/* Bit/Fields in Register PRI17 of Module NVIC                                */
#define NVIC_PRI17_INTD_M           0xE0000000 // Interrupt 71 Priority Mask
#define NVIC_PRI17_INTD_S           29         // Interrupt 71 Priority Mask
#define NVIC_PRI17_INTC_M           0x00E00000 // Interrupt 70 Priority Mask
#define NVIC_PRI17_INTC_S           21         // Interrupt 70 Priority Mask
#define NVIC_PRI17_INTB_M           0x0000E000 // Interrupt 69 Priority Mask
#define NVIC_PRI17_INTB_S           13         // Interrupt 69 Priority Mask
#define NVIC_PRI17_INTA_M           0x000000E0 // Interrupt 68 Priority Mask
#define NVIC_PRI17_INTA_S           5          // Interrupt 68 Priority Mask

/* Bit/Fields in Register PRI18 of Module NVIC                                */
#define NVIC_PRI18_INTD_M           0xE0000000 // Interrupt 75 Priority Mask
#define NVIC_PRI18_INTD_S           29         // Interrupt 75 Priority Mask
#define NVIC_PRI18_INTC_M           0x00E00000 // Interrupt 74 Priority Mask
#define NVIC_PRI18_INTC_S           21         // Interrupt 74 Priority Mask
#define NVIC_PRI18_INTB_M           0x0000E000 // Interrupt 73 Priority Mask
#define NVIC_PRI18_INTB_S           13         // Interrupt 73 Priority Mask
#define NVIC_PRI18_INTA_M           0x000000E0 // Interrupt 72 Priority Mask
#define NVIC_PRI18_INTA_S           5          // Interrupt 72 Priority Mask

/* Bit/Fields in Register PRI19 of Module NVIC                                */
#define NVIC_PRI19_INTD_M           0xE0000000 // Interrupt 79 Priority Mask
#define NVIC_PRI19_INTD_S           29         // Interrupt 79 Priority Mask
#define NVIC_PRI19_INTC_M           0x00E00000 // Interrupt 78 Priority Mask
#define NVIC_PRI19_INTC_S           21         // Interrupt 78 Priority Mask
#define NVIC_PRI19_INTB_M           0x0000E000 // Interrupt 77 Priority Mask
#define NVIC_PRI19_INTB_S           13         // Interrupt 77 Priority Mask
#define NVIC_PRI19_INTA_M           0x000000E0 // Interrupt 76 Priority Mask
#define NVIC_PRI19_INTA_S           5          // Interrupt 76 Priority Mask

