hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register PRI20 of Module NVIC                                */
#define NVIC_PRI20_INTD_M           0xE0000000 // Interrupt 83 Priority Mask
#define NVIC_PRI20_INTD_S           29         // Interrupt 83 Priority Mask
#define NVIC_PRI20_INTC_M           0x00E00000 // Interrupt 82 Priority Mask
#define NVIC_PRI20_INTC_S           21         // Interrupt 82 Priority Mask
#define NVIC_PRI20_INTB_M           0x0000E000 // Interrupt 81 Priority Mask
#define NVIC_PRI20_INTB_S           13         // Interrupt 81 Priority Mask
#define NVIC_PRI20_INTA_M           0x000000E0 // Interrupt 80 Priority Mask
#define NVIC_PRI20_INTA_S           5          // Interrupt 80 Priority Mask

/* Bit/Fields in Register PRI21 of Module NVIC                                */
#define NVIC_PRI21_INTD_M           0xE0000000 // Interrupt 87 Priority Mask
#define NVIC_PRI21_INTD_S           29         // Interrupt 87 Priority Mask
#define NVIC_PRI21_INTC_M           0x00E00000 // Interrupt 86 Priority Mask
#define NVIC_PRI21_INTC_S           21         // Interrupt 86 Priority Mask
#define NVIC_PRI21_INTB_M           0x0000E000 // Interrupt 85 Priority Mask
#define NVIC_PRI21_INTB_S           13         // Interrupt 85 Priority Mask
#define NVIC_PRI21_INTA_M           0x000000E0 // Interrupt 84 Priority Mask
#define NVIC_PRI21_INTA_S           5          // Interrupt 84 Priority Mask

/* Bit/Fields in Register PRI22 of Module NVIC                                */
#define NVIC_PRI22_INTD_M           0xE0000000 // Interrupt 91 Priority Mask
#define NVIC_PRI22_INTD_S           29         // Interrupt 91 Priority Mask
#define NVIC_PRI22_INTC_M           0x00E00000 // Interrupt 90 Priority Mask
#define NVIC_PRI22_INTC_S           21         // Interrupt 90 Priority Mask
#define NVIC_PRI22_INTB_M           0x0000E000 // Interrupt 89 Priority Mask
#define NVIC_PRI22_INTB_S           13         // Interrupt 89 Priority Mask
#define NVIC_PRI22_INTA_M           0x000000E0 // Interrupt 88 Priority Mask
#define NVIC_PRI22_INTA_S           5          // Interrupt 88 Priority Mask

/* Bit/Fields in Register PRI23 of Module NVIC                                */
#define NVIC_PRI23_INTD_M           0xE0000000 // Interrupt 95 Priority Mask
#define NVIC_PRI23_INTD_S           29         // Interrupt 95 Priority Mask
#define NVIC_PRI23_INTC_M           0x00E00000 // Interrupt 94 Priority Mask
#define NVIC_PRI23_INTC_S           21         // Interrupt 94 Priority Mask
#define NVIC_PRI23_INTB_M           0x0000E000 // Interrupt 93 Priority Mask
#define NVIC_PRI23_INTB_S           13         // Interrupt 93 Priority Mask
#define NVIC_PRI23_INTA_M           0x000000E0 // Interrupt 92 Priority Mask
#define NVIC_PRI23_INTA_S           5          // Interrupt 92 Priority Mask

/* Bit/Fields in Register PRI24 of Module NVIC                                */
#define NVIC_PRI24_INTD_M           0xE0000000 // Interrupt 99 Priority Mask
#define NVIC_PRI24_INTD_S           29         // Interrupt 99 Priority Mask
#define NVIC_PRI24_INTC_M           0x00E00000 // Interrupt 98 Priority Mask
#define NVIC_PRI24_INTC_S           21         // Interrupt 98 Priority Mask
#define NVIC_PRI24_INTB_M           0x0000E000 // Interrupt 97 Priority Mask
#define NVIC_PRI24_INTB_S           13         // Interrupt 97 Priority Mask
#define NVIC_PRI24_INTA_M           0x000000E0 // Interrupt 96 Priority Mask
#define NVIC_PRI24_INTA_S           5          // Interrupt 96 Priority Mask

/* Bit/Fields in Register PRI25 of Module NVIC                                */
#define NVIC_PRI25_INTD_M           0xE0000000 // Interrupt 103 Priority Mask
#define NVIC_PRI25_INTD_S           29         // Interrupt 103 Priority Mask
#define NVIC_PRI25_INTC_M           0x00E00000 // Interrupt 102 Priority Mask
#define NVIC_PRI25_INTC_S           21         // Interrupt 102 Priority Mask
#define NVIC_PRI25_INTB_M           0x0000E000 // Interrupt 101 Priority Mask
#define NVIC_PRI25_INTB_S           13         // Interrupt 101 Priority Mask
#define NVIC_PRI25_INTA_M           0x000000E0 // Interrupt 100 Priority Mask
#define NVIC_PRI25_INTA_S           5          // Interrupt 100 Priority Mask

/* Bit/Fields in Register PRI26 of Module NVIC                                */
#define NVIC_PRI26_INTD_M           0xE0000000 // Interrupt 107 Priority Mask
#define NVIC_PRI26_INTD_S           29         // Interrupt 107 Priority Mask
#define NVIC_PRI26_INTC_M           0x00E00000 // Interrupt 106 Priority Mask
#define NVIC_PRI26_INTC_S           21         // Interrupt 106 Priority Mask
#define NVIC_PRI26_INTB_M           0x0000E000 // Interrupt 105 Priority Mask
#define NVIC_PRI26_INTB_S           13         // Interrupt 105 Priority Mask
#define NVIC_PRI26_INTA_M           0x000000E0 // Interrupt 104 Priority Mask
#define NVIC_PRI26_INTA_S           5          // Interrupt 104 Priority Mask

/* Bit/Fields in Register PRI27 of Module NVIC                                */
#define NVIC_PRI27_INTD_M           0xE0000000 // Interrupt 111 Priority Mask
#define NVIC_PRI27_INTD_S           29         // Interrupt 111 Priority Mask
#define NVIC_PRI27_INTC_M           0x00E00000 // Interrupt 110 Priority Mask
#define NVIC_PRI27_INTC_S           21         // Interrupt 110 Priority Mask
#define NVIC_PRI27_INTB_M           0x0000E000 // Interrupt 109 Priority Mask
#define NVIC_PRI27_INTB_S           13         // Interrupt 109 Priority Mask
#define NVIC_PRI27_INTA_M           0x000000E0 // Interrupt 108 Priority Mask
#define NVIC_PRI27_INTA_S           5          // Interrupt 108 Priority Mask

/* Bit/Fields in Register PRI28 of Module NVIC                                */
#define NVIC_PRI28_INTD_M           0xE0000000 // Interrupt 115 Priority Mask
#define NVIC_PRI28_INTD_S           29         // Interrupt 115 Priority Mask
#define NVIC_PRI28_INTC_M           0x00E00000 // Interrupt 114 Priority Mask
#define NVIC_PRI28_INTC_S           21         // Interrupt 114 Priority Mask
#define NVIC_PRI28_INTB_M           0x0000E000 // Interrupt 113 Priority Mask
#define NVIC_PRI28_INTB_S           13         // Interrupt 113 Priority Mask
#define NVIC_PRI28_INTA_M           0x000000E0 // Interrupt 112 Priority Mask
#define NVIC_PRI28_INTA_S           5          // Interrupt 112 Priority Mask

/* Bit/Fields in Register PRI29 of Module NVIC                                */
#define NVIC_PRI29_INTD_M           0xE0000000 // Interrupt 119 Priority Mask
#define NVIC_PRI29_INTD_S           29         // Interrupt 119 Priority Mask
#define NVIC_PRI29_INTC_M           0x00E00000 // Interrupt 118 Priority Mask
#define NVIC_PRI29_INTC_S           21         // Interrupt 118 Priority Mask
#define NVIC_PRI29_INTB_M           0x0000E000 // Interrupt 117 Priority Mask
#define NVIC_PRI29_INTB_S           13         // Interrupt 117 Priority Mask
#define NVIC_PRI29_INTA_M           0x000000E0 // Interrupt 116 Priority Mask
#define NVIC_PRI29_INTA_S           5          // Interrupt 116 Priority Mask

/* Bit/Fields in Register PRI30 of Module NVIC                                */
#define NVIC_PRI30_INTD_M           0xE0000000 // Interrupt 123 Priority Mask
#define NVIC_PRI30_INTD_S           29         // Interrupt 123 Priority Mask
#define NVIC_PRI30_INTC_M           0x00E00000 // Interrupt 122 Priority Mask
#define NVIC_PRI30_INTC_S           21         // Interrupt 122 Priority Mask
#define NVIC_PRI30_INTB_M           0x0000E000 // Interrupt 121 Priority Mask
#define NVIC_PRI30_INTB_S           13         // Interrupt 121 Priority Mask
#define NVIC_PRI30_INTA_M           0x000000E0 // Interrupt 120 Priority Mask
#define NVIC_PRI30_INTA_S           5          // Interrupt 120 Priority Mask

/* Bit/Fields in Register PRI31 of Module NVIC                                */
#define NVIC_PRI31_INTD_M           0xE0000000 // Interrupt 127 Priority Mask
#define NVIC_PRI31_INTD_S           29         // Interrupt 127 Priority Mask
#define NVIC_PRI31_INTC_M           0x00E00000 // Interrupt 126 Priority Mask
#define NVIC_PRI31_INTC_S           21         // Interrupt 126 Priority Mask
#define NVIC_PRI31_INTB_M           0x0000E000 // Interrupt 125 Priority Mask
#define NVIC_PRI31_INTB_S           13         // Interrupt 125 Priority Mask
#define NVIC_PRI31_INTA_M           0x000000E0 // Interrupt 124 Priority Mask
#define NVIC_PRI31_INTA_S           5          // Interrupt 124 Priority Mask

