hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register HFAULT of Module NVIC                               */
#define NVIC_HFAULT_STAT_DBG_B      0x80000000 // Debug Event
#define NVIC_HFAULT_STAT_FORCED_B   0x40000000 // Forced Hard Fault
#define NVIC_HFAULT_STAT_VECT_B     0x00000002 // Vector Table Read Fault

/* Bit/Fields in Register DEBUG of Module NVIC                                */
#define NVIC_DEBUG_STAT_EXTRNL_B    0x00000010 // EDBGRQ asserted
#define NVIC_DEBUG_STAT_VCATCH_B    0x00000008 // Vector catch
#define NVIC_DEBUG_STAT_DWTTRAP_B   0x00000004 // DWT match
#define NVIC_DEBUG_STAT_BKPT_B      0x00000002 // Breakpoint instruction
#define NVIC_DEBUG_STAT_HALTED_B    0x00000001 // Halt request

/* Bit/Fields in Register MM of Module NVIC                                   */
#define NVIC_MM_ADDR_M              0xFFFFFFFF // Fault Address
#define NVIC_MM_ADDR_S              0          // Fault Address

/* Bit/Fields in Register FAULT of Module NVIC                                */
#define NVIC_FAULT_ADDR_M           0xFFFFFFFF // Fault Address
#define NVIC_FAULT_ADDR_S           0          // Fault Address

/* Bit/Fields in Register CPAC of Module NVIC                                 */
#define NVIC_CPAC_CP11_M            0x00C00000 // CP11 Coprocessor Access
#define NVIC_CPAC_CP11_S            22         // CP11 Coprocessor Access
#define NVIC_CPAC_CP11_DIS_V        0x00000000 // Access Denied
#define NVIC_CPAC_CP11_PRIV_V       0x00400000 // Privileged Access Only
#define NVIC_CPAC_CP11_FULL_V       0x00C00000 // Full Access
#define NVIC_CPAC_CP10_M            0x00300000 // CP10 Coprocessor Access
#define NVIC_CPAC_CP10_S            20         // CP10 Coprocessor Access
#define NVIC_CPAC_CP10_DIS_V        0x00000000 // Access Denied
#define NVIC_CPAC_CP10_PRIV_V       0x00100000 // Privileged Access Only
#define NVIC_CPAC_CP10_FULL_V       0x00300000 // Full Access

/* Bit/Fields in Register MPU of Module NVIC                                  */
#define NVIC_MPU_TYPE_IREGION_M     0x00FF0000 // Number of I Regions
#define NVIC_MPU_TYPE_IREGION_S     16         // Number of I Regions
#define NVIC_MPU_TYPE_DREGION_M     0x0000FF00 // Number of D Regions
#define NVIC_MPU_TYPE_DREGION_S     8          // Number of D Regions
#define NVIC_MPU_TYPE_SEPARATE_B    0x00000001 // Separate or Unified MPU
#define NVIC_MPU_CTRL_PRIVDEFEN_B   0x00000004 // MPU Default Region
#define NVIC_MPU_CTRL_HFNMIENA_B    0x00000002 // MPU Enabled During Faults
#define NVIC_MPU_CTRL_ENABLE_B      0x00000001 // MPU Enable
#define NVIC_MPU_NUMBER_M           0x00000007 // MPU Region to Access
#define NVIC_MPU_NUMBER_S           0          // MPU Region to Access
#define NVIC_MPU_BASE_ADDR_M        0xFFFFFFE0 // Base Address Mask
#define NVIC_MPU_BASE_ADDR_S        5          // Base Address Mask
#define NVIC_MPU_BASE_VALID_B       0x00000010 // Region Number Valid
#define NVIC_MPU_BASE_REGION_M      0x00000007 // Region Number
#define NVIC_MPU_BASE_REGION_S      0          // Region Number
#define NVIC_MPU_ATTR_XN_B          0x10000000 // Instruction Access Disable
#define NVIC_MPU_ATTR_AP_M          0x07000000 // Access Privilege
#define NVIC_MPU_ATTR_AP_S          24         // Access Privilege
#define NVIC_MPU_ATTR_TEX_M         0x00380000 // Type Extension Mask
#define NVIC_MPU_ATTR_TEX_S         19         // Type Extension Mask
#define NVIC_MPU_ATTR_SHAREABLE_B   0x00040000 // Shareable
#define NVIC_MPU_ATTR_CACHEABLE_B   0x00020000 // Cacheable
#define NVIC_MPU_ATTR_BUFFRABLE_B   0x00010000 // Bufferable
#define NVIC_MPU_ATTR_SRD_M         0x0000FF00 // Subregion Disable Bits
#define NVIC_MPU_ATTR_SRD_S         8          // Subregion Disable Bits
#define NVIC_MPU_ATTR_SIZE_M        0x0000003E // Region Size Mask
#define NVIC_MPU_ATTR_SIZE_S        1          // Region Size Mask
#define NVIC_MPU_ATTR_ENABLE_B      0x00000001 // Region Enable
#define NVIC_MPU_BASE1_ADDR_M       0xFFFFFFE0 // Base Address Mask
#define NVIC_MPU_BASE1_ADDR_S       5          // Base Address Mask
#define NVIC_MPU_BASE1_VALID_B      0x00000010 // Region Number Valid
#define NVIC_MPU_BASE1_REGION_M     0x00000007 // Region Number
#define NVIC_MPU_BASE1_REGION_S     0          // Region Number
#define NVIC_MPU_ATTR1_XN_B         0x10000000 // Instruction Access Disable
#define NVIC_MPU_ATTR1_AP_M         0x07000000 // Access Privilege
#define NVIC_MPU_ATTR1_AP_S         24         // Access Privilege
#define NVIC_MPU_ATTR1_TEX_M        0x00380000 // Type Extension Mask
#define NVIC_MPU_ATTR1_TEX_S        19         // Type Extension Mask
#define NVIC_MPU_ATTR1_SRD_M        0x0000FF00 // Subregion Disable Bits
#define NVIC_MPU_ATTR1_SRD_S        8          // Subregion Disable Bits
#define NVIC_MPU_ATTR1_SIZE_M       0x0000003E // Region Size Mask
#define NVIC_MPU_ATTR1_SIZE_S       1          // Region Size Mask
#define NVIC_MPU_ATTR1_ENABLE_B     0x00000001 // Region Enable
#define NVIC_MPU_BASE2_ADDR_M       0xFFFFFFE0 // Base Address Mask
#define NVIC_MPU_BASE2_ADDR_S       5          // Base Address Mask
#define NVIC_MPU_BASE2_VALID_B      0x00000010 // Region Number Valid
#define NVIC_MPU_BASE2_REGION_M     0x00000007 // Region Number
#define NVIC_MPU_BASE2_REGION_S     0          // Region Number
#define NVIC_MPU_ATTR2_XN_B         0x10000000 // Instruction Access Disable
#define NVIC_MPU_ATTR2_AP_M         0x07000000 // Access Privilege
#define NVIC_MPU_ATTR2_AP_S         24         // Access Privilege
#define NVIC_MPU_ATTR2_TEX_M        0x00380000 // Type Extension Mask
#define NVIC_MPU_ATTR2_TEX_S        19         // Type Extension Mask
#define NVIC_MPU_ATTR2_SRD_M        0x0000FF00 // Subregion Disable Bits
#define NVIC_MPU_ATTR2_SRD_S        8          // Subregion Disable Bits
#define NVIC_MPU_ATTR2_SIZE_M       0x0000003E // Region Size Mask
#define NVIC_MPU_ATTR2_SIZE_S       1          // Region Size Mask
#define NVIC_MPU_ATTR2_ENABLE_B     0x00000001 // Region Enable
#define NVIC_MPU_BASE3_ADDR_M       0xFFFFFFE0 // Base Address Mask
#define NVIC_MPU_BASE3_ADDR_S       5          // Base Address Mask
#define NVIC_MPU_BASE3_VALID_B      0x00000010 // Region Number Valid
#define NVIC_MPU_BASE3_REGION_M     0x00000007 // Region Number
#define NVIC_MPU_BASE3_REGION_S     0          // Region Number
#define NVIC_MPU_ATTR3_XN_B         0x10000000 // Instruction Access Disable
#define NVIC_MPU_ATTR3_AP_M         0x07000000 // Access Privilege
#define NVIC_MPU_ATTR3_AP_S         24         // Access Privilege
#define NVIC_MPU_ATTR3_TEX_M        0x00380000 // Type Extension Mask
#define NVIC_MPU_ATTR3_TEX_S        19         // Type Extension Mask
#define NVIC_MPU_ATTR3_SRD_M        0x0000FF00 // Subregion Disable Bits
#define NVIC_MPU_ATTR3_SRD_S        8          // Subregion Disable Bits
#define NVIC_MPU_ATTR3_SIZE_M       0x0000003E // Region Size Mask
#define NVIC_MPU_ATTR3_SIZE_S       1          // Region Size Mask
#define NVIC_MPU_ATTR3_ENABLE_B     0x00000001 // Region Enable

/* Bit/Fields in Register DBG of Module NVIC                                  */
#define NVIC_DBG_CTRL_DBGKEY_M      0xFFFF0000 // Debug key mask
#define NVIC_DBG_CTRL_DBGKEY_S      16         // Debug key mask
#define NVIC_DBG_CTRL_DBGKEY_V      0xA05F0000 // Debug key
#define NVIC_DBG_CTRL_S_LOCKUP_V    0x00080000 // Core is locked up
#define NVIC_DBG_CTRL_S_SLEEP_V     0x00040000 // Core is sleeping
#define NVIC_DBG_CTRL_S_HALT_V      0x00020000 // Core status on halt
#define NVIC_DBG_CTRL_S_REGRDY_V    0x00010000 // Register read/write available
#define NVIC_DBG_CTRL_C_MASKINT_B   0x00000008 // Mask interrupts when stepping
#define NVIC_DBG_CTRL_C_STEP_B      0x00000004 // Step the core
#define NVIC_DBG_CTRL_C_HALT_B      0x00000002 // Halt the core
#define NVIC_DBG_CTRL_C_DEBUGEN_B   0x00000001 // Enable debug
#define NVIC_DBG_XFER_REG_WNR_B     0x00010000 // Write or not read
#define NVIC_DBG_XFER_REG_SEL_M     0x0000001F // Register
#define NVIC_DBG_XFER_REG_SEL_S     0          // Register
#define NVIC_DBG_XFER_REG_R0_V      0x00000000 // Register R0
#define NVIC_DBG_XFER_REG_R1_V      0x00000001 // Register R1
#define NVIC_DBG_XFER_REG_R2_V      0x00000002 // Register R2
#define NVIC_DBG_XFER_REG_R3_V      0x00000003 // Register R3
#define NVIC_DBG_XFER_REG_R4_V      0x00000004 // Register R4
#define NVIC_DBG_XFER_REG_R5_V      0x00000005 // Register R5
#define NVIC_DBG_XFER_REG_R6_V      0x00000006 // Register R6
#define NVIC_DBG_XFER_REG_R7_V      0x00000007 // Register R7
#define NVIC_DBG_XFER_REG_R8_V      0x00000008 // Register R8
#define NVIC_DBG_XFER_REG_R9_V      0x00000009 // Register R9
#define NVIC_DBG_XFER_REG_R10_V     0x0000000A // Register R10
#define NVIC_DBG_XFER_REG_R11_V     0x0000000B // Register R11
#define NVIC_DBG_XFER_REG_R12_V     0x0000000C // Register R12
#define NVIC_DBG_XFER_REG_R13_V     0x0000000D // Register R13
#define NVIC_DBG_XFER_REG_R14_V     0x0000000E // Register R14
#define NVIC_DBG_XFER_REG_R15_V     0x0000000F // Register R15
#define NVIC_DBG_XFER_REG_FLAGS_V   0x00000010 // xPSR/Flags register
#define NVIC_DBG_XFER_REG_MSP_V     0x00000011 // Main SP
#define NVIC_DBG_XFER_REG_PSP_V     0x00000012 // Process SP
#define NVIC_DBG_XFER_REG_DSP_V     0x00000013 // Deep SP
#define NVIC_DBG_XFER_REG_CFBP_V    0x00000014 // Control/Fault/BasePri/PriMask
#define NVIC_DBG_DATA_M             0xFFFFFFFF // Data temporary cache
#define NVIC_DBG_DATA_S             0          // Data temporary cache
#define NVIC_DBG_INT_HARDERR_V      0x00000400 // Debug trap on hard fault
#define NVIC_DBG_INT_INTERR_V       0x00000200 // Debug trap on interrupt errors
#define NVIC_DBG_INT_BUSERR_V       0x00000100 // Debug trap on bus error
#define NVIC_DBG_INT_STATERR_V      0x00000080 // Debug trap on usage fault state
#define NVIC_DBG_INT_CHKERR_V       0x00000040 // Debug trap on usage fault check
#define NVIC_DBG_INT_NOCPERR_V      0x00000020 // Debug trap on coprocessor error
#define NVIC_DBG_INT_MMERR_V        0x00000010 // Debug trap on mem manage fault
#define NVIC_DBG_INT_RESET_V        0x00000008 // Core reset status
#define NVIC_DBG_INT_RSTPENDCLR_V   0x00000004 // Clear pending core reset
#define NVIC_DBG_INT_RSTPENDING_V   0x00000002 // Core reset is pending
#define NVIC_DBG_INT_RSTVCATCH_V    0x00000001 // Reset vector catch

/* Bit/Fields in Register SW of Module NVIC                                   */
#define NVIC_SW_TRIG_INTID_M        0x000000FF // Interrupt ID
#define NVIC_SW_TRIG_INTID_S        0          // Interrupt ID

