hans-jorg/tiva-tm4c123gxl-launchpad-cmsis/15-InterruptDriven/tm4c123gh6pm-fields.h
/* Bit/Fields in Register FPCC of Module NVIC                                 */
#define NVIC_FPCC_ASPEN_B           0x80000000 // Automatic State Preservation
#define NVIC_FPCC_LSPEN_B           0x40000000 // Lazy State Preservation Enable
#define NVIC_FPCC_MONRDY_B          0x00000100 // Monitor Ready
#define NVIC_FPCC_BFRDY_B           0x00000040 // Bus Fault Ready
#define NVIC_FPCC_MMRDY_B           0x00000020 // Memory Management Fault Ready
#define NVIC_FPCC_HFRDY_B           0x00000010 // Hard Fault Ready
#define NVIC_FPCC_THREAD_B          0x00000008 // Thread Mode
#define NVIC_FPCC_USER_B            0x00000002 // User Privilege Level
#define NVIC_FPCC_LSPACT_B          0x00000001 // Lazy State Preservation Active

/* Bit/Fields in Register FPCA of Module NVIC                                 */
#define NVIC_FPCA_ADDRESS_M         0xFFFFFFF8 // Address
#define NVIC_FPCA_ADDRESS_S         3          // Address

/* Bit/Fields in Register FPDSC of Module NVIC                                */
#define NVIC_FPDSC_AHP_B            0x04000000 // AHP Bit Default
#define NVIC_FPDSC_DN_B             0x02000000 // DN Bit Default
#define NVIC_FPDSC_FZ_B             0x01000000 // FZ Bit Default
#define NVIC_FPDSC_RMODE_M          0x00C00000 // RMODE Bit Default
#define NVIC_FPDSC_RMODE_S          22         // RMODE Bit Default
#define NVIC_FPDSC_RMODE_RN_V       0x00000000 // Round to Nearest (RN) mode
#define NVIC_FPDSC_RMODE_RP_V       0x00400000 // Round towards Plus Infinity (RP)
#define NVIC_FPDSC_RMODE_RM_V       0x00800000 // Round towards Minus Infinity
#define NVIC_FPDSC_RMODE_RZ_V       0x00C00000 // Round towards Zero (RZ) mode

#endif // TM4C123GH6PM_FIELDS
